Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/contracting/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Exploring basic rules
uk: Розглянемо основні правила

source: Let's try exploring the `/contracts` endpoint:
uk: Подивимось як працює точка входу `/contracts`:

source: Just invoking it reveals an empty set.
uk: При виклику видає пустий набір.

source: Contract is transferred from the tender system by an automated process.
uk: Перенесенням договору із системи закупівель займається автоматизований процес.

source: Creating contract
uk: Створення договору

source: Let's say that we have conducted tender and it has ``complete`` status. When the tender is completed, contract (that has been created in the tender system) is transferred to the contract system **automatically**.
uk: Нехай у нас відбулась закупівля і вона є в статусі ``complete``. Після цього договір, створений в системі закупівель, потрапляє в систему договорів.

source: *Brokers (eMalls) can't create contracts in the contract system.*
uk: *Майданчики (брокери) не мають можливості створювати договори в системі договорів.*

source: Getting contract
uk: Отримання договору

source: Contract in the tender system
uk: Договір в системі закупівель

source: *Contract id is the same in both tender and contract system.*
uk: *Ідентифікатор `id` договору однаковий в системах закупівель та договорів.*

source: Let's access the URL of the created object:
uk: Спробуємо доступитись до URL створеного об’єкта:

source: Getting access
uk: Отримання доступу

source: In order to get rights for future contract editing, you need to use this view ``PATCH: /contracts/{id}/credentials?acc_token={tender_token}`` with the API key of the eMall (broker), where tender was generated.
uk: Для того, щоб отримати права для майбутнього редагування договору, необхідно використати таку в’юшку ``PATCH: /contracts/{id}/credentials?acc_token={tender_token}`` з API ключем майданчика, де була згенерована закупівля.

source: In the ``PATCH: /contracts/{id}/credentials?acc_token={tender_token}``:
uk: В ``PATCH: /contracts/{id}/credentials?acc_token={tender_token}``:

source: ``id`` stands for contract id,
uk: ``id`` - це ідентифікатор договору,

source: ``tender_token`` is tender's token (is used for contract token generation).
uk: ``tender_token`` - це токен закупівлі (використовується для генерування токена договору).

source: Response will contain ``access.token`` for the contract that can be used for further contract modification.
uk: У відповіді буде ``access.token`` для договору, який буде використовуватись для модифікації договору.

source: Let's view contracts.
uk: Переглянемо договори.

source: We do see the internal `id` of a contract (that can be used to construct full URL by prepending `http://api-sandbox.openprocurement.org/api/0/contracts/`) and its `dateModified` datestamp.
uk: Ми бачимо внутрішнє `id` договору (що може бути використано для побудови повної URL-адреси, якщо додати `http://api-sandbox.openprocurement.org/api/0/contracts/`) та його dateModified дату.

source: Modifying contract
uk: Редагування договору

source: You can make changes to the contract in cases described in the 4th part of Article 36 of the Law "On the Public Procurement".
uk: Внесення змін до істотних умов договору можливі у випадках, описаних частиною четвертою статті 36 Закону України “Про публічні закупівлі”.

source: **Essential contract terms** can be modified by the submission of a new :ref:`change` object to the `Contract.changes` container.
uk: **Істотні умови договору** можуть бути змінені поданням нового об’єкта :ref:`change` в котейнер `Contract.changes`.

source: All `changes` are processed by the endpoint `/contracts/{id}/changes`.
uk: Всі зміни `change` обробляються точкою входу (endpoint) `/contracts/{id}/changes`.

source: Submitting a change
uk: Подання зміни

source: Let's add new `change` to the contract:
uk: Додамо нову зміну `change` до договору:

source: Note that you can provide more than one value in ``rationaleTypes`` field.
uk: Зверніть увагу на те, що ви можете надати більше ніж одне значення для поля ``rationaleTypes``.

source: You can view the `change`:
uk: Ви можете переглянути зміну `change`:

source: `Change` can be modified while it is in the ``pending`` status:
uk: Зміну `change` можна модифікувати доки вона має статус ``pending``.

source: Uploading change document
uk: Завантаження документа зміни

source: Document can be added only while `change` is in the ``pending`` status.
uk: Документ можна додати доки зміна `change` має статус ``pending``.

source: Document has to be added in two stages:
uk: Документ додається в два етапи:

source: you should upload document
uk: ви повинні завантажити документ

source: you should set document properties ``"documentOf": "change"`` and ``"relatedItem": "{change.id}"`` in order to bind the uploaded document to the `change`:
uk: ви повинні задати властивості документа: ``"documentOf": "change"`` та ``"relatedItem": "{change.id}"``, щоб "прив’язати" завантажений документ до зміни `change`:

source: Updating contract properties
uk: Оновлення властивостей зміни

source: Now you can update contract properties which belong to the change.
uk: Тепер ви можете оновити властивості договору, що стосуються зміни.

source: You can update value `amount` and `amountNet` following next rules:
uk: Ви можете встановити нові значення для полів `amount` та `amountNet` керуючись наступними правилами:

source: We see the added properties have merged with existing contract data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними закупівлі. Додатково оновлена властивість `dateModified`, щоб відображати останню дату модифікації.

source: Fields that can be modified: `title`, `description`, `status`, `value.amount`, `value.amountNet`, `period`, `items`, `amountPaid.amount`, `amountPaid.amountNet`, `terminationDetails`.
uk: Поля, які можна модифікувати: `title`, `description`, `status`, `value.amount`, `value.amountNet`, `period`, `items`, `amountPaid.amount`, `amountPaid.amountТуе`, `terminationDetails`.

source: See examples of `items` customization below. You can:
uk: Дивіться приклади зміни елемента (`items`) нижче. Ви можете:

source: update item:
uk: оновити елемент (`items`):

source: Applying the change
uk: Застосування зміни

source: `Change` can be applied by switching to the ``active`` status.
uk: Зміна `change` застосовується при переключенні в статус ``active``.

source: In order to apply ``active`` status `dateSigned` field must be set.
uk: Щоб застосувати статус ``active`` потрібно встановити поле `dateSigned`.

source: After this `change` can't be modified anymore.
uk: ПІсля цього модифікувати зміну `change` вже не можна.

source: `dateSigned` field validation:
uk: Валідація поля `dateSigned`:

source: for the first contract `change` date should be after `contract.dateSigned`;
uk: для першої зміни `change` договору дата повинна бути після `contract.dateSigned`;

source: for all next `change` objects date should be after the previous `change.dateSigned`.
uk: для всіх наступних змін `change` договору дата повинна бути після попередньої дати `change.dateSigned`.

source: You can view all changes:
uk: Ви можете переглянути всі зміни:

source: All changes are also listed on the contract view.
uk: Всі зміни присутні при перегляді контракту.

source: Uploading documentation
uk: Завантаження документації

source: Procuring entity can upload PDF files into the created contract. Uploading should follow the :ref:`upload` rules.
uk: Замовник може завантажити PDF файл у створений договір. Завантаження повинно відбуватись згідно правил :ref:`upload`.

source: `201 Created` response code and `Location` header confirm document creation. We can additionally query the `documents` collection API endpoint to confirm the action:
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ було створено. Додатково можна зробити запит точки входу API колекції документів, щоб підтвердити дію:

source: And again we can confirm that there are two documents uploaded.
uk: І знову можна перевірити, що є два завантажених документа.

source: In case we made an error, we can reupload the document over the older version:
uk: Якщо сталась помилка, ми можемо ще раз завантажити документ поверх старої версії:

source: And we can see that it is overriding the original version:
uk: І ми бачимо, що вона перекриває оригінальну версію:

source: Completing contract
uk: Завершення договору

source: Before contract can be completed ``amountPaid`` field value should be set (regardless whether the contract was successful or unsuccessful). Contract can be completed by switching to ``terminated`` status. Let's perform these actions in single request:
uk: Перед завершенням договору необхідно встановити значення поля ``amountPaid`` (незалежно від того успішний договір чи ні). Договір можна завершити переключенням у статус ``terminated``. Виконаємо ці дії єдиним запитом:

source: Note that you can set/change only ``amountPaid.amount`` value. ``amountPaid.currency`` and ``amountPaid.valueAddedTaxIncluded`` fields' values are generated from ``Contract.value`` field.
uk: Зверніть увагу, що ви можете встановлювати/змінювати значення ``amountPaid.amount``. А значення полів ``amountPaid.currency`` і ``amountPaid.valueAddedTaxIncluded`` генеруються з поля ``Contract.value``.

source: If contract is unsuccessful reasons for termination ``terminationDetails`` should be specified.
uk: Якщо договір неуспішний, то потрібно вказати причини його припинення ``terminationDetails``.

source: Any future modification to the contract are not allowed.
uk: Після цього додання змін до договору не дозволяється.
