Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/basic-actions/bid-requirement-response.po
Languages: uk

source: Bid Requirement response
uk: Відповідь на вимогу в пропозиції

source: Bid requirement response - an object that shows that the user meets the tender owner requirements, and can participate in the procurement.
uk: Відповідь на вимогу - об'єкт який показує що користувач відповідає вимогам замовника, та може приймати участь у закупівлі.

source: Any action on the requirement response in the bid can be performed only by the bid owner.
uk: Будь-які дії над відповіддю на вимогу в пропозиції може виконувати лише власник пропозиції.

source: Requirement response basic operation
uk: Базові операції над відповідями на вимоги

source: Requirement response data :ref:`scheme<RequirementResponse>`
uk: Схема даних :ref:`відповіді на вимогу<RequirementResponse>`

source: Create Bid Requirement Response
uk: Створення відповіді на вимогу

source: You can create few requirement responses in one request with complete set of data.
uk: Можливо створити декілька відповідей на вимогу за один запит з повним набором даних.

source: You can create requirement responses in one request with bid patch.
uk: Можливо також створювати відповіді на вимоги одним запитом через оновлення пропозиції.

source: Update Bid Requirement Response
uk: Оновлення відповіді на вимогу

source: You can patch requirement responses in one request with bid patch, and you must send data about other requirement responses or this other requirement responses will be deleted.
uk: Можливо редагувати відповіді на вимоги один запитом через оновлення пропозиції, але потрібно передавати також всі відповіді на вимоги, або віповіді, які не будуть передані - будуть видалені.

source: Get Bid Requirement Response
uk: Отримання інформації по відповіді на вимогу

source: Delete Requirement Response
uk: Видалення відповіді на вимогу

source: You can delete requirement responses in one request with bid patch, not send this requirement response data.
uk: Можливо видалити відповіді на вимогу за один запит через оновлення пропозиції, просто не передавши ці відповіді.

source: Evidence basic operation
uk: Базові операції над доказами

source: Evidence data :ref:`scheme<evidence>`
uk: Схема даних :ref:`доказу<evidence>`

source: Create Requirement Response Evidence
uk: Створення Доказу

source: Update Requirement Response Evidence
uk: Оновлення доказу

source: Get Requirement Response Evidence
uk: Отримання інформації по доказу

source: Delete Requirement Response Evidence
uk: Видалення доказу

source: Bid activation
uk: Активація пропозіції

source: When you update bid to `active`/`pending` status or PATCH bid in these statuses, the validation is triggered that checks the compliance of the responses and criteria requirements.
uk: Коли пропозіція переходить до стаусу `active`/`pending` або оновлюється в цих статусах, спрацьoвує валідація яка перевіряє відповідність відповідей та критерій.

source: Responses are necessary only for criteria that have at least one requirement in status "active".
uk: Відповіді обов'язкові лише для критеріїв, які мають хоча б одину вимогу у статусі `active`.

source: Error when bid doesn't have response for one of criteria:
uk: Помилка, коли в пропозіції немає відповідей на один з критеріїв:

source: Error when bid have responses for few requirement groups inside one criteria:
uk: Помилка, коли в пропозиції існують відповіді на декілька груп вимог в рамках одного критерію:

source: Error when bid doesn't have all responses for all requirements inside requirement group:
uk: Помилка, коли пропозиція не містить відповіді хоча б на одну вимогу в рамках однієї групи вимог:

source: Workflow Requirement Response
uk: Схема роботи відповідей на вимогу

source: Workflow of requirement response you could see here: :ref:`Criteria Workflow <criteria_workflow>`
uk: Схему роботу ви можете побачити тут: :ref:`Схема роботи <criteria_workflow>`
