Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/basic-actions/criteria.po
Languages: uk

source: Criteria Basic Operation
uk: Базові операції над критеріями

source: Criteria data :ref:`schema<criterion>`
uk: Схема даних :ref:`критеріїв<criterion>`

source: Criteria is part of tender documentation, so all operation with criteria make tender owner.
uk: Критерії це частина тенедрної документації, тому всі дії над критеріями може виконувати лише власник тендеру.

source: Create Tender Criteria
uk: Створення критеріїв закупівлі

source: Criteria exist in procedures: belowThreshold, aboveThresholdUA, aboveThresholdEU, competitiveDialogueUA, competitiveDialogueEU, competitiveDialogueUA.stage2, competitiveDialogueEU.stage2, esco, closeFrameworkAgreementUA, closeFrameworkAgreementSelectionUA
uk: Критіерії існуть в даних процедурах: belowThreshold, aboveThresholdUA, aboveThresholdEU, competitiveDialogueUA, competitiveDialogueEU, competitiveDialogueUA.stage2, competitiveDialogueEU.stage2, esco, closeFrameworkAgreementUA, closeFrameworkAgreementSelectionUA

source: Criteria can be related to tenderer, lot, item and tender. You cannot cancel lot or item if there is at least one related criterion with requirement in `active` status. To cancel lot or set item quantity to 0 you should set `cancelled` status to all active requirements in related criterion.
uk: Критерії можуть бути пов'язані з tenderer, lot, item та tender. Ви не можете відмінити lot або item якщо існує хоча б один пов'язаний критерії з вимогою в статусі `active`. Щоб скасувати lot чи вказати кількість item рівною 0, необхідно перевести у статус `cancelled` всі активні вимоги пов'язаного критерію.

source: You can create few criteria in one request with complete set of data.
uk: Можна створити одразу декілька критеріїв за один запит з повним набором даних.

source: Update Tender Criteria
uk: Оновлення критерію закупівлі

source: Get Tender Criteria
uk: Отримання інформації по критерію закупівлі

source: Requirement Group basic operation
uk: Базові операції над групами вимог

source: Requirement group :ref:`schema<RequirementGroup>`
uk: Схема даних :ref:`групи вимог<RequirementGroup>`

source: Requirement group that's object that contain requirements, and sets the rules for how to respond to requirements.
uk: Група вимог це об'єкт який містить вимоги, та встановулює правила як, та на які вимоги надавати відповідь.

source: Inside requirement groups you must gave response to all requirements(that's mean gave response to requirement group). If criterion have more than one requirement groups you must gave response only to one requirement group. If you try to gave responses to few requirement groups system will be returned error.
uk: В рамках групи вимог потрібно надати відповідь на всі вимоги(це означає відповісти на групу вимог). Якщо критеріон має більше однієї групи вимог, потрібно надати відповідь лише на одну групу, у випадку, якщо відповідь буде надана більше ніж на одну групу система поверне помилку.

source: :ref:`There you can see how it works on practice. <bid_activation_with_requirement_responses>`
uk: :ref:`Тут ви можете побачити як це працює. <bid_activation_with_requirement_responses>`

source: Create Criteria Requirement Group
uk: Створення групи вимог

source: Update Criteria Requirement Group
uk: Оновлення групи вимог

source: Get Criteria Requirement Group
uk: Отпимання інформації по групам вимог

source: Requirement basic operation
uk: Базові операції над вимогами

source: Requirement model :ref:`schema<requirement>`
uk: Схема даних :ref:`вимог<requirement>`

source: Create Requirement
uk: Створення вимоги

source: Update Requirement
uk: Оновлення вимоги

source: You can use PATCH method to update requirements for tenders in draft statuses.
uk: Ви можете використати PATCH метод для оновлення вимоги для тендеру в статусі чернетки.

source: To update requirement in non-draft status of tender you should use PUT method. New version with status `active` will be created. Status of old version of requirement will be changed to `cancelled`.
uk: Для оновлення вимоги у `active.enquries` та `active.tendering` статусах тендера необхідно використовувати метод PUT. Нова версія вимоги зі статусом `active` буде створена. Статус старої версії вимоги автоматично зміниться на `cancelled`.

source: Delete Requirement
uk: Видалення вимоги

source: To delete requirement from requirement group you can set status `cancelled` to this requirement.
uk: Щоби видалити вимогу з групи вимог, необхідно змінити статус вимоги на `cancelled`

source: Get Requirement
uk: Отримання інформації по вимогам

source: Eligible Evidence basic operation
uk: Базові операції над прийнятними доказами

source: Eligible Evidence model :ref:`schema<EligibleEvidence>`
uk: Схема даних :ref:`прийнятних доказів<EligibleEvidence>`

source: Create Eligible Evidence
uk: Створення прийнятного доказу

source: You can use POST method to add evidence for tenders in draft statuses.
uk: Щоби додати прийнятний доказ до тендеру у статусі чернетки, можна скористатись методом POST.

source: To add evidence(s) in non-draft status of tender you should use PUT method on Requirement level with extended eligibleEvidences array. New version or Requirement with status `active` and with extended eligibleEvidences array will be created.
uk: Щоби додати прийнятний доказ(и) до тендеру у статусі `active.enquiries` або `active.tendering`, необхідно використати метод PUT на рівні вимоги з вказанням розширеного списку eligibleEvidences. Нову версію вимоги зі статусом `active` та розширеним списком eligibleEvidences буде створено.

source: Update Eligible Evidence
uk: Оновлення інформації прияйнятного доказу

source: You can use PATCH method to update evidence for tenders in draft statuses.
uk: Щоби оновити прийнятний доказ до тендеру у статусі чернетки, можна скористатись методом PATCH.

source: To update evidence(s) in non-draft status of tender you should use PUT method on Requirement level with updated evidence(s) in eligibleEvidences array. New version or Requirement with status `active` and with changed eligibleEvidences array will be created.
uk: Щоби оновити прийнятний доказ(и) до тендеру у статусі `active.enquiries` або `active.tendering`, необхідно використати метод PUT на рівні вимоги з вказанням змінених вимог у списку eligibleEvidences. Нову версію вимоги зі статусом `active` та оновленими вимогами у списком eligibleEvidences буде створено.

source: Delete Eligible Evidence
uk: Видалення прийнятного доказу

source: You can use DELETE method to delete evidence for tenders in draft statuses.
uk: Ви можете використати DELETE метод щоб видалити вимогу до тендера у статусі чернетки.

source: For tenders in non-draft statuses evidence(s) can be deleted from Requirement only by using PUT method on Requirement level. Use eligibleEvidences array without some evidence(s) to delete them from Requirement. To delete all evidences from Requirement use empty array for eligibleEvidences field.
uk: Щоби видалити вимоги до тендеру у статусі `active.enquiries` або `active.tendering` необхідно використати метод PUT на рівні вимоги. Використовуйте список eligibleEvidences без деяких доказів щоби видалити їх з вимоги. Щоб видалити всі прийнятні докази з вимоги використовуйте пустий список для поля eligibleEvidences.

source: For tenders in draft statuses there is possibility to create, update and delete eligibleEvidences, make PATCH request to requirement and send new list of `eligibleEvidences`:
uk: Для тендерів у статусі чернетки існує інша можливість для створення, оновлення та видалення доказів через PATCH запит на вимогу де потрібно передати новий списко `eligibleEvidences`:

source: Retrieve Eligible Evidence
uk: Отримання інформації по прийнятних доказах

source: Exclusion criteria
uk: Виключні критерії

source: Exclusion criteria available and required for the following procedures: aboveThresholdUA, aboveThresholdEU, competitiveDialogueUA, competitiveDialogueEU, competitiveDialogueUA.stage2, competitiveDialogueEU.stage2, esco, closeFrameworkAgreementUA
uk: Виключні критерії доступні та обов'язкові в наступних процедурах: aboveThresholdUA, aboveThresholdEU, competitiveDialogueUA, competitiveDialogueEU, competitiveDialogueUA.stage2, competitiveDialogueEU.stage2, esco, closeFrameworkAgreementUA

source: `Standard data, you could get here <https://github.com/ProzorroUKR/standards/blob/master/criteria/article_17.json>`__
uk: `Стандарт можна отримати тут <https://github.com/ProzorroUKR/standards/blob/master/criteria/article_17.json>`__

source: You can't update tender to status `active.tendering` without 9 EXCLUSION and 1 OTHER.BID.LANGUAGE criteria:
uk: Неможливо перевести тендер у статус `active.tendering` без 9-ти вийнятнхових та одного мовного критеріїв:

source: EXCLUSION criteria and all criteria objects are unchangeable:
uk: Вийняткові критерії та всі дочірні об'єкти є незміннми:

source: For tenders in draft statuses you can patch exclusion requirement, but you can send only `eligibleEvidences`
uk: Для тендерів в статусі чернетки вийняткові вимоги можливо редагувати, але тілки передаючи поле `eligibleEvidences`

source: For tenders in non-draft statuses you can PUT exclusion requirement, but you can change only `status` and `eligibleEvidences`
uk: Для статусів `active.enquiries` та `active.tendering` вийняткові вимоги можливо редагувати методом PUT, але змінювати можна лише поля `status` та `eligibleEvidences`

source: Language criterion creates as other and could be presented in bulk request with other criteria. Language should be specified in `title`
uk: Мовний критерій створюється так само як і інші та може бути включений до запиту на створення з іншими критеріями. Мова має бути вказана в `title`

source: But field `eligibleEvidences` is forbidden
uk: Але поле `eligibleEvidences` заборонено для цього критерію

source: `expectedValue` must be only true
uk: `expectedValue` може бути лише true

source: Bid guarantee criterion (available for tenders: `belowThreshold`, `aboveThresholdUA`, `aboveThresholdEU`, `esco`). If specified, should be also specified `guarantee` for tender if criterion `relatesTo` = `'tender'` or `guarantee` for lot if `relatesTo` = `'lot'`
uk: Гарантійне забезпечення пропозиції (доступно для процедур: `belowThreshold`, `aboveThresholdUA`, `aboveThresholdEU`, `esco`). Якщо вказан даний критерій, тоді обов'язково мають бути вказані `guarantee` на рівні тендера, якщо критерій стосується тендера або `guarantee` на рівні лоту до якого застосовано критерій

source: Contract guarantee criterion (available for tenders: `belowThreshold`, `aboveThresholdUA`, `aboveThresholdEU`, `esco`). For current criterion could be set only `source` = `'winner'`. `eligibleEvidences` could be added according to :ref:`bidding`
uk: Гаратнійне забезпечення виконання умов договору (доступно для процедур: `belowThreshold`, `aboveThresholdUA`, `aboveThresholdEU`, `esco`). Для даного критерія `source` може бути лише `winner`. Докази `eligibleEvidences` можуть бути додані згідно :ref:`bidding`

source: Exclusion criteria workflow
uk: Схема роботи вийняткових критеріїв
