Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/violation-reports/errors.po
Languages: uk

source: Violation Reports API Errors
uk: Помилки API звітів про порушення

source: DefendantStatement and Decision in `draft` status
uk: DefendantStatement і Decision у статусі `draft`

source: If a violation report is in `draft` status, it's is not public yet.
uk: Якщо звіт про порушення має статус `draft`, він ще не є публічним.

source: Posting a defendant statement should fail.
uk: Спроба опублікувати заяву відповідача має завершуватися помилкою.

source: Posting a defendant statement document should fail as well.
uk: Спроба додати документ заяви відповідача також має завершуватися помилкою.

source: Posting a decision should fail.
uk: Спроба опублікувати рішення має завершуватися помилкою.

source: Posting a decision document should also fail.
uk: Спроба додати документ рішення також має завершуватися помилкою.

source: Violation report in `draft` status
uk: Звіт про порушення у статусі `draft`

source: Patching violation report with extra fields should fail.
uk: Спроба змінити звіт про порушення, додаючи зайві поля, має завершуватися помилкою.

source: Patching violation report with no changes should succeed while dateModified should be the same.
uk: Зміна звіту про порушення без внесення змін має бути успішною, а значення dateModified має залишатися таким самим.
