Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/violation-reports/tutorial.po
Languages: uk

source: Violation Reports Tutorial
uk: Violation Reports (Звернення про порушення) Туторіал

source: Post a violation report
uk: Опублікувати звіт про порушення

source: You create it from a contract. All the documents are posted along with the data
uk: Ви створюєте звіт з договору. Документи можна публікувати разом з даними.

source: While in `draft` state, it can be changed
uk: У стані `draft` звіт можна змінити

source: You can delete a document
uk: Ви можете видалити документ

source: Then post a new one
uk: Можна опублікувати новий

source: Or you can update document version with PUT method
uk: Або ви можете оновити версію документа за допомогою методу PUT

source: Update document details can be changed using PATCH method
uk: Деталі документа оновлення можна змінити за допомогою методу PATCH

source: Before publishing, it's required to add a signature document
uk: Перед публікацією необхідно додати документ з підписом

source: Now you can publish your violation report by changing its status
uk: Тепер ви можете опублікувати свій звіт про порушення, змінивши його статус

source: See `defendantPeriod` that restrict the periods of the response can be posted. The decision can be posted once the period ends.
uk: Див. `defendantPeriod`, що обмежує періоди публікації відповіді. Рішення можна опублікувати після закінчення періоду.

source: Post the defendant statement
uk: Опублікувати заяву відповідача

source: Post a `draft` dependant statement
uk: Опублікувати `draft` заяви

source: While is not active, you can update it
uk: Поки неактивний, ви можете його оновити

source: And update the evidences
uk: І оновити докази

source: Change documents descriptions
uk: Змінити описи документів

source: Before publishing it's required to add a signature document
uk: Перед публікацією потрібно додати документ із підписом

source: Then publish the statement, so it appears in the feed
uk: Потім опублікуйте заяву, щоб вона з’явилася у стрічці змін

source: Post the decision
uk: Опублікуйте рішення

source: Create a `draft` decision
uk: Створіть рішення у статусі `draft`

source: It's required to add a signature document
uk: Потрібно додати документ із підписом

source: While in `draft`, you can change the decision
uk: Поки рішення у статусі `draft`, ви можете змінювати його

source: Before publishing, you need to update the signature
uk: Перед публікацією потрібно оновити підпис

source: Publish the decision
uk: Опублікуйте рішення

source: See the result violation report object
uk: Перегляньте об’єкт результату звіту про порушення

source: Field `status` of violation report depends on the decision status now.
uk: Поле `status` звіту про порушення тепер залежить від статусу рішення.

source: Feed violation report updates
uk: Оновлення звітів про порушення у стрічці змін

source: Violation reports appear in their feed when the get public changes.
uk: Звіти про порушення з’являються у своїй стрічці змін, коли отримують публічні зміни.

source: These are:
uk: Це такі:

source: violationReport is published
uk: violationReport опубліковано

source: defendantStatement is published
uk: defendantStatement опубліковано

source: decision is published
uk: decision опубліковано

source: Process objects in `data` and follow the `next_page`
uk: Обробляйте об’єкти в `data` та переходьте за `next_page`

source: Once `data` is empty make your script sleep for a while and check the same page later.
uk: Коли `data` буде порожнім, призупиніть виконання скрипта на деякий час і перевірте цю саму сторінку пізніше.
