Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/agreement.po
Languages: uk

source: Schema
uk: Схема

source: uid, required, auto-generated
uk: ID користувача, обов'язково, генерується автоматично

source: string, auto-generated, read-only
uk: рядок, генерується автоматично, лише для читання

source: string
uk: рядок

source: List of :ref:`ChangeTaxRate`, :ref:`ChangeItemPriceVariation`, :ref:`ChangePartyWithdrawal` or :ref:`ChangeThirdParty` objects.
uk: Список :ref:`ChangeTaxRate`, :ref:`ChangeItemPriceVariation`, :ref:`ChangePartyWithdrawal` або :ref:`ChangeThirdParty` об'єктів.

source: Only in `agreements` container.
uk: Тільки в контейнері `agreements`.

source: string, :ref:`date`, auto-generated, read-only
uk: рядок, :ref:`date`, генерується автоматично, лише для читання

source: The date of the agreement change.
uk: Дата зміни угоди

source: string, :ref:`date`
uk: рядок, :ref:`date`

source: The date of the agreement signed.
uk: Дата підписання угоди

source: string, multilingual
uk: рядок, багатомовний

source: Agreement description
uk: Опис договору

source: List of :ref:`Document` objects
uk: Список об'єктів :ref:`Document`

source: |ocdsDescription| All documents and attachments related to the agreement, including any notices.
uk: |ocdsDescription| Всі документи і додатки, що стосуються угоди, в тому числі будь-які сповіщення.

source: List of :ref:`Item` objects
uk: Список об'єктів :ref:`Item`

source: The timeframe when agreement is in force. Maximum 4 years.
uk: Період чинності угоди. Щонайбільше 4 роки.

source: Deadline for participants to submit price documents
uk: Крайній термін подання документів з цінами учасниками

source: The current status of agreement. Possible values are:
uk: Актуальний статус угоди. Можливі значення:

source: `pending` - the agreement is under signing between procuring entity and :ref:`Contract`
uk: `pending` - угода в процесі підписання між замовником та :ref:`Contract`

source: `unsuccessful` - the agreement has not been signed between procuring entity and :ref:`Contract`
uk: `unsuccessful` - угода між замовником та :ref:`Contract` не було підписано

source: `active` - the agreement is signed between procuring entity and :ref:`Contract`
uk: active` - угода між замовником та :ref:`Contract` підписана

source: `cancelled` - the agreement has been cancelled within cancellation of tender/lot.
uk: `cancelled` - підписання угоди скасовано через відміну закупівлі/лоту.

source: Different in `agreement` container:
uk: Відмінності в контейнері `agreement`:

source: `active` - the agreement is active and can be used for creating `selection` procedure
uk: `active` - угода є активною і може бути використана для створення `selection` процедури

source: `terminated` - the agreement is cannot be used, for creating `selection` procedure
uk: `terminated` - угода не може бути використана для створення `selection` процедури

source: List of :ref:`Contract` objects
uk: Список об'єктів :ref:`Contract`

source: string, required
uk: рядок, обов'язково

source: Agreement title
uk: Назва угоди

source: Workflow
uk: Послідовність дій

source: Workflow in :ref:`agreementcfaua`
uk: Робочий процес у :ref:`agreementcfaua`

source: \* marks initial state
uk: \* позначає початковий статус
