Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/award.po
Languages: uk

source: Schema
uk: Схема

source: string, auto-generated, read-only
uk: рядок, генерується автоматично, лише для читання

source: |ocdsDescription| The identifier for this award.
uk: |ocdsDescription| Ідентифікатор цього рішення.

source: The Id of a bid that the award relates to.
uk: ID пропозиції, що виграла закупівлю.

source: absent in :ref:`limited`:
uk: відсутній у :ref:`limited`:

source: string, multilingual
uk: рядок, багатомовний

source: |ocdsDescription| Award title.
uk: |ocdsDescription| Назва рішення.

source: |ocdsDescription| Award description.
uk: |ocdsDescription| Опис рішення.

source: string
uk: рядок

source: |ocdsDescription| The current status of the award drawn from the `awardStatus` codelist.
uk: |ocdsDescription| Поточний статус рішення, взятий зі списку кодів `awardStatus`.

source: Possible values are:
uk: Можливі значення:

source: `pending` - the award is under review of qualification committee
uk: `pending` - переможець розглядається кваліфікаційною комісією

source: `unsuccessful` - the award has been rejected by qualification committee
uk: `unsuccessful` - кваліфікаційна комісія відмовила переможцю

source: `active` - the tender is awarded to the bidder from the `bid_id`
uk: `active` - закупівлю виграв учасник з пропозицією `bid_id`

source: `cancelled` - the award has been cancelled by complaint review body
uk: `cancelled` - орган, що розглядає скарги, відмінив результати закупівлі

source: string, :ref:`Date`, auto-generated, read-only
uk: рядок, :ref:`Date`, генерується автоматично, лише для читання

source: |ocdsDescription| The date of the contract award.
uk: |ocdsDescription| Дата рішення про підписання договору.

source: :ref:`Value` object, auto-generated, read-only
uk: Об’єкт :ref:`Value`, генерується автоматично, лише для читання

source: |ocdsDescription| The total value of this award.
uk: |ocdsDescription| Загальна вартість згідно цього рішення.

source: Differences in :ref:`defense`, :ref:`esco`, :ref:`openua` and :ref:`openeu`:
uk: Відмінності :ref:`defense`, :ref:`esco`, :ref:`openua` та :ref:`openeu`:

source: List of :ref:`Value` objects, auto-generated, read-only
uk: Список :ref:`Value` об’єктів, генерується автоматично, лише для читання

source: Differences in :ref:`limited`:
uk: Відмінності у :ref:`limited`:

source: `Value` object
uk: Об'єкт `Value`

source: List of :ref:`BusinessOrganization` objects, auto-generated, read-only
uk: Список об’єктів :ref:`BusinessOrganization`, генерується автоматично, лише для читання

source: |ocdsDescription| The suppliers awarded with this award.
uk: |ocdsDescription| Постачальники, що були визнані переможцями згідно цього рішення.

source: List of :ref:`Item` objects, auto-generated, read-only
uk: Список об’єктів :ref:`Item`, генерується автоматично, лише для читання

source: |ocdsDescription| The goods and services awarded in this award, broken into line items wherever possible. Items should not be duplicated, but the quantity specified instead.
uk: |ocdsDescription| Товари та послуги, що розглядались цим рішенням, поділені на окремі рядки, де це можливо. Елементи не повинні бути продубльовані, а повинні мати вказану кількість.

source: List of :ref:`Document` objects
uk: Список об’єктів :ref:`Document`

source: |ocdsDescription| All documents and attachments related to the award, including any notices.
uk: |ocdsDescription| Усі документи та додатки пов’язані з рішенням, включно з будь-якими повідомленнями.

source: List of :ref:`Complaint` objects
uk: Список об’єктів :ref:`Complaint`

source: The timeframe when complaints can be submitted.
uk: Період, під час якого можна подавати скарги.

source: Id of related :ref:`lot`.
uk: ID пов’язаного :ref:`lot`.

source: Additionally in :ref:`defense`, :ref:`esco`, :ref:`openua` and :ref:`openeu`:
uk: Додатково у :ref:`defense`, :ref:`esco`, :ref:`openua` та :ref:`openeu`:

source: Confirms compliance of eligibility criteria set by the procuring entity in the tendering documents.
uk: Підтверджує відповідність критеріям прийнятності, встановлених замовником в тендерній документації.

source: Confirms the absence of grounds for refusal to participate in accordance with Article 17 of the Law of Ukraine "On Public Procurement".
uk: Підтверджує відсутність підстав для відмови від участі відповідно до статті 17 Закону України ”Про державні закупівлі”.

source: Additionally in :ref:`limited`:
uk: Додатково :ref:`limited`:

source: The text field of any length that contains information about subcontractor.
uk: Текстове поле будь-якої довжини, що містить інформацію про субпідрядника.

source: Confirms that Procuring entity has no grounds to reject a participant in accordance with Article 17 of the Law of Ukraine "On Public Procurement".
uk: Підтверджує відсутність підстав для відмови від участі відповідно до статті 17 Закону України ”Про державні закупівлі”.

source: Award workflow in :ref:`limited`:
uk: Робочий процес нагороди в :ref:`limited`:

source: Workflow in :ref:`openeu` and :ref:`esco`:
uk: Робочий процес у :ref:`openeu` та :ref:`esco`:
