Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/bid.po
Languages: uk

source: Schema
uk: Схема

source: List of :ref:`Organization` objects
uk: Список об’єктів :ref:`Organization`

source: string, :ref:`date`, autogenerated
uk: рядок, Date, генерується автоматично

source: uid, autogenerated
uk: uid, генерується автоматично

source: string
uk: рядок

source: Possible values are:
uk: Можливі значення:

source: :ref:`Value`, required
uk: :ref:`Value`, обов’язково

source: Validation rules:
uk: Правила валідації:

source: `amount` should be less than `Tender.value.amout`
uk: Значення `amount` повинно бути меншим за `Tender.value.amout`

source: `currency` should either be absent or match `Tender.value.currency`
uk: Значення `currency` повинно бути або відсутнім, або співпадати з `Tender.value.currency`

source: `valueAddedTaxIncluded` should either be absent or match `Tender.value.valueAddedTaxIncluded`
uk: Значення `valueAddedTaxIncluded` повинно бути або відсутнім, або співпадати з `Tender.value.valueAddedTaxIncluded`

source: List of :ref:`Parameter` objects
uk: Список об’єктів :ref:`Parameter`

source: List of :ref:`LotValue` objects
uk: Список об’єктів :ref:`LotValue`

source: url
uk: URL-адреса

source: A web address for participation in auction.
uk: Веб-адреса для участі в аукціоні.

source: string, required
uk: рядок, обов’язковий

source: Code of the feature.
uk: Код критерію.

source: float, required
uk: float, обов’язково

source: Value of the feature.
uk: Значення критерію.

source: `amount` should be less than `Lot.value.amout`
uk: Значення `amount` повинно бути меншим, ніж `Lot.value.amount`

source: `currency` should either be absent or match `Lot.value.currency`
uk: Значення `currency` повинно бути або відсутнім, або співпадати з `Tender.value.currency`

source: `valueAddedTaxIncluded` should either be absent or match `Lot.value.valueAddedTaxIncluded`
uk: Значення `valueAddedTaxIncluded` повинно бути або відсутнім, або співпадати з `Tender.value.valueAddedTaxIncluded`

source: Id of related :ref:`lot`.
uk: ID пов’язаного :ref:`lot`.

source: Workflow
uk: Схема роботи

source: \* marks initial state
uk: \* позначає початковий стан

source: True, required
uk: True, обов’язково

source: Confirms compliance of eligibility criteria set by the customer in the tendering documents
uk: Підтверджує відповідність критеріям прийнятності, встановлених замовником в тендерній документації.

source: Confirms the absence of grounds for refusal to participate in accordance with Article 17 of the Law of Ukraine "On public procurement"
uk: Підтверджує відсутність підстав для відмови від участі відповідно до статті 17 Закону України "Про державні закупівлі".

source: While submitting bid proposal, participant can fill in the text field of any length about subcontractor.
uk: При поданні пропозиції учасник може додати інформацію про субпідрядника, заповнивши текстове поле довільної довжини.

source: There are several `envelopes` - document containers that manage time when their information will be revealed:
uk: Є декілька `конвертів`- контейнерів з документами, що регулюють час відкриття даних:

source: List of :ref:`ConfidentialDocument` objects. This envelope has to contain only technical part of proposal (`technicalSpecifications` and `qualificationDocuments`). It is revealed at pre-qualification.
uk: Список об’єктів :ref:`ConfidentialDocument`. Цей конверт повинен містити тільки технічну частину пропозиції (`technicalSpecifications` та `qualificationDocuments`). Розкривається на прекваліфікації.

source: List of :ref:`ConfidentialDocument` objects. This envelope can contain financial part of proposal (`commercialProposal` and `billOfQuantity`). It is revealed at post-qualification.
uk: Список об’єктів :ref:`ConfidentialDocument`. Цей конверт може містити фінансову частину пропозиції (`commercialProposal` та `billOfQuantity`). Розкривається на посткваліфікації.

source: List of :ref:`ConfidentialDocument` objects. This envelope can contain `eligibilityDocuments` document type. It is revealed at post-qualification.
uk: Список об’єктів :ref:`ConfidentialDocument`. Цей конверт може містити тип документів `eligibilityDocuments`. Розкривається на посткваліфікації.

source: List of :ref:`ConfidentialDocument` objects. This envelope is revealed at post-qualification.
uk: Список об’єктів :ref:`ConfidentialDocument`. Цей конверт розкривається на посткваліфікації.
