Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/complaint.po
Languages: uk

source: Schema
uk: Схема

source: :ref:`Organization`, required
uk: :ref:`Organization`, обов’язково

source: Organization filing a complaint (contactPoint - person, identification - organization that person represents).
uk: Організація, яка подає скаргу (contactPoint - людина, identification - організація, яку ця людина представляє).

source: string, required
uk: рядок, обов’язковий

source: Title of the complaint.
uk: Заголовок скарги.

source: Description of the issue.
uk: Опис запитання.

source: Date of posting.
uk: Дата подання.

source: Date when claim was submitted.
uk: Дата, коли вимога була подана.

source: Date when Procuring entity answered the claim.
uk: Дата, коли замовник відповів на вимогу.

source: Date of claim to complaint escalation.
uk: Дата ескалації (перетворення вимоги на скаргу).

source: Date of complaint decision.
uk: День прийняття рішення по вимозі.

source: Date of cancelling.
uk: Дата відхилення.

source: string
uk: рядок

source: Possible values are:
uk: Можливі значення:

source: `claim`
uk: `claim` - вимога

source: Possible values of type are:
uk: Можливі значення типу:

source: `complaint`
uk: `complaint` - скарга

source: Resolution of Procuring entity.
uk: Рішення замовника.

source: Possible values of resolution type are:
uk: Можливі значення типу вирішення:

source: bool
uk: булеве значення

source: Claim is satisfied?
uk: Вимога задовільнена?

source: Reviewer decision.
uk: Рішення органу оскарження.

source: Cancellation reason.
uk: Причини відхилення.

source: List of :ref:`Document` objects
uk: Список об’єктів :ref:`Document`

source: Id of related :ref:`lot`.
uk: Ідентифікатор пов’язаного :ref:`lot`-а.

source: Tenderer action.
uk: Дія учасника.

source: Date of tenderer action.
uk: Дата дії учасника.

source: Possible values of reject reason are:
uk: Можливі значення причини відхилення:

source: Reject reason description.
uk: Опис причин відхилення.

source: Date of review.
uk: Дата розгляду.

source: Place of review.
uk: Місце розгляду.

source: uid, auto-generated
uk: uid, генерується автоматично

source: string, :ref:`date`, auto-generated
uk: рядок, :ref:`date`, генерується автоматично
