Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/confidentialdocument.po
Languages: uk

source: Schema
uk: Схема

source: string
uk: рядок

source: Possible values for :ref:`tender`
uk: Можливі значення для :ref:`tender`

source: `notice` - **Tender notice**
uk: `notice` - **Повідомлення про закупівлю**

source: The formal notice that gives details of a tender. This may be a link to a downloadable document, to a web page, or to an official gazette in which the notice is contained.
uk: Офіційне повідомлення, що містить деталі закупівлі. Це може бути посилання на документ, веб-сторінку, чи на офіційний бюлетень, де розміщено повідомлення.

source: `biddingDocuments` - **Bidding Documents**
uk: `biddingDocuments` - **Документи закупівлі**

source: Information for potential suppliers, describing the goals of the contract (e.g. goods and services to be procured), and the bidding process.
uk: Інформація для потенційних постачальників, що описує цілі договору (наприклад, товари та послуги, які будуть закуплені) і процес торгів.

source: `technicalSpecifications` - **Technical Specifications**
uk: `technicalSpecifications` - **Технічні специфікації**

source: Detailed technical information about goods or services to be provided.
uk: Детальна технічна інформація про товари або послуги, що повинні бути надані.

source: `evaluationCriteria` - **Evaluation Criteria**
uk: `evaluationCriteria` - **Критерії оцінки**

source: Information about how bids will be evaluated.
uk: Інформація про те, як будуть оцінюватись пропозиції.

source: `clarifications` - **Clarifications to bidders questions**
uk: `clarifications` - **Пояснення до питань заданих учасниками**

source: Including replies to issues raised in pre-bid conferences.
uk: Включає відповіді на питання, підняті на передтендерних конференціях.

source: `eligibilityCriteria` - **Eligibility Criteria**
uk: `eligibilityCriteria` - **Критерії прийнятності**

source: Detailed documents about the eligibility of bidders.
uk: Докладні документи про критерії відбору.

source: `shortlistedFirms` - **Shortlisted Firms**
uk: `shortlistedFirms` - **Фірми у короткому списку**

source: `riskProvisions` - **Provisions for management of risks and liabilities**
uk: `riskProvisions` - **Положення для управління ризиками та зобов'язаннями**

source: `billOfQuantity` - **Bill Of Quantity**
uk: `billOfQuantity` - **Кошторис**

source: `bidders` - **Information on bidders**
uk: `bidders` - **Інформація про учасників**

source: Information on bidders or participants, their validation documents and any procedural exemptions for which they qualify.
uk: Інформація про учасників, їхні документи для перевірки та будь-які процесуальні пільги, на які вони можуть претендувати.

source: `conflictOfInterest` - **Conflicts of interest uncovered**
uk: `conflictOfInterest` - **Виявлені конфлікти інтересів**

source: `debarments` - **Debarments issued**
uk: `debarments` - **Відмова у допуску до закупівлі**

source: Possible values for :ref:`award`
uk: Можливі значення для :ref:`award`

source: `notice` - **Award Notice**
uk: `notice` - **Повідомлення про рішення**

source: The formal notice that gives details of the contract award. This may be a link to a downloadable document, to a web page, or to an official gazette in which the notice is contained.
uk: Офіційне повідомлення, що містить деталі рішення про визначення переможця. Це може бути посилання на документ, веб-сторінку, чи на офіційний бюлетень, де розміщено повідомлення.

source: `evaluationReports` - **Evaluation report**
uk: `evaluationReports` - **Звіт про оцінку**

source: Report on the evaluation of the bids and the application of the evaluation criteria, including the justification fo the award.
uk: Звіт про оцінку пропозицій і застосування критеріїв оцінки, у тому числі, обґрунтування рішення про визначення переможця.

source: `winningBid` - **Winning Bid**
uk: `winningBid` - **Пропозиція, що перемогла**

source: `complaints` - **Complaints and decisions**
uk: `complaints` - **Скарги та рішення**

source: Possible values for :ref:`contract`
uk: Можливі значення для :ref:`contract`

source: `notice` - **Contract notice**
uk: `notice` - **Повідомлення про договір**

source: The formal notice that gives details of a contract being signed and valid to start implementation. This may be a link to a downloadable document, to a web page, or to an official gazette in which the notice is contained.
uk: Офіційне повідомлення, що містить деталі підписання договору та початку його реалізації. Це може бути посилання на документ, веб-сторінку, чи на офіційний бюлетень, де розміщено повідомлення.

source: `contractSigned` - **Signed Contract**
uk: `contractSigned` - **Підписаний договір**

source: `contractArrangements` - **Arrangements for ending contract**
uk: `contractArrangements` - **Заходи для припинення договору**

source: `contractSchedule` - **Schedules and milestones**
uk: `contractSchedule` - **Розклад та етапи**

source: `contractAnnexe` - **Annexes to the Contract**
uk: `contractAnnexe` - **Додатки до договору**

source: `contractGuarantees` - **Guarantees**
uk: `contractGuarantees` - **Гарантії**

source: `subContract` - **Subcontracts**
uk: `subContract` - **Субпідряд**

source: string, multilingual
uk: рядок, багатомовний

source: |ocdsDescription| The document title.
uk: |ocdsDescription| Назва документа.

source: |ocdsDescription| A short description of the document. In the event the document is not accessible online, the description field can be used to describe arrangements for obtaining a copy of the document.
uk: |ocdsDescription| Короткий опис документа. Якщо документ не буде доступний онлайн, то поле опису можна використати для вказання способу отримання копії документа.

source: |ocdsDescription| The format of the document taken from the `IANA Media Types code list <http://www.iana.org/assignments/media-types/>`_, with the addition of one extra value for 'offline/print', used when this document entry is being used to describe the offline publication of a document.
uk: |ocdsDescription| Формат документа зі `списку кодів IANA Media Types <http://www.iana.org/assignments/media-types/>`_, з одним додатковим значенням 'offline/print', що буде використовуватись, коли запис цього документа використовується для опису офлайнової публікації документа.

source: |ocdsDescription| Direct link to the document or attachment.
uk: |ocdsDescription| Пряме посилання на документ або додаток.

source: Possible values are:
uk: Можливі значення:

source: `public`
uk: `public` - публічний документ

source: `buyerOnly`
uk: `buyerOnly` - приватний документ

source: Reasons for confidentiality of documents.
uk: Причина для конфіденційності документів.

source: string, :ref:`date`
uk: рядок, :ref:`date`

source: |ocdsDescription| The date on which the document was first published.
uk: |ocdsDescription| Дата, коли документ був опублікований вперше.

source: |ocdsDescription| Date that the document was last modified
uk: |ocdsDescription| Дата, коли документ був змінений востаннє.

source: |ocdsDescription| Specifies the language of the linked document using either two-digit `ISO 639-1 <https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes>`_, or extended `BCP47 language tags <http://www.w3.org/International/articles/language-tags/>`_.
uk: |ocdsDescription| Вказує мову документа, використовуючи або двоцифровий код `ISO 639-1 <https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes>`_, або розширений `BCP47 language tags <http://www.w3.org/International/articles/language-tags/>`_.

source: string, default = `uk`
uk: рядок, значення за замовчуванням - `uk`

source: string, auto-generated
uk: рядок, генерується автоматично

source: Possible values for :ref:`bid`
uk: Можливі значення :ref:`bid`:

source: For Open EU procedure `eligibilityDocuments` should be contained in `eligibilityDocuments` envelope. See :ref:`bid`.
uk: Для процедури відкритих торгів з публікацією англ. мовою документи типу `eligibilityDocuments` повинні міститись у конверті `eligibilityDocuments`. Див. :ref:`bid`.

source: ID of related :ref:`lot` or :ref:`item`.
uk: Ідентифікатор пов'язаних об'єктів :ref:`lot` або :ref:`item`.

source: For Open EU procedure `commercialProposal` should be contained in `financialDocuments` envelope. See :ref:`bid`.
uk: Для процедури відкритих торгів з публікацією англ. мовою документи типу `commercialProposal` повинні міститись у конверті `financialDocuments`. Див. :ref:`bid`.

source: For Open EU procedure `qualificationDocuments` should be contained in `documents` envelope. See :ref:`bid`.
uk: Кваліфікаційні документи. Для процедури відкритих торгів з публікацією англ. мовою документ типу `qualificationDocuments` повинен міститись у конверті `documents`. Див. :ref:`bid`.

source: `qualificationDocuments` - **Qualification documents**
uk: `qualificationDocuments` - **Документи, що підтверджують кваліфікацію**

source: `eligibilityDocuments` - **Eligibility documents**
uk: `eligibilityDocuments` - **Документи, що підтверджують відповідність**

source: `commercialProposal` - **Сommercial proposal**
uk: `commercialProposal` - **Цінова пропозиція**
