Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/framework.po
Languages: uk

source: Schema
uk: Схема

source: string, multilingual
uk: рядок, багатомовний

source: The name of the framework, displayed in listings.
uk: Назва кваліфікації, яка відображається у списках.

source: Detailed description of framework.
uk: Детальний опис кваліфікації.

source: string, auto-generated, read-only
uk: рядок, генерується автоматично, лише для читання

source: The framework identifier.
uk: Ідентифікатор кваліфікації.

source: :ref:`ProcuringEntity`, required
uk: :ref:`ProcuringEntity`, обов’язково

source: Organization conducting the framework.
uk: Замовник (організація, що створює кваліфікацію).

source: If :code:`frameworkType` is :code:`electronicCatalogue`, then possible values of :code:`ProcuringEntity.kind` are limited to :code:`['central']`.
uk: Якщо :code:`frameworkType` має значення :code:`electronicCatalogue`, тоді можливі значення :code:`ProcuringEntity.kind` обмежені :code:`[‘central’]`.

source: string
uk: рядок

source: Framework for electronic catalog process
uk: Кваліфікація для процесу відбору до електронного каталогу

source: string, :ref:`date`, auto-generated
uk: рядок, :ref:`date`, генерується автоматично

source: List of :ref:`document` objects
uk: Список об’єктів :ref:`document`

source: |ocdsDescription| All documents and attachments related to the framework.
uk: |ocdsDescription| Всі документи та додатки пов’язані з кваліфікацією.

source: :ref:`period`, read-only, auto-generated
uk: :ref:`period`, лише для читання, генерується автоматично

source: Period when questions are allowed.
uk: Період, коли дозволено задавати питання.

source: |ocdsDescription| The period during which enquiries may be made and will be answered.
uk: |ocdsDescription| Період, коли можна зробити уточнення та отримати відповіді на них.

source: If :code:`frameworkType` is :code:`electronicCatalogue`, then suppliers cannot add submissions in this period.
uk: Якщо :code:`frameworkType` має значення :code:`electronicCatalogue`, тоді постачальник не може подавати заявки в цей період.

source: Period when submissions can be submitted.
uk: Період, в який постачальники можуть додавати заявки до кваліфікації.

source: |ocdsDescription| The period when the framework is open for submissions.
uk: |ocdsDescription| Період, коли кваліфікація відкрита для подачі заявки.

source: :ref:`period`, required
uk: :ref:`period`, обов’язково

source: Period when submissions can be qualified. At least `endDate` has to be provided.
uk: Період, коли приймаються рішення щодо заявок постачальників. Повинна бути вказана хоча б `endDate` дата.

source: If :code:`frameworkType` is :code:`electronicCatalogue`, then :code:`qualificationPeriod` can be from 30 to 1095 days long.
uk: Якщо :code:`frameworkType` має значення :code:`electronicCatalogue`, тоді :code:`qualificationPeriod` має бути від 30 до 1095 днів

source: If :code:`frameworkType` is :code:`electronicCatalogue`, then in this status any fields of framework can be changed.
uk: Якщо :code:`frameworkType` має значення :code:`electronicCatalogue`, тоді в цьому статусі можна змінювати будь-які поля кваліфікації.

source: If :code:`frameworkType` is :code:`electronicCatalogue`, then in this status only :code:`contactPoint`, :code:`qualificationPeriod.endDate`, :code:`description` and :code:`documents` fields of framework can be changed.
uk: Якщо :code:`frameworkType` має значення :code:`electronicCatalogue`, тоді в цьому статусі можна змінювати лише поля :code:`contactPoint`, :code:`qualificationPeriod.endDate`, :code:`description` та :code:`documents`

source: Terminal status. Framework can become `unsuccessful` if there was no submissions in first 20 full working days from framework activation.
uk: Завершальний статус. Кваліфікація може перейти в статус `unsuccessful` якщо за перші 20 повних робочих днів до неї не було створенно жодної заявки.

source: Complete framework.
uk: Завершена кваліфікація.

source: Status of the Framework.
uk: Статус кваліфікації.

source: :ref:`Classification`, required
uk: :ref:`Classification`, обов'язково

source: |ocdsDescription| The primary classification for the framework.
uk: |ocdsDescription| Початкова класифікація кваліфікації.

source: If :code:`frameworkType` is :code:`electronicCatalogue`, then it is mandatory for `classification.scheme` to be `ДК021`. The `classification.id` should be valid ДК021 code.
uk: Якщо :code:`frameworkType` має значення :code:`electronicCatalogue`, тоді `classification.scheme` має бути `ДК021`. `classification.id` повинно бути дійсним ДК021 кодом.

source: List of :ref:`Classification` objects
uk: Список об'єктів :ref:`Classification`.

source: |ocdsDescription| An array of additional classifications for the framework.
uk: |ocdsDescription| Массив додаткових класифікацій кваліфікації.

source: List of :ref:`revision` objects, auto-generated
uk: Список об’єктів :ref:`revision`, генерується автоматично, лише для читання

source: Historical changes to Framework object properties.
uk: Зміни властивостей об’єктів кваліфікації.
