Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/qualification.po
Languages: uk

source: Schema
uk: Схема

source: string, auto-generated
uk: рядок, генерується автоматично

source: string, multilingual
uk: рядок, багатомовний

source: |ocdsDescription| Qualification title.
uk: |ocdsDescription| Назва кваліфікації.

source: |ocdsDescription| Qualification description.
uk: |ocdsDescription| Опис кваліфікації.

source: Confirms compliance of eligibility criteria set by the procuring entity in the tendering documents.
uk: Підтверджує відповідність критеріям прийнятності, встановлених замовником в тендерній документації.

source: Confirms the absence of grounds for refusal to participate in accordance with Article 17 of the Law of Ukraine "On Public Procurement".
uk: Підтверджує відсутність підстав для відмови від участі відповідно до статті 17 Закону України "Про державні закупівлі".

source: Bid that this Qualification protocol relates to.
uk: Пропозиція, з якою пов’язаний протокол кваліфікації.

source: In Multilot tenders, lot that this Qualification protocol relates to.
uk: В багатолотових закупівлях це лот, з яким пов’язаний протокол кваліфікації.

source: string, :ref:`Date`, auto-generated, read-only
uk: рядок, :ref:`Date`, генерується автоматично

source: The date of the qualification.
uk: Дата кваліфікації.

source: List of :ref:`Document` objects
uk: Список об’єктів :ref:`Document`

source: Container for Qualification documentation, protocols, reasons for qualification or disqualification. Uploaded by tender committee.
uk: Контейнер для кваліфікаційних документів, протоколів, причин для кваліфікації чи дискваліфікації. Завантажується закупівельним комітетом.

source: string
uk: рядок

source: Possible values are:
uk: Можливі значення:

source: `pending` - waiting for qualification
uk: `pending` - очікує на кваліфікацію

source: `active` - qualification has been confirmed
uk: `active` - кваліфікацію підтверджено

source: `unsuccessful` - participant didn't pass qualification
uk: `unsuccessful` - учасник не пройшов кваліфікації

source: `cancelled`- qualification decision has been cancelled
uk: `cancelled`- відміна рішення по кваліфікації

source: Workflow
uk: Схема роботи

source: \* marks initial state
uk: \* позначає початковий стан
