Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/tender.po
Languages: uk

source: Schema
uk: Схема

source: string, multilingual, uk (title) and en (title_en) translations are required
uk: рядок, багатомовний, обов’язковий переклад назв українською та англійською: uk (title) та en (title_en)

source: The name of the tender, displayed in listings. You can include the following items:
uk: Назва тендера, яка відображається у списках. Можна включити такі елементи:

source: tender code (in procuring organization management system)
uk: код закупівлі (у системі управління організації-замовника)

source: periodicity of the tender (annual, quarterly, etc.)
uk: періодичність закупівлі (щороку, щокварталу, і т.д.)

source: item being procured
uk: товар, що закуповується

source: some other info
uk: інша інформація

source: string, multilingual
uk: рядок, багатомовний

source: Detailed description of tender.
uk: Детальний опис закупівлі

source: The tender identifier to refer tender to in "paper" documentation.
uk: Ідентифікатор закупівлі, щоб знайти закупівлю у "паперовій" документації

source: |ocdsDescription| TenderID should always be the same as the OCID. It is included to make the flattened data structure more convenient.
uk: |ocdsDescription| Ідентифікатор тендера TenderID повинен завжди співпадати з OCID. Його включають, щоб зробити структуру даних більш зручною.

source: string
uk: рядок

source: value: ``aboveThresholdEU``
uk: значення: ``aboveThresholdEU``

source: :ref:`organization`, required
uk: :ref:`organization`, обов’язково

source: Organization conducting the tender.
uk: Організація, що проводить закупівлю.

source: |ocdsDescription| The entity managing the procurement, which may be different from the buyer who is paying / using the items being procured.
uk: |ocdsDescription| Об’єкт, що управляє закупівлею. Він не обов’язково є покупцем, який платить / використовує закуплені елементи.

source: :ref:`value`, required
uk: :ref:`value`, обов’язково

source: Total available tender budget. Bids greater then ``value`` will be rejected.
uk: Повний доступний бюджет закупівлі. Пропозиції, що більші за ``value`` будуть відхилені.

source: |ocdsDescription| The total estimated value of the procurement.
uk: |ocdsDescription| Загальна кошторисна вартість закупівлі.

source: list of :ref:`item` objects, required
uk: список об’єктів :ref:`item`, обов’язково

source: List that contains single item being procured.
uk: Список, який містить елемент, що закуповується.

source: |ocdsDescription| The goods and services to be purchased, broken into line items wherever possible. Items should not be duplicated, but a quantity of 2 specified instead.
uk: |ocdsDescription| Товари та послуги, що будуть закуплені, поділені на спискові елементи, де це можливо. Елементи не повинні дублюватись, замість цього вкажіть кількість 2.

source: list of :ref:`Feature` objects
uk: список об’єктів :ref:`Feature`

source: Features of tender.
uk: Властивості закупівлі.

source: List of :ref:`document` objects
uk: Список об’єктів :ref:`document`

source: |ocdsDescription| All documents and attachments related to the tender.
uk: |ocdsDescription| Всі документи та додатки пов’язані із закупівлею.

source: List of :ref:`question` objects
uk: Список об’єктів :ref:`question`

source: Questions to ``procuringEntity`` and answers to them.
uk: Питання до замовника ``procuringEntity`` і відповіді на них.

source: List of :ref:`complaint` objects
uk: Список об’єктів :ref:`complaint`

source: Complaints to tender conditions and their resolutions.
uk: Скарги на умови закупівлі та їх вирішення.

source: List of :ref:`bid` objects
uk: Список об’єктів :ref:`bid`

source: A list of all bids placed in the tender with information about tenderers, their proposal and other qualification documentation.
uk: Список усіх пропозицій зроблених під час закупівлі разом із інформацією про учасників закупівлі, їхні пропозиції та інша кваліфікаційна документація.

source: |ocdsDescription| A list of all the companies who entered submissions for the tender.
uk: |ocdsDescription| Список усіх компаній, які подали заявки для участі у закупівлі.

source: The minimal step of auction (reduction). Validation rules:
uk: Мінімальний крок аукціону (редукціону). Правила валідації:

source: `amount` should be less then `Tender.value.amount`
uk: Значення `amount` повинно бути меншим за `Tender.value.amount`

source: `currency` should either be absent or match `Tender.value.currency`
uk: Значення `currency` повинно бути або відсутнім, або співпадати з `Tender.value.currency`

source: `valueAddedTaxIncluded` should either be absent or match `Tender.value.valueAddedTaxIncluded`
uk: Значення `valueAddedTaxIncluded` повинно бути або відсутнім, або співпадати з `Tender.value.valueAddedTaxIncluded`

source: List of :ref:`award` objects
uk: Список об’єктів :ref:`award`

source: All qualifications (disqualifications and awards).
uk: Усі кваліфікації (дискваліфікації та переможці).

source: List of :ref:`Contract` objects
uk: Список об’єктів :ref:`Contract`

source: :ref:`period`, required
uk: :ref:`period`, обов’язково

source: Period when questions are allowed.
uk: Період, коли дозволені питання.

source: |ocdsDescription| The period during which enquiries may be made.
uk: |ocdsDescription| Період, протягом якого можна задавати питання про умови закупівлі.

source: Period when bids can be submitted. At least `endDate` has to be provided.
uk: Період, коли подаються пропозиції. Повинна бути вказана хоча б кінцева дата `endDate`.

source: |ocdsDescription| The period when the tender is open for submissions. The end date is the closing date for tender submissions.
uk: |ocdsDescription| Період, коли закупівля відкрита для подачі пропозицій. Кінцева дата - це дата, коли перестають прийматись пропозиції.

source: :ref:`period`, read-only
uk: :ref:`period`, лише для читання

source: |ocdsDescription| Period when qualification can be submitted with stand still period.
uk: |ocdsDescription| Період, коли кваліфікацію можна подати з періодом блокування.

source: Period when Auction is conducted.
uk: Період, коли проводиться аукціон.

source: url
uk: URL-адреса

source: A web address for view auction.
uk: Веб-адреса для перегляду аукціону.

source: Awarding process period.
uk: Період, коли відбувається визначення переможця.

source: |ocdsDescription| The date or period on which an award is anticipated to be made.
uk: |ocdsDescription| Дата або період, коли очікується визначення переможця.

source: Enquiries and tendering period
uk: Період подання пропозицій та уточнень.

source: Pre qulification period
uk: Перед-кваліфікаційний період

source: Standstill before auction
uk: Блокування перед аукціоном.

source: Auction period (auction)
uk: Період аукціону (аукціон)

source: Winner qualification (qualification)
uk: Кваліфікація переможця (кваліфікація)

source: Standstill period (standstill)
uk: Період блокування (блокування)

source: Complete tender (complete)
uk: Завершена закупівля (завершена)

source: Unsuccessful tender (unsuccessful)
uk: Закупівля не відбулась (не відбулась)

source: Cancelled tender (cancelled)
uk: Відмінена закупівля (відмінена)

source: Status of the Tender.
uk: Статус Закупівлі.

source: List of :ref:`lot` objects.
uk: Список об’єктів :ref:`lot`.

source: Contains all tender lots.
uk: Містить всі лоти закупівлі.

source: List of :ref:`Qualification` objects.
uk: Список об’єктів :ref:`Qualification`.

source: Contains all tender qualifications.
uk: Містить всі кваліфікації закупівлі.

source: List of :ref:`cancellation` objects.
uk: Список об’єктів :ref:`cancellation`.

source: Contains 1 object with `active` status in case of cancelled Tender.
uk: Містить 1 об’єкт зі статусом `active` на випадок, якщо закупівлю буде відмінено.

source: The :ref:`cancellation` object describes the reason of tender cancellation contains accompanying documents if any.
uk: Об’єкт :ref:`cancellation` описує причину скасування закупівлі та надає відповідні документи, якщо такі є.

source: Historical changes to Tender object properties.
uk: Зміни властивостей об’єктів Закупівлі

source: The Tender dates should be sequential:
uk: Дати закупівлі повинні бути послідовними:

source: Current time
uk: Поточний час

source: This period consists of qualification and 10 days of stand still period.
uk: Цей період включає кваліфікацію та 10-денний період блокування.

source: string, auto-generated, read-only
uk: рядок, генерується автоматично, лише для читання

source: List of :ref:`revision` objects, auto-generated
uk: Список об’єктів :ref:`revision`, генерується автоматично
