Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/standard/transaction.po
Languages: uk

source: Schema
uk: Схема

source: string, required
uk: рядок, обов'язково

source: A unique identifier for this transaction.
uk: Унікальний ідентифікатор транзакції

source: List of strings, required
uk: Список рядків, обов'язково

source: Used to point either to a corresponding Fiscal Data Package, IATI file, or machine or human-readable source
uk: Використовується для вказівки або на відповідний пакет Fiscal Data Package, або на файл IATI, або на машинне чи людське джерело

source: string, :ref:`date`, required
uk: рядок, :ref:`date`, обов'язково

source: The date of the transaction.
uk: Дата транзакції

source: :ref:`Guarantee`, required
uk: :ref:`Guarantee`, обов'язково

source: The value of the transaction.
uk: Значення транзакції

source: :ref:`OrganizationReference`, required
uk: :ref:`OrganizationReference`, обов'язково

source: An organization reference for the organization from which the funds in this transaction originate.
uk: Довідка організації про організацію, з якої походять кошти в цій транзакції.

source: An organization reference for the organization which receives the funds in this transaction.
uk: Довідка організації про організацію, яка отримує кошти за цією транзакцією.

source: The current status of transaction.
uk: Поточний стан транзакції.
