Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/esco/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Exploring basic rules
uk: Базові правила

source: Let's try exploring the `/tenders` endpoint:
uk: Подивимось як працює точка входу `/tenders`:

source: Just invoking it reveals empty set.
uk: При виклику видає пустий набір.

source: Now let's attempt creating some tender:
uk: Спробуймо створити нову закупівлю:

source: Error states that the only accepted Content-Type is `application/json`.
uk: Помилка вказує, що єдиний прийнятний тип вмісту це `application/json`.

source: Let's satisfy the Content-type requirement:
uk: Задовільнимо вимогу типу вмісту:

source: Error states that no `data` has been found in JSON body.
uk: Помилка вказує, що `data` не знайдено у тілі JSON.

source: Creating tender
uk: Створення закупівлі

source: Let's provide the data attribute in the submitted body :
uk: Введемо data атрибут у поданому тілі:

source: Success! Now we can see that new object was created. Response code is `201` and `Location` response header reports the location of the created object. The body of response reveals the information about the created tender: its internal `id` (that matches the `Location` segment), its official `tenderID` and `dateModified` datestamp stating the moment in time when tender was last modified. Note that tender is created with `active.tendering` status.
uk: Успіх! Тепер ми бачимо, що новий об’єкт було створено. Код відповіді `201` та заголовок відповіді `Location` вказує місцерозташування створеного об’єкта. Тіло відповіді показує інформацію про створену закупівлю, її внутрішнє `id` (яке співпадає з сегментом `Location`), її офіційне `tenderID` та `dateModified` дату, що показує час, коли закупівля востаннє модифікувалась. Зверніть увагу, що закупівля створюється зі статусом `active.tendering`.

source: The peculiarity of the ESCO procedure is that ``procurementMethodType`` is ``esco``. Also, new fields ``NBUdiscountRate``, ``minimalStepPercentage``, ``fundingKind``, ``yearlyPaymentsPercentageRange`` were added to tender object.
uk: Особливість відкритих торгів з публікацією англ. мовою в тому, що ``procurementMethodType`` було змінено з ``belowThreshold`` на ``aboveThresholdEU``. Також тут неможливо встановити ``enquiryPeriod``, бо він буде призначений автоматично.

source: There is also no opportunity to set up ``enquiryPeriod``, it will be assigned automatically.
uk: Також немає можливості встановити ``enquiryPeriod``, значення буде встановлене автоматично.

source: Let's access the URL of the created object (the `Location` header of the response):
uk: Використаємо URL створеного об’єкта (заголовок відповіді `Location`):

source: We can see the same response we got after creating tender.
uk: Ми бачимо ту ж відповідь, що і після створення закупівлі.

source: Let's see what listing of tenders reveals us:
uk: Подивимось, що показує список закупівель:

source: We do see the internal `id` of a tender (that can be used to construct full URL by prepending `http://api-sandbox.openprocurement.org/api/0/tenders/`) and its `dateModified` datestamp.
uk: Ми бачимо внутрішнє `id` закупівлі (що може бути використано для побудови повної URL-адреси, якщо додати `http://api-sandbox.openprocurement.org/api/0/tenders/`) та її `dateModified` дату.

source: Modifying tender
uk: Редагування закупівлі

source: Let's update tender by supplementing it with all other essential properties:
uk: Оновимо закупівлю шляхом надання їй усіх інших важливих властивостей:

source: We see the added properies have merged with existing tender data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними закупівлі. Додатково оновлена властивість `dateModified`, щоб відображати останню дату модифікації.

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Procuring entity can not change tender if there are less than 7 days before tenderPeriod ends. Changes will not be accepted by API.
uk: Замовник не може редагувати закупівлю, якщо залишилось менше 7 днів до завершення періоду подання пропозицій. API таких змін не прийме.

source: That is why tenderPeriod has to be extended by 7 days.
uk: Ось чому потрібно продовжити період подання пропозицій (`tenderPeriod`) на 7 днів.

source: Procuring entity can set bid guarantee:
uk: Замовник може встановити забезпечення тендерної пропозиції

source: Uploading documentation
uk: Завантаження документів

source: Procuring entity can upload PDF files into the created tender. Uploading should follow the :ref:`upload` rules.
uk: Замовник може завантажити PDF файл у створену закупівлю. Завантаження повинно відбуватись згідно правил :ref:`upload`.

source: `201 Created` response code and `Location` header confirm document creation. We can additionally query the `documents` collection API endpoint to confirm the action:
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ було створено. Додатково можна зробити запит точки входу API колекції документів (`documents`), щоб підтвердити дію:

source: The single array element describes the uploaded document. We can upload more documents:
uk: Один елемент масиву описує завантажений документ. Ми можемо завантажити більше документів:

source: And again we can confirm that there are two documents uploaded.
uk: І знову можна перевірити, що є два завантажених документа.

source: In case we made an error, we can reupload the document over the older version:
uk: Якщо сталась помилка, ми можемо ще раз завантажити документ поверх старої версії:

source: And we can see that it is overriding the original version:
uk: І ми бачимо, що вона перекриває оригінальну версію:

source: Enquiries
uk: Уточнення і запитання

source: When tender has ``active.tendering`` status and ``Tender.enquiryPeriod.endDate`` hasn't come yet, interested parties can ask questions:
uk: Якщо закупівля має статус ``active.tendering`` та дата завершення періоду подання пропозицій ``Tender.enqueryPeriod.endDate`` ще не прийшла , то зацікавлені учасники можуть задавати питання чи просити уточнень умов закупівлі:

source: Procuring entity can answer them:
uk: Замовник може відповісти на них:

source: One can retrieve either questions list:
uk: Можна отримати список запитань:

source: or individual answer:
uk: або окрему відповідь:

source: Enquiries can be made only during ``Tender.enquiryPeriod``
uk: Запитання можна задавати лише протягом періоду уточнень ``Tender.enqueryPeriod``.

source: Registering bid
uk: Реєстрація пропозиції

source: Bid registration
uk: Реєстрація пропозиції

source: Tender status ``active.tendering`` allows registration of bids.
uk: Статус закупівлі ``active.tendering`` дозволяє реєстрацію пропозицій.

source: Bidder can register a bid with `draft` status:
uk: Учасник може зареєструвати ставку із статусом ``draft`` (чернетка):

source: and approve to pending status:
uk: і підтвердити її, перевівши у ``pending`` статус:

source: Proposal Uploading
uk: Завантаження пропозиції

source: Then bidder should upload proposal technical document(s):
uk: Потім учасник повинен завантажити документ(и) пропозиції:

source: Confidentiality
uk: Конфіденційність

source: Documents can be either public or private:
uk: Документи можуть бути або публічними, або приватними:

source: Privacy settings can be changed only for the latest version of the document.
uk: Приватність документа можна змінити тільки для останньої версії.

source: When you upload new version of the document, privacy settings are copied from the previous version.
uk: При завантаженні нової версії, налаштування приватності копіюються з попередньої версії документа.

source: Privacy settings can be changed only during `tenderPeriod` (with `active.tendering` status).
uk: Налаштування приватності можна міняти тільки під час періоду подання пропозицій (зі статусом `active.tendering`).

source: If tender has status `active.qualification` winner can upload only public documents.
uk: Якщо закупівля має статус `active.qualification`, переможець може завантажувати тільки публічні документи.

source: Let's upload private document:
uk: Завантажимо приватний документ:

source: To define the document as "private" - `confidentiality` and `confidentialityRationale` fields should be set.
uk: Щоб зробити документ "приватним", потрібно встановити поля `confidentiality` та `confidentialityRationale`.

source: `confidentiality` field value can be either `buyerOnly` (document is private) or `public` (document is publicly accessible).
uk: Значенням поля `confidentiality` може бути або `buyerOnly` - документ приватний, або `public` - документ публічно доступний.

source: Content of private documents (`buyerOnly`) can be accessed only by procuring entity or by participant who uploaded them.
uk: Вміст приватних документів (`buyerOnly`) закритий для всіх крім замовника і учасника, який подав ці документи.

source: `confidentialityRationale` field is required only for private documents and should contain at least 30 characters.
uk: Поле `confidentialityRationale` необхідне лише для приватних документів. Його значенням має бути пояснення причини конфіденційності документа (не менше ніж 30 символів).

source: Let's mark the document as "private":
uk: Позначимо документ як "приватний":

source: It is possible to check the uploaded documents:
uk: Можна перевірити завантажені документи:

source: Financial, eligibility and qualification documents uploading
uk: Завантаження документів, що підтверджують відповідність, фінансових та кваліфікаційних документів.

source: Financial, eligibility and qualification documents are also a part of Bid but are located in different end-points.
uk: Документи, що підтверджують відповідність, фінансові та кваліфікаційні документи також є частиною пропозиції, але зберігаються в різних точках входу.

source: In order to create and/or get financial document ``financial_documents`` end-point should be used:
uk: Для того, щоб створити і/або отримати фінансові документи потрібно використати точку входу ``financial_documents``:

source: Get financial documents:
uk: Отримати фінансові документи:

source: In order to create and/or get eligibility document ``eligibility_documents`` end-point should be used:
uk: Для того, щоб створити і/або отримати документи, що підтверджують відповідність потрібно використати точку входу ``eligibility_documents``:

source: In order to create and/or get qualification document ``qualification_documents`` end-point should be used:
uk: Для того, щоб створити і/або отримати документи, що підтверджують кваліфікацію, потрібно використати точку входу ``qualification_documents``:

source: `Financial` and `qualification` documents will be publicly accessible after the auction. `Eligibility` documents will become publicly accessible starting from tender pre-qualification period.
uk: `Фінансові` та `кваліфікаційні` документи будуть публічно доступні після аукціону. Документи, `що підтверджують відповідність`, будуть публічно доступні на етапі прекваліфікації.

source: Here is bidder proposal with all documents.
uk: Пропозиція учасника зі всіма документами:

source: Note that financial, eligibility, and qualification documents are stored in `financialDocuments`, `eligibilityDocuments`, and `qualificationDocuments` attributes of :ref:`Bid`.
uk: Зверніть увагу, що документи, що підтверджують відповідність, фінансові та кваліфікаційні документи зберігаються у `eligibilityDocuments`, `financialDocuments` та `qualificationDocuments` атрибутах :ref:`Bid` відповідно.

source: Bid invalidation
uk: Пропозиція стає недійсною

source: If tender is modified, status of all bid proposals will be changed to ``invalid``. Bid proposal will look the following way after tender has been modified:
uk: Якщо закупівля була модифікована, статус всіх пропозицій змінюється на ``invalid`` (недійсний). Ось так пропозиція буде виглядати після редагування закупівлі:

source: Bid confirmation
uk: Підтвердження пропозиції

source: Bidder should confirm bid proposal:
uk: Учасник повинен підтвердити свою пропозицію:

source: ESCO procedure demands at least two bidders, so there should be at least two bid proposals registered to move to auction stage. So let's create second bid:
uk: Для того, щоб ESCO процедура відбулась, необхідно хоча б два учасника, тобто хоча б дві пропозиції повинні бути зареєстровані до початку аукціону:

source: Batch-mode bid registration
uk: Пакетний режим реєстрації

source: Register one more bid with documents using single request (batch-mode):
uk: У пакетному режимі (batch-mode) є можливість зареєструвати пропозицію одним запитом. Зареєструйте ще одну пропозицію:

source: Bid Qualification
uk: Кваліфікація пропозицій

source: ESCO procedure requires bid qualification.
uk: Для ESCO процедури необхідна кваліфікація значень пропозицій.

source: Let's list qualifications:
uk: Переглянемо список кваліфікацій:

source: Approve first two bids through qualification objects:
uk: Підтвердіть перші дві пропозиції через кваліфікаційні об’єкти:

source: We can also reject bid:
uk: Можна відхилити пропозицію:

source: And check that qualified bids are switched to `active`:
uk: Та перевірити, що вже кваліфіковані пропозиції переключені в стан `active`:

source: Rejected bid is not shown in `bids/` listing.
uk: Відхилена пропозиція не присутня в списку `bids/`.

source: We can access rejected bid by id:
uk: Можна отримати доступ до відхиленої пропозиції за її ідентифікатором `id`:

source: Procuring entity approves qualifications by switching to next status:
uk: Замовник підтверджує кваліфікацію переходом до наступного статусу:

source: You may notice 10 day stand-still time set in `qualificationPeriod`.
uk: Зверніть увагу на період блокування в 10 днів під час `qualificationPeriod`.

source: Auction
uk: Аукціон

source: After auction is scheduled anybody can visit it to watch. The auction can be reached at `Tender.auctionUrl`:
uk: Після того, як аукціон заплановано, будь-хто може його відвідати для перегляду. Аукціон можна подивитись за допомогою `Tender.auctionUrl`:

source: Bidders can find out their participation URLs via their bids:
uk: Учасники можуть дізнатись свої URL-адреси для участі через свої пропозиції:

source: See the `Bid.participationUrl` in the response. Similar, but different, URL can be retrieved for other participants:
uk: Дивіться на `Bid.participationUrl` у відповіді. Схожу, але іншу, URL-адресу можна отримати для інших учасників.

source: Confirming qualification
uk: Кваліфікація пропозицій

source: Qualification commission registers its decision via the following call:
uk: Кваліфікаційна комісія реєструє своє рішення:

source: Setting contract value
uk: Встановлення вартості угоди

source: By default contract value `amountNet` is set based on the award value `amount`, but there is a possibility to set custom contract value.
uk: За замовчуванням вартість угоди без урахування ПДВ встановлюється на основі рішення про визначення переможця, але є можливість змінити це значення.

source: Let's set contract contract value with next request:
uk: Встановимо нові значення для поля `value` використовуючи наступний запит:

source: `200 OK` response was returned. The value was modified successfully.
uk: Було повернуто код відповіді `200 OK`. Значення змінено успішно.

source: Setting contract signature date
uk: Встановлення дати підписання угоди

source: There is a possibility to set custom contract signature date. You can insert appropriate date into the `dateSigned` field.
uk: Є можливість встановити дату підписання угоди. Для цього вставте відповідну дату в поле `dateSigned`.

source: If this date is not set, it will be auto-generated on the date of contract registration.
uk: Якщо ви не встановите дату підписання, то вона буде згенерована автоматично під час реєстрації угоди.

source: Setting contract validity period
uk: Встановлення терміну дії угоди

source: Setting contract validity period is optional, but if it is needed, you can set appropriate `startDate` and `endDate`.
uk: Встановлення терміну дії угоди необов’язкове, але, якщо є необхідність, ви можете встановити відповідну дату початку `startDate` та кінця `endDate` терміну дії.

source: Uploading contract documentation
uk: Завантаження документації по угоді

source: You can upload contract documents for the ESCO procedure.
uk: Ви можете завантажити документи угоди для ESCO торгів

source: Let's upload contract document:
uk: Завантажимо документ угоди:

source: `201 Created` response code and `Location` header confirm that this document was added.
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ було додано.

source: Let's see the list of contract documents:
uk: Подивимось на список документів пов’язаних з угодою:

source: We can upload another contract document:
uk: Можна завантажити ще один документ угоди:

source: `201 Created` response code and `Location` header confirm that the second document was uploaded.
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що ще один документ було додано.

source: By default, document language is Ukrainian. You can can change it and set another language for the document by assigning appropriate language code to the `language` field (available options: ``uk``, ``en``, ``ru``). You can also set document's title (e.g. `title_en`) and description (e.g. `description_en`) fields. See :ref:`Document` data structure for details.
uk: За замовчуванням мовою документа є українська. Ви можете змінити це і встановити іншу мову для документа, призначивши відповідний код мови полю `language` (можливі варіанти: ``uk``, ``en``, ``ru``). Ви можете також додати поля назви (наприклад, `title_en`) та опису (наприклад, `description_en`). Див. структуру даних :ref:`Document` для більш детальної інформації.

source: Let's see the list of all added contract documents:
uk: Подивимось список усіх доданих документів угоди:

source: Let's view separate contract document:
uk: Переглянемо окремий документ угоди:

source: Cancelling tender
uk: Скасування закупівлі

source: Tender creator can cancel tender anytime. The following steps should be applied:
uk: Замовник може скасувати закупівлю у будь-який момент. Для цього виконайте наступні кроки:

source: Prepare cancellation request.
uk: Приготуйте запит на скасування.

source: Fill it with the protocol describing the cancellation reasons.
uk: Наповніть його протоколом про причини скасування.

source: Cancel the tender with the prepared reasons.
uk: Скасуйте закупівлю через подані причини.

source: Only the request that has been activated (3rd step above) has power to cancel tender. I.e. you have to not only prepare cancellation request but to activate it as well.
uk: Запит на скасування, який не пройшов активації (3-й крок), не матиме сили, тобто, для скасування закупівлі буде обов’язковим не тільки створити заявку, але і активувати її.

source: See :ref:`cancellation` data structure for details.
uk: Дивіться структуру запиту :ref:`cancellation` для більш детальної інформації.

source: Preparing the cancellation request
uk: Формування запиту на скасування

source: You should pass `reason`, `status` defaults to `pending`.
uk: Ви повинні передати змінні `reason`, `status` у стані `pending`.

source: `id` is autogenerated and passed in the `Location` header of response.
uk: `id` генерується автоматично і повертається у додатковому заголовку відповіді `Location`:

source: There are two possible types of cancellation reason: tender was `cancelled` or `unsuccessful`. By default ``reasonType`` value is `cancelled`.
uk: При скасуванні, замовник має визначити один з двох типів ``reasonType``: торги відмінені - `cancelled`, або торги не відбулися - `unsuccessful`. За замовчуванням, значення ``reasonType`` рівне `cancelled`.

source: You can change ``reasonType`` value to `unsuccessful`.
uk: Ви можете виправити тип на `unsuccessful` (торги не відбулися).

source: Filling cancellation with protocol and supplementary documentation
uk: Наповнення протоколом та іншою супровідною документацією

source: Upload the file contents
uk: Завантажте вміст файлу

source: Change the document description and other properties
uk: Змініть опис документа та інші властивості

source: Upload new version of the document
uk: Завантажте нову версію документа

source: Activating the request and cancelling tender
uk: Активація запиту та скасування закупівлі

source: We can check if tender was actually cancelled.
uk: Перевіримо чі дійсно тендер було скасовано

source: Now ``status`` value is `cancelled`.
uk: Тепер ``status`` має значення `cancelled`.
