Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/centralized-procurements/index.po
Languages: uk

source: Centralized procurements
uk: Централізовані закупівлі

source: Creating plan procurement
uk: Створення плану закупівлі

source: Buyer creates a plan. He should specify himself in `buyers` list and point at one of the central procurement organizations in `procuringEntity` field:
uk: Покупець створює план. Він повинен вказати себе в списку покупців `buyers` і вказати на одну з центральних закупівельних організацій у полі `procuringEntity`:

source: Creating approve milestone
uk: Створення об’єкту відповіді

source: As central procurement organization sees itself as `procuringEntity` of a plan, it can post milestones to this plan:
uk: Коли центральна організація є `procuringEntity` плану, вона може додати відповідь до цього плану:

source: Only if the access token from the response is provided, the milestone can be changed later:
uk: Тільки якщо надається токен доступу, відповідь можна змінити:

source: The fields you can update depend on current milestone status:
uk: Поля, які можна оновити, залежать від поточного статусу об’єкту:

source: `dueDate` can only be updated at `scheduled` milestone status
uk: `dueDate` можна оновити лише у статусі `scheduled`

source: `description` - either at `scheduled` or `met`
uk: `description` - у `scheduled` та `met`

source: Posting documents is also require the milestone access token (as well as changing documents using PATCH/PUT methods):
uk: Публікація документів також вимагає токен доступу (як і зміна документів за допомогою методів PATCH / PUT):

source: Creating tender
uk: Створення закупівлі

source: The central procurement organization creates an aggregated tender in `draft` status and specifies all the buyer organizations using `buyers` list of :ref:`PlanOrganization`:
uk: Центральна закупівельна організація створює агрегований тендер у статусі `draft` і вказує всіх покупців, використовуючи `buyers` список об’єктів :ref:`PlanOrganization`:

source: Connecting plans to the tender
uk: Зв’язування планів з тендером

source: The central procurement organization connects the plan to the tender. If there are many plans, they should be connected one by one.
uk: Центральна організація закупівель зв’язує план з тендером. Якщо є більш ніж один план, вони повинні бути з'єднані один за одним.

source: As a result the plan is moved to "complete" status
uk: У результаті план переміщається у статус “complete”

source: The tender `plans` field contains all the plan ids
uk: Поле `plans` тендеру містить всі ідентифікатори планів

source: Creation of aggregate contracts
uk: Створення агрегованих контрактів

source: For each `buyer` object in tender system is creating separate `contract` respectively when `award` become active.
uk: Для кожного об'єктку `buyer` в тендері система створює окремий `contract` відповідно, в той момент коли `award` стає активним.

source: Create tender with several buyers, each `item` should be assigned to related `buyer` using `relatedBuyer` field :
uk: Створюємо тендер з декількома buyers, кожен `item` повинен бути прив'язаний до відповідного `buyer`, використовючи поле `relatedBuyer`:

source: Move forward as usual, activate award:
uk: Йдемо далі, як зазвичай, активуємо авард

source: After activating award system is creating such amount of contracts that corresponds to the amount of buyers
uk: Після активації аварду система створює таку кількість об'єктів contracts, що відповідає кількості buyers в тендері

source: Update Amount.Value of each contract considering the sum of product of Unit.Value by Quantity for each item in contract.
uk: Оновлюємо Amount.Value для кожного контракту, враховуючи суму добутків Unit.Value на Quantity для кожного item в контракті:

source: You can activate or terminate each contract as usual. If there are not contracts in `pending` status and at least one contract became `active` tender is becoming `complete`
uk: Ви можете активувати або термінувати кожен контракт як зазвичай. Якщо відсутні контракти в стутусі `pending` та хоча б один котракт знаходиться в статусі `active`, тендер переходить в статус `complete`

source: If award was cancelled, all contracts related to this awardID become in cancelled status.
uk: При скасуванні аварду всі контракти відповідного awardID переходять в статус cancelled.

source: Cancellation of aggregate contracts
uk: Відміна агрегованих контрактів

source: Contracts can be cancelled:
uk: Контракт може бути відмінений:

source: Except when contract is the last not cancelled contract:
uk: За винятком коли котракт є останнім невідміненим контрактом:

source: In that case related award should be cancelled:
uk: В цьому випадку повинен бути відмінений відповідний авард:

source: Let's check all contracts are cancelled:
uk: Перевіримо що всі контракти відмінені:
