Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/competitivedialogue/complaints.po
Languages: uk

source: Complaint Workflow
uk: Схема роботи оскаржень

source: Tender Conditions Claims/Complaints
uk: Вимоги/Скарги на умови закупівлі

source: Tender Qualification Complaints
uk: Скарги на кваліфікацію

source: Tender Award Complaints
uk: Скарги на визначення переможця

source: Roles
uk: Ролі

source: dashed
uk: пунктирна лінія

source: plain
uk: звичайна лінія

source: bold
uk: жирна лінія

source: dotted
uk: пунктирна лінія з крапками

source: Statuses
uk: Статуси

source: Initial status
uk: Початковий статус

source: Complainant can submit claim, upload documents, cancel claim, and re-submit it.
uk: На цьому етапі скаржник може подати вимогу, завантажити документи, відкликати вимогу та подати її знову.

source: Procuring entity can upload documents and answer to claim.
uk: Замовник може завантажити документи та відповісти на вимогу.

source: Complainant can cancel claim.
uk: Скаржник може відкликати вимогу.

source: Complainant can cancel claim, upload documents, accept solution or escalate claim to complaint.
uk: Скаржник може відкликати вимогу, завантажити документи, погодитись з вирішенням або перетворити вимогу на скаргу.

source: Reviewer can upload documents and review complaint.
uk: Орган оскарження може завантажувати документи та розглядати скарги.

source: Terminal status
uk: Кінцевий статус

source: Complaint recognized as invalid.
uk: Скаргу визнано недійсною.

source: Complaint recognized as declined.
uk: Скаргу визнано відхиленою.

source: Complaint recognized as resolved.
uk: Скаргу визнано вирішеною.

source: Complaint cancelled by complainant.
uk: Скаргу відкликано скаржником.
