Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/agreements/tutorial_cfaua.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Exploring basic rules
uk: Базові правила

source: Let's try exploring the `/agreements` endpoint:
uk: Подивимось як працює точка входу `/agreements`:

source: Just invoking it reveals an empty set.
uk: При виклику видає пустий набір.

source: Agreement is transferred from the tender system by an automated process.
uk: Угода автоматично переноситься з модуля тендера.

source: Creating agreement
uk: Створення угоди

source: Let's say that we have conducted tender and it has ``complete`` status. When the tender is completed, agreement (that has been created in the tender system) is transferred to the agreement system **automatically**.
uk: Припустимо, що ми провели тендер, який зараз є в статусі ``complete``. Після завершення тендера, угода, яка була створена в модулі тендера, переноситься у модуль угод **автоматично**.

source: *Brokers (eMalls) can't create agreements in the agreement system.*
uk: *Майданчики (eMalls) не можуть створити угоди в модулі угод.*

source: Getting agreement
uk: Отримання угоди

source: Agreement in the tender system
uk: Угода в модулі тендера

source: *Agreement id is the same in both tender and agreement system.*
uk: *Ідентифікатор угоди є тим самим і в модулі тендера, і в модулі угод.*

source: Let's access the URL of the created object inside agreement system:
uk: Звернемося до URL-адреси створеного об'єкта в модулі угод:

source: Getting access
uk: Отримання доступу

source: In order to get rights for future agreement editing, you need to use this view ``PATCH: /agreements/{id}/credentials?acc_token={tender_token}`` with the API key of the eMall (broker), where tender was generated.
uk: Для того, щоб отримати права для редагування угоди в майбутньому, вам потрібно виконати ``PATCH: /agreements/{id}/credentials?acc_token={tender_token}`` з ключами майданчика до API, яким був згенерований тендер.

source: In the ``PATCH: /agreements/{id}/credentials?acc_token={tender_token}``:
uk: У ``PATCH: /agreements/{id}/credentials?acc_token={tender_token}``:

source: ``id`` stands for agreement id,
uk: ``id`` - ідентифікатор угоди,

source: ``tender_token`` is tender's token (is used for agreement token generation).
uk: ``tender_token`` - це токен тендера (використовується для генерації токена угоди).

source: Response will contain ``access.token`` for the agreement that can be used for further agreement modification.
uk: Відповідь міститиме ``access.token`` для угоди, який можна використовувати для майбутнього редагування угоди.

source: Let's view agreements.
uk: Подивимось на угоди.

source: We do see the internal `id` of a agreement (that can be used to construct full URL by prepending `http://api-sandbox.openprocurement.org/api/0/agreements/`) and its `dateModified` datestamp.
uk: Бачимо внутрішні `id` угоди, який може бути використаний для побудови повної URL-адреси за допомогою додавання `http://api-sandbox.openprocurement.org/api/0/agreements/`, а також дату `dateModified`.

source: Modifying agreement
uk: Редагування угоди

source: **Essential agreement terms** can be modified by the submission of a new `change` object to the `Agreement.changes` container. `Change` can be one of this types :ref:`ChangeTaxRate`, :ref:`ChangeItemPriceVariation`, :ref:`ChangePartyWithdrawal` or :ref:`ChangeThirdParty`
uk: **Основні умови договору** можуть бути модифіковані поданням нових об'єктів `change` у контейнер `Agreement.changes`. `Change` може бути таких типів: :ref:`ChangeTaxRate`, :ref:`ChangeItemPriceVariation`, :ref:`ChangePartyWithdrawal` або :ref:`ChangeThirdParty`

source: All `changes` are processed by the endpoint `/agreement/{id}/changes`.
uk: Усі об'єкти `changes` обробляються точкою входу `/agreement/{id}/changes`.

source: Submitting a change
uk: Подання зміни

source: Let's add new `change` to the agreement:
uk: Додамо новий `change` до угоди:

source: Note that you should provide value in ``rationaleType`` field. This field is required.
uk: Візьміть до уваги, потрібно заповнити обов'язкове поле ``rationaleType``.

source: You can view the `change`:
uk: Подивимось на `change`:

source: `Change` can be modified while it is in the ``pending`` status:
uk: `Change` може бути модифікований, поки об'єкт в статусі ``pending``:

source: Uploading change document
uk: Завантаження документів до змін

source: Document can be added only while `change` is in the ``pending`` status.
uk: Документ може бути доданий тільки тоді, коли `change` в статусі ``pending``.

source: Document has to be added in two stages:
uk: Документи додаються в два етапи:

source: you should upload document
uk: завантажте документ

source: you should set document properties ``"documentOf": "change"`` and ``"relatedItem": "{change.id}"`` in order to bind the uploaded document to the `change`:
uk: налаштуйте властивості документу ``"documentOf": "change"`` і ``"relatedItem": "{change.id}"`` для того, щоб підв'язати заватажений документ до об'єкту `change`:

source: Updating agreement properties
uk: Оновлення властивостей угоди

source: Now you can update agreement properties which belong to the change.
uk: Тепер можете оновити властивості угоди, які належать зміні.

source: In case of multiple :ref:`Item` you are allowed to change in `modifications` each `factor`.
uk: Є можливість змінювати кожен `factor` в `modifications` у випадку декількох :ref:`Item`.

source: Agreement preview
uk: Попередній перегляд угоди

source: Also, while `change` is in the ``pending`` status, you can see agreement as `change` would be applied. You need to use this view ``GET: /agreements/{id}/preview?acc_token={agreement_token}``.
uk: Також, поки `change` в статусі ``pending``, можна бачити угоду, оскільки зміни будуть застосовані. Необхідно використати ``GET: /agreements/{id}/preview?acc_token={agreement_token}``.

source: As you can see, `value.amount` on `contracts` `unitPrices` are changed due `modification` is applied. So if this `modification` is what you need, you can apply `change`.
uk: Як бачимо, `value.amount` на `unitPrices` об'єкту `contracts` змінюється після прийняття змін. Тож, якщо ці `зміни` - це те, що вам потрібно, то ви можете подати об'єкт `change`.

source: Applying the change
uk: Застосування зміни

source: `Change` can be applied by switching to the ``active`` status.
uk: `Change` може бути застосована після переходу в статус ``active``.

source: In order to apply ``active`` status `dateSigned` field must be set.
uk: Для того, щоб застосувати статус ``active``, має бути налаштоване поле `dateSigned`.

source: After this `change` can't be modified anymore.
uk: Після цього `change` не можна більше модифікувати.

source: `dateSigned` field validation:
uk: Валідація поля `dateSigned`:

source: for the first agreement `change` date should be after `agreement.dateSigned`;
uk: для першої `change` в угоді, дата повинна бути після `agreement.dateSigned`;

source: for all next `change` objects date should be after the previous `change.dateSigned`.
uk: для всіх наступних об'єктів `change`, дата повинна бути після попередньої `change.dateSigned`.

source: You can view all changes:
uk: Подивимось на всі зміни:

source: All changes are also listed on the agreement view.
uk: Всі зміни також перераховані у view угоди.

source: Uploading documentation
uk: Завантаження документів

source: Procuring entity can upload PDF files into the created agreement. Uploading should follow the `upload` rules.
uk: Замовник може завантажити PDF-файли в створену угоду. Завантаження повинне слідувати правилам завантаження.

source: `201 Created` response code and `Location` header confirm document creation. We can additionally query the `documents` collection API endpoint to confirm the action:
uk: Код відповіді 201 Created та заголовок Location підтверджують, що документ було додано. Додатково можна запитати точку входу API колекції `documents` для підтвердження дії:

source: And again we can confirm that there are two documents uploaded.
uk: І знову можна підтвердити, що два документи завантажені.

source: In case we made an error, we can reupload the document over the older version:
uk: У випадку помилки, можна заново завантажити документ поверх старої версії:

source: And we can see that it is overriding the original version:
uk: І можна побачити, що цей документ переважає оригінальну версію:

source: Completing agreement
uk: Завершення угоди

source: Agreement can be completed by switching to ``terminated`` status. Let's perform these actions in single request:
uk: Угода може бути завершена переходом в статус ``terminated``. Давайте виконаємо ці дії одним запитом:

source: If agreement is unsuccessful reasons for termination ``terminationDetails`` should be specified.
uk: Якщо угода неуспішна, причини припинення угоди повинні бути вказані в полі ``terminationDetails``.

source: Any future modification to the agreement are not allowed.
uk: Будь-які майбутні зміни в угоді не дозволяються.

source: It may be useful to see top requirements: `Test Cases for III level of accreditation <https://docs.google.com/spreadsheets/d/1-AT2RjbnSFAP75x6YNDvhKeN2Cy3tMlG6kb0tt6FScs/edit#gid=0>`_ and `Test Cases for IV level of accreditation <https://docs.google.com/spreadsheets/d/1-93kcQ2EeuUU08aqPMDwMeAjnG2SGnEEh5RtjHWOlOY/edit#gid=0>`_.
uk: Можливо, буде корисно побачити актуальні вимоги: `Сценарії ручного тестування для III рівня акредитації <https://docs.google.com/spreadsheets/d/1-AT2RjbnSFAP75x6YNDvhKeN2Cy3tMlG6kb0tt6FScs/edit#gid=0>`_ і `Сценарії ручного тестування для IV рівня акредитації <https://docs.google.com/spreadsheets/d/1-93kcQ2EeuUU08aqPMDwMeAjnG2SGnEEh5RtjHWOlOY/edit#gid=0>`_.
