Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/24hours.po
Languages: uk_ua

source: "24 hours"
uk_ua: "24 години"

source: During the qualification process (or pre-qualification if the procedure has one) procuring entity can decide to allow a bidder to upload more documents to their bid, add/change `evidences` for requirementResponses. or update particular fields in bid.
uk_ua: Під час кваліфікаційного процесу (або попередньої кваліфікації, якщо процедура має таку), замовник може прийняти рішення дозволити учаснику торгів дозавантажувати документи до своєї заявки, додавати/змінювати `evidences` у вигляді файлів або змінити ряд полів у своїй пропозиції.

source: The fields that may be updated during 24 hours milestone:
uk_ua: Поля, які дозволено змінювати при застосуванні `milestone:code:24h`:

source: Example of posting :ref:`qualificationmilestone` for qualification
uk_ua: Приклад розміщення :ref:`qualificationmilestone` для кваліфікації

source: Example of pre-qualification
uk_ua: Приклад попередньої кваліфікації

source: The "dueDate" field in the response indicates the end of the period when procuring entity is unable to make a decision on the qualification object
uk_ua: Поле “dueDate” у відповіді вказує на кінець періоду, під час якого замовник не може прийняти рішення щодо об’єкта кваліфікації

source: The bidder can post new documents to their bid
uk_ua: Учасник торгів може розмістити нові документи на свою заявку

source: The bidder can update their documents
uk_ua: Учасник торгів може оновити свої документи

source: The bidder can update some fields in bid:
uk_ua: Учасник торгів може змінити ряд полів у своїй пропозиції:

source: If updated field is not forbidden, we will see an error:
uk_ua: Якщо це поля, які змінювати заборонено, то ми побачимо помилку:

source: The bidder can update `requirementResponses` for his bid.
uk_ua: Учасник торгів може змінювати відповіді на критерії `requirementResponses` у своїй пропозиції.

source: For example, the bidder can delete `requirementResponses` from one requirementGroup in article 17:
uk_ua: Наприклад, учасник може видалити попередню відповідь на одну `requirementGroup` статті 17:

source: and then add new `requirementResponses` for another requirementGroup in article 17:
uk_ua: і натомість надати відповідь на іншу `requirementGroup` статті 17:

source: The bidder can add/change `evidences` for requirementResponses:
uk_ua: Учасник може додавати/змінювати `evidences` у вигляді файлів:

source: If milestone `dueDate` already passed, it is forbidden to patch any field in bid:
uk_ua: Після закінчення `milestone.dueDate` в учасника немає можливості змінювати поля пропозиції:
