Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/bid-items.po
Languages: uk

source: Bid Items
uk: Предмет закупівлі в пропозиції

source: Items in bid are available in all types of procedures
uk: Предмет закупівлі в пропозиції доступний у всіх типах процедур

source: Creating bid with items
uk: Створюємо пропозицію з предметом закупівлі

source: To create a bid with a procurement item, you need to pass the `items` field with a value containing a list of :ref:`BidItem` .
uk: Щоб створити пропозицію з предметом закупівлі, вам потрібно передати поле items зі значенням, що містить список :ref:`BidItem`.

source: If you try to pass an item with an id that does not exist in tender.items, you will get an error:
uk: Якщо ви спробуєте передати предмет закупівлі з id, якого не існує в tender.items, ви отримаєте помилку:

source: VAT in `items.unit.value` can be only `False`. If you try to pass `True` you will see an error:
uk: VAT для `items.unit.value` може мати лише значення `False`. Якщо ви спробуєте передати значення `True`, ви отримаєте помилку:

source: Let's send correct data:
uk: Надішлемо правильні дані:

source: Update bid items
uk: Оновлення предмету закупівлі

source: You can update `quantity` and `unit` in bid items.
uk: Ви можете оновити `quantity` та `unit` предмета закупівлі в пропозиції

source: To update the data in items, you need to pass all elements from the list along with all data; otherwise, the data that is not passed will be lost:
uk: Щоб оновити дані в items, вам потрібно передати всі елементи зі списку разом з усіма даними; в іншому випадку, дані, які не передані, будуть втрачені:

source: Product in bid items
uk: Продукт в предметі закупівлі пропозиції

source: Instead of using eligibleEvidence in criteria and evidence in requirementResponses, now you can use product in bid.items.
uk: Замість використання eligibleEvidence у критерії та evidence у відповідях, можна використовувати `product` у `bid.items`.

source: Procedures with product in bid items
uk: Процедури з продуктом в предметі закупівлі

source: Product in bid items is available in these procedures:
uk: Продукт в предмет закупівлі доступний у таких процедурах:

source: Create bid with product in items
uk: Стоврення пропозиції з продуктом в предметі закупівлі

source: All of you need it's pass product identificator of active product from market to field `product` in bid.items.
uk: Все що вам потрібно це вказати ідентифікатор активного продукту з маркету в полі `product` у bid.items.

source: If you pass a non-existent identifier, you will get an error:
uk: Якщо ви спробуєте передати не існуючий ідентифікатор, ви отримаєте помилку:

source: if you try to pass identifier of product with `hidden` status, you'll also get error:
uk: Якщо ви спробуєте передати ідентифікатор продукту зі статусом `hidden`, ви отримаєте помилку:

source: So if all rules are met, you can create bid with product in items:
uk: тже, якщо всі правила дотримані, ви можете створити пропозицію з продуктом у предметі закупівлі:

source: Update product in bid items
uk: Оновлення продукту в предметі закупівлі

source: You can change product identifier using `PATCH` method on bid(All validations on creation also work on update):
uk: Ви можете змінити ідентифікатор продукту, використовуючи метод `PATCH` для пропозиції (усі перевірки, що здійснюються під час створення, також застосовуються під час оновлення):
