Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/complaints-tender-2020-04-19.po
Languages: uk

source: Claim/Complaint Retrieval
uk: Отримання інформації про вимоги/скарги

source: Tender Conditions Claim/Complaint Retrieval
uk: Отримання інформації про вимоги/скарги на умови закупівлі

source: You can list all Tender Conditions Claims/Complaints:
uk: Ви можете отримати список всіх вимог/скарг на умови закупівлі:

source: And check individual complaint or claim:
uk: Або перевірити окрему скаргу чи вимогу:

source: Complaint Submission
uk: Подання скарги

source: If tender conditions are favoriting particular supplier, or in any other viable case, any registered user can submit Tender Conditions Complaint.
uk: Якщо умови закупівлі сприятливі лише для одного постачальника або при будь-якому іншому серйозному порушенні, будь-який зареєстрований користувач може подати скаргу на умови закупівлі.

source: Tender Conditions Complaint Submission
uk: Подання скарги на умови закупівлі

source: At first create a draft:
uk: Створіть чернетку скарги ``draft``:

source: This step is optional. Upload documents:
uk: Цей крок не обов'язковий.Завантажте документи:

source: Submit tender conditions complaint:
uk: Подайте скаргу на умови закупівлі:

source: Complaint Objections
uk: Заперечення до скарги

source: When creating a complaint, the User can add one or more Objections raised by the Complainant as part of the complaint:
uk: При створенні скарги Користувач може додати одне або декілька Заперечень, що висуваються Скаржником в рамках скарги (objections):

source: Objections can be added or edited while complaint is in the status `draft`.
uk: Заперечення можуть бути додані або відредаговані, коли скарга знаходиться в статусі `draft`.

source: For each Objection, the Complainant must indicate one or more arguments. In other case there error will be raised:
uk: Для кожного Заперечення Скаржник обов'язково вказує одне або декілька Обгрунтуваннь (arguments). В іншому випадку буде помилка:

source: For each Arguments, the Complainant can indicate one or more evidences. Evidences can be empty:
uk: Для кожного Обгрунтування Скаржник може вказати один або декілька Доказів (evidences). Докази можуть бути пустими:

source: During adding evidence, the User must indicate related document id. This document should be uploaded to complaint. Let's upload document to complaint:
uk: Під час додавання Доказу, Користувач має вказати id відносного документу. Цей документ має попередньо бути завантаженим до скарги. Додамо документ до скарги:

source: After that User can indicate relatedDocument in evidence:
uk: Після цього Користувач може вказати relatedDocument в Доказі:

source: There is an opportunity to create complaint already with document which can be used as relatedDocument in evidences:
uk: Також є можливість подати скаргу одним запитом одразу з завантаженим документом, який можна вказати в Доказі як `relatedDocument`:

source: For each Objection, the Complainant must specify one or more requestedRemedies. In other case there error will be raised:
uk: Для кожного Заперечення Скаржник обов'язково вказує одну або декілька Вимог (requestedRemedies). В іншому випадку буде помилка:

source: Complaint Appeals
uk: Iнформація про оскарження скарги в суді

source: After the appeal body (AMCU) makes a decision on the complaint, the customer or participant may appeal such decision in court and publish information about it in the system:
uk: Після винесення рішення органом оскарження (АМКУ) по скарзі, замовник або учасник може оскаржити таке рішення в суді та опублікувати інформацію про це в системі:

source: Appeal can be added or edited while complaint is in the status:
uk: Iнформація про оскарження скарги в суді може бути додана або відредагована, коли скарга знаходиться в одному зі статусів:

source: If appeal is added for complaint in another status, error will be raised:
uk: Якщо інформація про оскарження скарги в суді буде додана на якомусь іншому статусі скарги, ми побачимо помилку:

source: More than 1 appeal object can be published for one complaint by both participants and the customer. Let's add one more appeal by customer:
uk: До однієї скарги може бути опубліковано більше одного об’єкту `appeal` як учасниками так і замовником. Додамо ще одну апеляцію до скарги замовником:

source: After `appeal` adding, the `proceeding` object can be added to the `appeal` object.
uk: Після публікації інформації про оскарження скарги в суді (`appeal`) можна додати інформацію про відкриття провадження (`proceeding`).

source: Information about the appeal and information about the proceeding are separate actions that are performed by the user gradually and can be performed with a gap in time:
uk: Інформація про оскарження скарги в суді та інформація про впровадження - це окремі дії, які виконуються користувачем поступово та може бути здійснено з проміжком у часі:

source: Only one `proceeding` object can be published to each appeal object:
uk: До кожного об’єкту `appeal` може бути опубліковано лише один об’єкт `proceeding`:

source: After adding information about the appeal and information about the proceeding, appeal should be signed. Document can be added through next endpoints:
uk: Після додавання інформації про оскарження скарги в суді та інформації про впровадження, необхідно накласти підпис. Документ можна додати через окремий ендпоінт:

source: Let's look at complaint with appeals:
uk: Подивимося на скаргу з опублікованою інформацією про оскарження скарги в суді:

source: Complaint Posts
uk: Запит до скарги

source: Once complaint is in `pending` or `accepted` status reviewer can submit a post to complaint.
uk: Для скарги у статусах 'pending' та 'accepted' орган оскарження має можливість додати запит на уточнення до скарги.

source: Tender Conditions Complaint Posts (with complaint owner)
uk: Запит до скарги на умови закупівлі (до скаржника)

source: Reviewer can submit a post to complaint owner:
uk: Орган оскарження може надати запит до скаржника:

source: Complaint owner can submit a reply post to reviewer by setting reviewer's post `id` as `relatedPost`:
uk: Скаржник має можливість надати відповідь на запит органу оскарження передавши поле `id` запиту у полі `relatedPost`:

source: Tender Conditions Complaint Posts (with tender owner)
uk: Запит до скарги на умови закупівлі (до замовника)

source: Reviewer can submit a post to tender owner:
uk: Орган оскарження може надати запит до замовника:

source: Tender owner can submit a reply post to reviewer by setting reviewer's post `id` as `relatedPost`:
uk: Замовник має можливість надати відповідь на запит органу оскарження передавши поле `id` запиту у полі `relatedPost`:

source: Tender Conditions Complaint Posts Documents
uk: Подання документів до запиту до скарги на умови закупівлі

source: Documents for posts should be added in complaint with `documentOf: post` and `relatedItem` id of current post.
uk: Документи до запиту до скарги мають бути додані до самої скарги з вказаними полями `documentOf: post` та `relatedItem` ідентифікатором самого запиту.

source: Documents for post could be added only during complaint is in `pending` or `accepted` status.
uk: Документи до запиту до скарги можуть бути додані поки скарга має статус `pending` чи `accepted`.

source: Only author of post can add documents for his post. Let's try to add documents for post created by tender owner using another author:
uk: Тільки автор запиту до скарги може додавати документ, який посилається на його запит. Спробуємо додати документи до запиту від замовника, від імені іншого автора (скаржника):

source: Let's add documents by tender owner:
uk: Додамо документи від імені замовника до його запиту:

source: Complaint Explanations
uk: Пояснення до скарги

source: An explanation of a complaint is a certain textual information and, if necessary, an attached file/files related to a certain complaint and can be used by the AMCU commission during its consideration. Explanations to the complaint are submitted by subjects on their own initiative, without a request from AMCU. AMCU will not respond to such explanations, but will only consider them.
uk: Пояснення до скарги - це певна текстова інформація та за потреби прикріплений файл/файли, що відносяться до певної скарги та можуть бути використані комісією АМКУ при її розгляді. Пояснення до скарги подаються суб'єктами з власної ініціативи, без запиту АМКУ. АМКУ не буде відповідати на такі пояснення, а лише розглядатиме їх.

source: Once complaint is in `pending` or `accepted` status complaint owner or tender owner can submit a post to complaint as explanation.
uk: Для скарги у статусах `pending` та `accepted` скаржник, що подав скаргу, або замовник закупівлі має можливість додати пояснення до скарги.

source: Each explanation must be related to one of the objections of the complaint (`complaints:objections`).
uk: Кожне пояснення обов'язково повинно відноситись до одного із пунктів скарги (`complaints:objections`).

source: Complaint owner or tender owner can submit an explanation via `posts`:
uk: Скаржник, що подав скаргу, або замовник закупівлі можуть додати пояснення до скарги за допомогою функціоналу `posts`:

source: The field `recipient` is forbidden for explanation post:
uk: Поле `recipient` заборонено для пояснень:

source: It is forbidden to answer an explanation can submit by setting explanation's post `id` as `relatedPost`:
uk: Заборонено надавати відповідь до пояснення, передавши поле `id` запиту у полі `relatedPost`:

source: Complaint Resolution
uk: Вирішення скарги

source: Rejecting Tender Conditions Complaint
uk: Відхилення скарги на умови закупівлі

source: Accepting Tender Conditions Complaint
uk: Прийняття скарги на умови закупівлі

source: Submitting Tender Conditions Complaint Resolution
uk: Подання рішення по скарзі на умови закупівлі

source: The Complaint Review Body uploads the resolution document:
uk: Орган, що розглядає скарги, завантажує документ з рішенням:

source: And either resolves complaint:
uk: Який або вирішує скаргу:

source: Or declines it:
uk: Або відхиляє:

source: Submitting Resolution Confirmation
uk: Подання підтведження вирішення скарги

source: Cancelling Tender Conditions Complaint
uk: Відміна скарги на умови закупівлі

source: Cancelling draft complaint by Complainant
uk: Відміна чернетки скарги скаржником

source: Cancelling accepted complaint by Reviewer
uk: Відміна прийнятої скарги рецензентом
