Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/complaints-award-2020-04-19.po
Languages: uk

source: Claim/Complaint Retrieval
uk: Отримання інформації про звернення/скарги

source: Tender Award Claim/Complaint Retrieval
uk: Отримання інформації про звернення/скарги на визначення переможця

source: You can list all Tender Award Claims/Complaints:
uk: Ви можете отримати список всіх звернень/скарг на визначення переможця:

source: And check individual complaint:
uk: І перевірити окрему скаргу:

source: Complaint Submission
uk: Подання скарги

source: If tender award is favoriting certain supplier, or in any other viable case, participants who were admitted to auction can submit Tender Award Complaint.
uk: Якщо тендерн вирішено з перевагою для певного постачальника або в будь-якій іншій життєздатній ситуації, учасники, які були прийняті до аукціону, можуть подати скаргу тендерної пропозиції.

source: Tender Award Complaint Submission for unsuccessful award
uk: Подання скарги на відмову переможця

source: For unsuccessful award it is allowed only that bidder of award can complain on his award.
uk: Якщо кваліфікаційна комісія відмовила переможцю (статус аварду `unssuccesful`), то в цьому випадку дозволено подавати скаргу тільки тому самому учаснику, для якого був створений цей авард.

source: Let's try to complain to unsuccessful award from another bidder and we will see an error:
uk: Спробуємо додати скаргу до `unssuccesful` аварду від імені іншого учасника (у вигляді токену доступу) і побачимо помилку:

source: Now let's make a complain from correct bidder:
uk: Тепер подамо скаргу від того ж самого учасника:

source: Tender Award Complaint Submission for the winner
uk: Подання скарги на визначення переможця

source: At first create a complaint. Send POST request with bidder's access token.
uk: Спочатку створимо скаргу. В запиті потрібно передати токен доступу одного з учасників.

source: When creating a complaint, the User can add one or more Objections raised by the Complainant as part of the complaint. Objections can be added or edited while complaint is in the status `draft`. For more details, see :ref:`tender complaint objections <complaint-objections>`.
uk: При створенні скарги Користувач може додати одне або декілька Заперечень, що висуваються Скаржником в рамках скарги (objections). Заперечення можуть бути додані або відредаговані, коли скарга знаходиться в статусі `draft`. Детальніше дивитися: :ref:`Заперечення до скарг <complaint-objections>`

source: This step is optional. Upload documents:
uk: Цей крок не обов'язковий.Завантажте документи:

source: Submit tender award complaint:
uk: І подамо скаргу на визначення переможця:

source: Complaint Posts
uk: Запит до скарги

source: Once complaint is in `pending` or `accepted` status reviewer can submit a post to complaint.
uk: Для скарги у статусах `pending` та `accepted` орган оскарження має можливість додати запит на уточнення до скарги.

source: Tender Conditions Complaint Posts (with complaint owner)
uk: Запит до скарги на умови закупівлі (до скаржника)

source: Reviewer can submit a post to complaint owner:
uk: Орган оскарження може надати запит до скаржника:

source: Complaint owner can submit a reply post to reviewer by setting reviewer's post `id` as `relatedPost`:
uk: Скаржник має можливість надати відповідь на запит органу оскарження передавши поле `id` запиту у полі `relatedPost`:

source: Tender Conditions Complaint Posts (with tender owner)
uk: Запит до скарги на умови закупівлі (до замовника)

source: Reviewer can submit a post to tender owner:
uk: Орган оскарження може надати запит до замовника:

source: Tender owner can submit a reply post to reviewer by setting reviewer's post `id` as `relatedPost`:
uk: Замовник має можливість надати відповідь на запит органу оскарження передавши поле `id` запиту у полі `relatedPost`:

source: Complaint Appeals
uk: Iнформація про оскарження скарги в суді

source: Once complaint is in `invalid`, `satisfied`, `declined` or `resolved` status tender owner or complaint author can submit an appeal for complaint.
uk: Для скарги у статусах `invalid`, `satisfied`, `declined` та `resolved` власник тендеру або автор скарги мають можливість додати інформацію про оскарження скарги в суді.

source: For more details, see :ref:`tender complaint appeals <complaint-appeals>`.
uk: Детальніше дивитися: :ref:`Iнформація про оскарження скарги в суді <complaint-appeals>`

source: Complaint Explanations
uk: Пояснення до скарги

source: An explanation of a complaint is a certain textual information and, if necessary, an attached file/files related to a certain complaint and can be used by the AMCU commission during its consideration. Explanations to the complaint are submitted by subjects on their own initiative, without a request from AMCU. AMCU will not respond to such explanations, but will only consider them.
uk: Пояснення до скарги - це певна текстова інформація та за потреби прикріплений файл/файли, що відносяться до певної скарги та можуть бути використані комісією АМКУ при її розгляді. Пояснення до скарги подаються суб'єктами з власної ініціативи, без запиту АМКУ. АМКУ не буде відповідати на такі пояснення, а лише розглядатиме їх.

source: Once complaint is in `pending` or `accepted` status complaint owner or tender owner can submit a post to complaint as explanation.
uk: Для скарги у статусах `pending` та `accepted` скаржник, що подав скаргу, або замовник закупівлі має можливість додати пояснення до скарги.

source: Explanations can be added no later than 3 working days before the date of review of the complaint (3 days before reviewDate)
uk: Пояснення можна додавати не пізніше ніж за 3 робочі дні до дати розгляду скарги (3 рд до reviewDate)

source: Each explanation must be related to one of the objections of the complaint (`complaints:objections`).
uk: Кожне пояснення обов'язково повинно відноситись до одного із пунктів скарги (`complaints:objections`).

source: Complaint owner or tender owner can submit an explanation via `posts`:
uk: Скаржник, що подав скаргу, або замовник закупівлі можуть додати пояснення до скарги за допомогою функціоналу `posts`:

source: The field `recipient` is forbidden for explanation post:
uk: Поле `recipient` заборонено для пояснень:

source: It is forbidden to answer an explanation can submit by setting explanation's post `id` as `relatedPost`:
uk: Заборонено надавати відповідь до пояснення, передавши поле `id` запиту у полі `relatedPost`:

source: Complaint Resolution
uk: Вирішення скарги

source: Rejecting Tender Award Complaint
uk: Відхилення скарги на визначення переможця

source: Accepting Tender Award Complaint
uk: Прийняття скарги на визначення переможця

source: Submitting Tender Award Complaint Resolution
uk: Подання рішення по скарзі на визначення переможця

source: The Complaint Review Body uploads the resolution document:
uk: Орган, що розглядає скарги, завантажує документ з рішенням:

source: And either resolves complaint:
uk: Яке або вирішує скаргу:

source: Or declines it:
uk: Або відхиляє:

source: Correcting problems
uk: Виправлення проблем

source: If tender award complaint was satisfied by the Complaint Review Body, then procuring entity has to correct problems.
uk: Якщо скарга на визначення переможця була задоволена органом оскарження, то замовник повинен виправити допущені порушення.

source: One of the possible solutions is award cancellation:
uk: Одним з можливих рішень є відміна результатів визначення переможця (`award`):

source: After award cancellation system generates new award. Its location is present in the `Location` header of response.
uk: При відміні результатів визначення переможця система генерує новий `award`. Шлях до нього передається в `Location` заголовку відповіді.

source: Submitting Resolution Confirmation
uk: Подання підтвердження вирішення скарги

source: When complaint has been successfully resolved, procuring entity submits resolution confirmation.
uk: Якщо скаргу вирішено і порушення усунуто, то замовник подає підтвердження вирішення.

source: Submitting complaint to new award
uk: Подання скарги на нове визначення переможця

source: Cancelling Tender Award Complaint
uk: Відміна скарги на визначення переможця

source: Cancelling draft complaint by Complainant
uk: Відміна чернетки скарги скаржником

source: Cancelling accepted complaint by Reviewer
uk: Відміна прийнятої скарги рецензентом

source: Complaints in Defense open tender
uk: Оскарження в Процедурі відкритих торгів для оборонних цілей

source: Complaint periods creation in Defense open tender differs from other procurement methods.
uk: Створення періодів оскарження в Процедурі відкритих торгів для оборонних цілей відрізняється від інших процедур.

source: In moment of award activation (status changes to `active`):
uk: В момент підтвердження визначення переможця (при зміні статусу аварда на `active`):

source: Complaint period is created for this award
uk: Для цього аварда буде створено період оскарження

source: Complaint periods are created/updated for awards with `unsuccessful` status (if lots - only for active lots)
uk: Періоди оскарження будет створено/оновлено для авардів в статусі `unsuccessful` (для лотових тендерів - лише для активних лотів)

source: Claims are denied in Defense open tender
uk: Вимогу на переможця в Процедурі відкритих торгів для оборонних цілей подати неможна

source: List awards after auction
uk: Список авардів після аукціону

source: We have tender on qualification stage with 3 bids and one pending award
uk: Ми маємо тендер на етапі кваліфікації з трьома пропозиціями (bids) та одним авардом в статусі `pending`

source: Disqualification of first bid award
uk: Дискваліфікація аварду для першої пропозиції

source: Tender owner patches first bid award from `pending` to `unsuccessful`. No complaint period for the award was created.
uk: Власник тендеру переводить авард для першої пропозиції зі статусу `pending` в `unsuccessful`. Період оскарження для аварду не створюється.

source: Activation of second bid award
uk: Підтвердження визначення переможця для другої пропозиції

source: Tender owner patches second bid award from `pending` to `active`. Complaint period for the second bid award was created.
uk: Власник тендеру переводить авард для другої пропозиції зі статусу `pending` в `active`. Період оскарження для аварду створюється.

source: Also Complaint period for the first (unsuccessful) bid award was created.
uk: Також створюється період оскарження для аварду (в статусі `unsuccessful`) для першої пропозиції.

source: Cancellation of second bid award
uk: Відміна аварду для другої пропозиції

source: Tender owner patches second bid award from `active` to `cancelled`. Complaint period for the award remains unchanged.
uk: Власник тендеру переводить авард для другої пропрозиції зі статусу `active` в `cancelled`. Період оскарження для аварду залишається незмінним.

source: Disqualification of second bid award
uk: Дискваліфікація аварду для другої пропозиції

source: Tender owner patches second bid award from `pending` to `unsuccessful`. No complaint period for the award was created.
uk: Власник тендеру переводить авард для другої пропозиції зі статусу `pending` в `unsuccessful`. Період оскарження для аварду не створюється.

source: Activation of third bid award
uk: Підтвердження визначення переможця для третьої пропозиції

source: One day time delay left. Tender owner patches third bid award from `pending` to `active`. Complaint period for the third bid award was created.
uk: Витримаємо один день затримки часу. Власник тендеру переводить авард для третьої пропозиції зі статусу `pending` в `active`. Період оскарження для аварду створюється.

source: Also complaint period for the first and second (unsuccessful) bid award was created/updated.
uk: Також оновлюється/створюється період оскарження для авардів (в статусі `unsuccessful`) для першої та другої пропозицій.
