Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/confidential-documents.po
Languages: uk

source: Confidential documents
uk: Конфіденційні документи

source: Confidential documents are supported for bids in the above threshold procedures.
uk: Конфіденційні документи підтримуються для пропозицій у понадпорогових процедурах.

source: Confidentiality
uk: Конфіденційність

source: Documents can be either public or private:
uk: Документи можуть бути публічними або приватними:

source: Privacy settings can be changed only for the latest version of the document.
uk: Приватність документа можна змінити тільки для останньої версії.

source: When you upload new version of the document, privacy settings are copied from the previous version.
uk: При завантаженні нової версії, налаштування приватності копіюються з попередньої версії документа.

source: Privacy settings can be changed only during `tenderPeriod` (with `active.tendering` status).
uk: Налаштування приватності можна міняти тільки під час періоду подання пропозицій (зі статусом active.tendering).

source: If tender has status `active.qualification` winner can upload only public documents.
uk: Якщо закупівля має статус active.qualification, переможець може завантажувати тільки публічні документи.

source: Tutorial
uk: Туторіал

source: Let's upload a private document
uk: Завантажимо приватний документ

source: `confidentiality` can be changed during `active.tendering` tender status
uk: “конфіденційність” може бути змінена під час періоду подання пропозицій

source: The confidential documents shown without the `url` field
uk: Конфіденційні документи показані без поля “url”

source: Only tender and bid owner should see the `url` fields and be able to download confidential documents
uk: Тільки власник тендерів та торгів повинен бачити поля ‘url’ та мати можливість завантажувати конфіденційні документи
