Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/contract-owner.po
Languages: uk

source: Providing contract owner
uk: Встановлення contract owner

source: For further contracting it is possible provide contract owner (SEDO).
uk: Для подальшого укладання договору в закупівлі можна встановити майданчики, з яких буде виконуватися робота з договором (СЕДО).

source: For buyer it should be set in one of fields along with `signerInfo`:
uk: Для замовника майданчик має бути вказаний в одному з об'єктів разом з `signerInfo`:

source: For supplier it should be set in `bid.tenderers` along with `signerInfo`.
uk: Для постачальника майданчик має бути вказаний в об'єкті `bid.tenderers` разом з `signerInfo`.

source: Field `contract_owner` can be set along with `contractTemplateName` in tender and `signerInfo` in object.
uk: Поле `contract_owner` може бути встановлене тільки разом з `contractTemplateName` в закупівлі і `signerInfo` для цього ж об'єкта.

source: If there is no `signerInfo` in object or there is no `contractTemplateName` in tender, we will see an error:
uk: Якщо в об'єкті не вказано `signerInfo` чи нема `contractTemplateName` в закупівлі, ми побачимо помилку:

source: In field `contract_owner` it is allowed to set one of the brokers which has the 6th level of accreditation.
uk: В полі `contract_owner` дозволено вказувати один з майданчиків, який має 6 рівень акредитації.

source: In future contract they will have opportunity to generate token and deal with contract based on their role (`supplier` or `buyer`).
uk: В майбутньому контракті тільки ці майданчики будуть мати змогу згенерувати токен і працювати з контрактом в залежності від ролі (`supplier` чи `buyer`).

source: If broker which set as a `contract_owner` doesn't have the 6th level of accreditation, we will see an error:
uk: Якщо майданчик, вказаний як `contract_owner`, не має 6 рівня акреддитації, то ми побачимо помилку:

source: Successful adding `contract_owner` along with `contractTemplateName` in tender and `signerInfo` in `procuringEntity`:
uk: Успішне додавання `contract_owner` разом з `contractTemplateName` в закупівлі і `signerInfo` для замовника в `procuringEntity`:

source: Successful adding `contract_owner` along with `contractTemplateName` in tender and `signerInfo` in `bid.tenderers`:
uk: Успішне додавання `contract_owner` разом з `contractTemplateName` в закупівлі і `signerInfo` для постачальника в `bid.tenderers`::

source: When contract is created, these brokers can generate token to deal with contract (read more :ref:`authorization-from-different-platforms-new`).
uk: Після створення контракту ці майданчики можуть згенерувати токен для подальшої роботи з договором (більш детально :ref:`authorization-from-different-platforms-new`).

source: Let's look at contract, after creation, we will see `contract_owner` in `buyer` and `suppliers` objects:
uk: Подивимося як виглядає договір, в ньому є `contract_owner` в об'єктах `buyer` and `suppliers`:
