Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/questions.po
Languages: uk

source: Asking Questions
uk: Звернення до замовника

source: Submitting Questions
uk: Як подати звернення

source: Anybody (who provides their identity) can ask questions:
uk: Будь-хто (але не анонімно) може подати звернення:

source: Retrieving Questions
uk: Як прочитати звернення

source: All appeals for clarifications and appeals for the elimination of violations are automatically published in the electronic procurement system without identification of the person who addressed the customer.
uk: Усі звернення за роз’ясненнями та звернення щодо усунення порушення автоматично оприлюднюються в електронній системі закупівель без ідентифікації особи, яка звернулася до замовника.

source: Author of question will be hashed with his `identifier.id` plus `access token` of the procedure. This gives us a possibility to determine that at the tender level a certain number of questions came from the same author.
uk: Інформація про автора звернення буде захешована, використовуючи його ЕДРПОУ та `access token` тендеру. Це робиться для того, щоб можна було визначити, що на рівні тендеру певна кількість питань надходить від одного й того ж автора.

source: Let's look at asked question:
uk: Подивимося, як виглядає звернення:

source: Answering
uk: Відповіді від замовника

source: Submitting Answers
uk: Як надати відповідь

source: Tender creator can answer questions:
uk: Замовник закупівлі може відповісти на звернення:
