Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/sign-data.po
Languages: uk

source: Additional sign data
uk: Відображення інформації для підписів

source: In the context of creating e-protocols, there was a need to impose a signature not only an object (an award or bid), but to have many general fields from the tender in the signature for the correct display of information.
uk: В розрізі задачі по створенню е-протоколів, з'явилась необходність накладати підпис не тільки на об'єкт, який підписується (авард або бід), а мати в підписі загальні поля з тендеру для коректного відображення інформації.

source: For these purposes, it is agreed to proceed by adding boolean query parameter `opt_context` for endpoints for each necessary option (award, bid, cancellation, etc).
uk: Для цього було узгоджено йти шляхом додаввання булевого query-параметру `opt_context` під кожний необхідний варіант (award, bid, cancellation, і т.д.).

source: Parameter `opt_fields` can have such options:
uk: Параметр `opt_context` може мати такі значення:

source: `true`, `1`, `True` - show additional context
uk: `true`, `1`, `True` - відображає додаткові поля

source: another values or missing parameter - don't show context
uk: інші значення або якщо не передати параметр - не відображає додаткові поля

source: Use `opt_context=true` as parameter for getting additional information for signing award:
uk: Необхідно вказати параметр `opt_context=true` для того, щоб отримати додаткову інформацію з тендера для підписання аварда:

source: As we can see there is additional field `context`, which has information from `tender` inside.
uk: Як ми можемо побачити, з'явилося додаткове поле `context`, в якому наявна інформація з тендеру.

source: Use `opt_context=true` as parameter for getting additional information for signing qualification:
uk: Необхідно вказати параметр `opt_context=true` для того, щоб отримати додаткову інформацію з тендера для підписання пре-кваліфікації:

source: Use `opt_context=true` as parameter for getting additional information for signing bid:
uk: Необхідно вказати параметр `opt_context=true` для того, щоб отримати додаткову інформацію з тендера для підписання пропозиції:

source: If tender now in `active.tendering` status, only bidder can see this information. If someone else wants to see sign data for bid, he will see an error:
uk: Якщо тендер знаходиться в статусі `active.tendering`, тільки постачальник може бачити цю інформацію. Якщо хтось інший намагатиметься подивитися додаткову інформацію до пропозиції, він побачить помилку:

source: Use `opt_context=true` as parameter for getting additional information for signing cancellation:
uk: Необхідно вказати параметр `opt_context=true` для того, щоб отримати додаткову інформацію з тендера для підписання відміни:
