Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/basic-actions/stand-still-to-pre-qualification.po
Languages: uk

source: Repeat of the preliminary qualification
uk: Повторне проведення попередньої кваліфікації

source: There are two ways to return a tender to the preliminary qualification stage:
uk: Існує два способи повернення тендера на етап попередньої кваліфікації:

source: Patching the tender status from active.pre-qualification.stand-still to active.pre-qualification.
uk: Зміна статусу тендера з `active.pre-qualification.stand-still` на `active.pre-qualification`.

source: Resolve the complaint.
uk: Вирішення скарги.

source: Before proceeding to the description of the steps, let’s ensure that the tender is in the active.pre-qualification.stand-still status:
uk: Перед тим як перейти до опису кроків, переконаймося, що тендер знаходиться у статусі `active.pre-qualification.stand-still`:

source: 1-st Way: Update Tender Status
uk: Перший спосіб: Оновлення статусу тендера

source: If you want to return to the preliminary qualification stage by updating the tender status through a PATCH request, you must ensure that there are no complaints with the statuses `draft`, `pending`, or `accepted` on the qualification object.
uk: Якщо ви хочете повернутись до етапу попередньої кваліфікації через оновлення статусу тендера за допомогою PATCH-запиту, необхідно переконатися, що немає скарг у статусах `draft`, `pending` або `accepted` на обʼєкті кваліфікації.

source: For example you have two complaints in `draft` and `pending` statuses:
uk: Наприклад, у вас є дві скарги у статусах `draft` і `pending`:

source: If you try to patch tender to `active.pre-qualification.stand-still` status, you'll get error:
uk: Якщо ви спробуєте оновити статус тендера на `active.pre-qualification.stand-still`, ви отримаєте помилку:

source: After changing 1-st to complaint to `mistaken` status and 2-nd status:
uk: Після зміни статусу першої скарги на `mistaken` і другої скарги на `invalid`:

source: You can successfully return to previous stage:
uk: Ви зможете успішно повернутись до попередньої кваліфікації.

source: 2-nd Way: Resolve Complaint
uk: Другий спосіб: Вирішення скарги

source: You can resolve existing complaint(complaint resolving process you can see in :ref:`qualification-complaint-resolution`):
uk: Ви можете вирішити наявну скаргу (процес вирішення скарги описано у :ref:`qualification-complaint-resolution`):

source: And system automatically switch tender to preliminary qualification stage:
uk: І система автоматично переведе тендер на етап попередньої кваліфікації.
