Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/cfaua/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Exploring basic rules
uk: Розгляньмо основні правила

source: Let's try exploring the `/tenders` endpoint:
uk: Подивімось, як працює точка входу `/tenders`:

source: Just invoking it reveals empty set.
uk: Командою виклику отримуємо пустий набір.

source: Now let's attempt creating some tender:
uk: Спробуймо створити нову тендерну пропозицію:

source: Error states that the only accepted Content-Type is `application/json`.
uk: Помилка вказує, що єдиний прийнятний тип вмісту це `application/json`.

source: Let's satisfy the Content-type requirement:
uk: Треба задовольнити вимоги щодо типу вмісту:

source: Error states that no `data` has been found in JSON body.
uk: Помилка вказує, що `data` не знайдено у тілі JSON.

source: Creating tender
uk: Створення тендера

source: Let's create tender with the minimal (only required) data set:
uk: Створімо тендерну пропозицію з мінімальним (обов'язковим для внесення) набором даних:

source: Success! Now we can see that new object was created. Response code is `201` and `Location` response header reports the location of the created object. The body of response reveals the information about the created tender: its internal `id` (that matches the `Location` segment), its official `tenderID` and `dateModified` datestamp stating the moment in time when tender was last modified. Pay attention to the `procurementMethodType`. Note that tender is created with `active.enquiries` status.
uk: Вийшло! Тепер бачимо, що створено новий об'єкт. Код відповіді - `201` а заголовок відповіді `Location` вказує на місцезнаходження створеного об'єкта. Тіло відповіді показує інформацію про створену тендерну пропозицію: її внутрішнє `id` (що співпадає з сегментом `Location`), її офіційне `tenderID` та мітку дати `dateModified`, що вказує час, коли до тендерної пропозиції востаннє вносились зміни. Зверніть увагу на `procurementMethodType`. Важливо, що тендерна пропозиція створюється зі статусом `active.enquiries`.

source: Let's access the URL of the created object (the `Location` header of the response):
uk: Використаємо URL створеного об'єкта (заголовок відповіді `Location`):

source: The peculiarity of the Close FrameworkAgreement UA procedure is that ``procurementMethodType`` was changed from ``belowThreshold`` to ``closeFrameworkAgreementUA``. Also there is no opportunity to set up ``enquiryPeriod``, it will be assigned automatically.
uk: Особливість процедури Закритої Рамкової Угоди UA полягає в тому, що ``procurementMethodType`` було змінено з ``belowThreshold`` на ``closeFrameworkAgreementUA``. Також тут немає можливості встановити ``enquiryPeriod``, оскільки він призначається автоматично.

source: We can see the same response we got after creating tender.
uk: Ми бачимо ту ж відповідь, що і після створення закупівлі.

source: Let's see what listing of tenders reveals us:
uk: Подивимось, що показує список закупівель:

source: We do see the internal `id` of a tender (that can be used to construct full URL by prepending `http://api-sandbox.openprocurement.org/api/0/tenders/`) and its `dateModified` datestamp.
uk: Ми бачимо внутрішнє `id` тендерної пропозиції (що можна використати для побудови повної URL-адреси коли додамо `http://api-sandbox.openprocurement.org/api/0/tenders/`) та її мітку дати `dateModified`.

source: You can add additional :ref:`ContactPoint` and set several :ref:`Item`. Also you can create tender with :ref:`Feature` (`https://prozorro-api-docs.readthedocs.io/uk/frameworkagreement/basic-actions/meat.html?highlight=features#announcing-meat`).
uk: Ви можете додати додаткову :ref:`ContactPoint` і декілька :ref:`Item`. Також можна створити закупівлю з :ref:`Feature` (`https://prozorro-api-docs.readthedocs.io/uk/frameworkagreement/basic-actions/meat.html?highlight=features#announcing-meat`).

source: Modifying tender
uk: Внесення змін до тендера

source: Let's update tender by supplementing it with all other essential properties:
uk: Оновимо тендерну пропозицію, додаючи інші важливі властивості:

source: We see the added properies have merged with existing tender data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Бачимо, що додані властивості об'єдналися з наявними даними щодо тенденої пропозиції. Також оновилась властивість `dateModified` і тепер відображає мітку дати останнього внесення змін.

source: Checking the listing again reflects the new modification date:
uk: Знову перевіряємо список і бачимо нову дату внесення змін:

source: Procuring entity can set bid guarantee:
uk: Замовник може встановити тендерну гарантію:

source: You can modify the following fields on this step: ``agreementDuration``, :ref:`item`, ``maxAwardsCount``, :ref:`ProcuringEntity`, ``tenderPeriod``, ``title``, ``title_ru``, ``title_en``, ``description``, ``description_ru``, ``description_en``, ``eligibilityCriteria``, ``procurementMethodRationale``, ``guarantee``, :ref:`feature`, :ref:`document`, :ref:`lot`.
uk: На цьому етапі можна змінювати наступні поля: ``agreementDuration``, :ref:`item`, ``maxAwardsCount``, :ref:`ProcuringEntity`, ``tenderPeriod``, ``title``, ``title_ru``, ``title_en``, ``description``, ``description_ru``, ``description_en``, ``eligibilityCriteria``, ``procurementMethodRationale``, ``guarantee``, :ref:`feature`, :ref:`document`, :ref:`lot`.

source: Uploading documentation
uk: Завантаження документації

source: Procuring entity can upload PDF files into the created tender. Uploading should follow the :ref:`upload` rules.
uk: Замовник може завантажити PDF файли у створену тендерну пропозицію. Завантаження має відбуватись згідно з правилами :ref:`upload`.

source: `201 Created` response code and `Location` header confirm document creation. We can additionally query the `documents` collection API endpoint to confirm the action:
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ створено. Можна додатково здійснити запит точки входу API колекції `documents`, щоб підтвердити дію:

source: The single array element describes the uploaded document. We can upload more documents:
uk: Єдиний елемент масиву описує завантажений документ. Можна завантажити більше документів:

source: And again we can confirm that there are two documents uploaded.
uk: Знову можна підтвердити, що завантажено два документа.

source: In case we made an error, we can reupload the document over the older version:
uk: Якщо сталася помилка, ми можемо ще раз завантажити документ поверх старої версії:

source: And we can see that it is overriding the original version:
uk: І бачимо, що він замінив початкову версію документа:

source: Enquiries
uk: Запитання

source: When tender has ``active.tendering`` status and ``Tender.enqueryPeriod.endDate`` hasn't come yet, interested parties can ask questions:
uk: Поки тендерна пропозиція має статус ``active.tendering``, а момент ``Tender.enqueryPeriod.endDate`` ще не настав, зацікавлені сторони можуть ставити запитання:

source: Procuring entity can answer them:
uk: Замовник може на них відповідати:

source: And one can retrieve the questions list:
uk: Можна отримати список запитань:

source: And individual answer:
uk: Та окрему відповідь:

source: Enquiries can be made only during ``Tender.enqueryPeriod``
uk: Запитання можна задавати лише під час ``Tender.enqueryPeriod``

source: Registering bid
uk: Реєстрація цінової заявки

source: Step-by-step registration
uk: Покрокова реєстрація

source: Tender status ``active.tendering`` allows registration of bids.
uk: Коли тендерна пропозиція перебуває в статусі ``active.tendering``, можна реєструвати цінові заявки.

source: Bidder can register a bid in `draft` status:
uk: Учасник може зареєструвати заявку зі статусом `draft`:

source: And activate a bid:
uk: Та активувати заявку:

source: Bidder can also submit bid with non-price criteria - :ref:`parameter` (`https://prozorro-api-docs.readthedocs.io/uk/frameworkagreement/basic-actions/meat.html?highlight=features#bidding-in-meat`).
uk: Також учасник може подати ставку з неціновими критеріями - :ref:`parameter` (`https://prozorro-api-docs.readthedocs.io/uk/frameworkagreement/basic-actions/meat.html?highlight=features#bidding-in-meat`).

source: Proposal Uploading
uk: Завантаження документу пропозиції

source: Then bidder should upload proposal technical document(s):
uk: Учасник повинен завантажити технічний(і) документ(и) пропозиції:

source: Confidentiality
uk: Конфіденційність

source: Documents can be either public or private:
uk: Документи можуть мати як публічний, так і приватний доступ:

source: Privacy settings can be changed only for the latest version of the document.
uk: Налаштування приватності можна змінити лише для останньої версії документу.

source: When you upload new version of the document, privacy settings are copied from the previous version.
uk: Коли ви завантажуєте нову версію документу, налаштування приватності дублюються з попередньої версії.

source: Privacy settings can be changed only during `tenderPeriod` (with `active.tendering` status).
uk: Налаштування приватності можна змінити лише під час `tenderPeriod` (у статусі `active.tendering`).

source: If tender has status `active.qualification` winner can upload only public documents.
uk: Якщо тендерна пропозиція має статус `active.qualification`, то переможець може завантажити лише документи з публічним доступом.

source: Let's upload private document:
uk: Спробуймо завантажити документ з приватним доступом:

source: To define the document as "private" - `confidentiality` and `confidentialityRationale` fields should be set.
uk: Щоб документ визначався як "private", потрібно налаштувати поля `confidentiality` та `confidentialityRationale`.

source: `confidentiality` field value can be either `buyerOnly` (document is private) or `public` (document is publicly accessible).
uk: Значення поля `confidentiality` може бути `buyerOnly` (документ лише з приватним доступом) або `public` (документ з публічним доступом).

source: Content of private documents (`buyerOnly`) can be accessed only by procuring entity or by participant who uploaded them.
uk: Вміст приватних документів (`buyerOnly`) може бути доступним лише для замовника чи учасника, який їх завантажив.

source: `confidentialityRationale` field is required only for private documents and should contain at least 30 characters.
uk: Поле `confidentialityRationale` є обов'язковим до заповнення лише для приватних документів і повинне містити щонайменше 30 символів.

source: Let's mark the document as "private":
uk: Позначмо документ як "private":

source: It is possible to check the uploaded documents:
uk: Є можливість перевірити завантажені документи:

source: Financial, eligibility and qualification documents uploading
uk: Завантаження документів, що стосуються вартості, терміну дії та кваліфікації

source: Financial, eligibility and qualification documents are also a part of Bid but are located in different end-points.
uk: Документи, що стосуються вартості і терміну дії угоди та підтвердження кваліфікації також є частиною Заявки але знаходяться в інших точках входу.

source: In order to create and/or get financial document ``financial_documents`` end-point should be used:
uk: Щоб створити і/або отримати документ щодо вартості угоди, потрібно використати точку входу ``financial_documents``:

source: Get financial documents:
uk: Отримуємо документи щодо вартості:

source: In order to create and/or get eligibility document ``eligibility_documents`` end-point should be used:
uk: Щоб створити і/або отримати документ щодо терміну дії угоди, потрібно використати точку входу ``eligibility_documents``:

source: In order to create and/or get qualification document ``qualification_documents`` end-point should be used:
uk: Щоб створити і/або отримати документ щодо підтвердження кваліфікації, потрібно використати точку входу ``qualification_documents``:

source: `Financial` and `qualification` documents will be publicly accessible after the auction. `Eligibility` documents will become publicly accessible starting from tender pre-qualification period.
uk: Документація `Financial`та `qualification` стане загальнодоступною після закінчення аукціону. Документація щодо `Eligibility` стане загальнодоступною з початком прекваліфікаційного періоду.

source: Here is bidder proposal with all documents.
uk: Тут бачимо пропозицію учасника з усіма документами.

source: Note that financial, eligibility, and qualification documents are stored in `financialDocuments`, `eligibilityDocuments`, and `qualificationDocuments` attributes of :ref:`Bid`.
uk: Зверніть увагу, що документи, що стосуються вартості і терміну дії угоди та підтвердження кваліфікації зберігаються в атрибутах :ref:`Bid`.

source: Bid invalidation
uk: Скасування заявки

source: If tender is modified, status of all bid proposals will be changed to ``invalid``. Bid proposal will look the following way after tender has been modified:
uk: Якщо до тендерної пропозиції вносяться зміни, то статуси усіх цінових заявок зміниться на ``invalid``. Так виглядатиме заявка учасника торгів після внесення змін до тендерної пропозиції:

source: Bid confirmation
uk: Підтвердження заявки

source: Bidder should confirm bid proposal:
uk: Учасник має підтвердити подану пропозицію:

source: Bidder can change his bid after activating it. He can change value:amount (:ref:`value`). Also he can update :ref:`parameter`, subContractors, :ref:`document`.
uk: Учасник може змінити свою пропозицію, після її активації. Для цього він змінює value:amount (:ref:`value`). Також можливо модифікувати :ref:`parameter`, subContractors, :ref:`document`.

source: Close FrameworkAgreement UA procedure demands at least three bidders, so there should be at least three bid proposals registered to move to auction stage:
uk: Процедура Закритої Рамкової Угоди UA вимагає щонайменше трьох учасників торгів, тож має бути зареєстровано щонайменше три цінові заявки, щоб перейти до етапу аукціону:

source: Batch-mode registration
uk: Пакетний режим реєстрації

source: Register bid with documents using one request:
uk: Можна зареєструвати заявку з документами одним запитом:

source: Bid Qualification
uk: Кваліфікація заявок

source: Close FrameworkAgreement UA procedure requires bid qualification.
uk: Процедура Закритої Рамкової Угоди UA вимагає кваліфікації заявок.

source: Let's list qualifications:
uk: Складемо список кваліфікаційних вимог:

source: Approve three bids through qualification objects:
uk: Схвалюємо три заявки з допомогою об'єктів кваліфікації:

source: We can also reject bid:
uk: Також можна відхилити заявку:

source: To reject bid, Procuring entity should specify reason of rejection in ``description`` field.
uk: Для того, щоб відхилити пропозицію, Замовник має вказати причину відхилення в полі ``description``.

source: And check that qualified bids are switched to `active`:
uk: І перевірити чи заявки, що пройшли кваліфікацію, переведені в статус `active`:

source: Rejected bid is not shown in `bids/` listing.
uk: Відхилена заявка не відображається у списку `bids/`.

source: We can access rejected bid by id:
uk: Можемо знайти відхилену заявку за її id:

source: Procuring entity approves qualifications by switching to next status:
uk: Замовник схвалює кваліфікацію заявок, перейшовши в наступний статус:

source: Procuring entity may change ``status`` of Bid on opposite during `active.prequalification`.
uk: Замовник може змінити ``status`` пропозиції на протилежний під час `active.prequalification`.

source: You may notice 10 day stand-still time set in `qualificationPeriod`.
uk: Зверніть увагу, що термін простою `qualificationPeriod` встановлюється на 10 днів.

source: Auction
uk: Аукціон

source: After auction is scheduled anybody can visit it to watch. The auction can be reached at `Tender.lot.auctionUrl`:
uk: Коли оголошується час проведення аукціону, будь-хто може подивитись, як він проходить. На аукціон можна зайти за адресою `Tender.lot.auctionUrl`:

source: And bidders can find out their participation URLs via their bids:
uk: Учасники торгів можуть отримати свої URL для доступу на аукціон через свої заявки :

source: See the `Bid.lotValues.participationUrl` in the response. Similar, but different, URL can be retrieved for other participants:
uk: `Bid.lotValues.participationUrl` має з'явитись у відповіді. Подібні але інші URL можна витягнути й для решти учасників:

source: Confirming qualification
uk: Підтвердження кваліфікації

source: Qualification board receives the qualifications list
uk: Кваліфікаційна комісія отримує список претендентів до кваліфікації

source: And registers its decisions via the following call `per award`:
uk: І реєструє своє рішення через такий виклик на кожного `award`:

source: The board may cancel the award winner by calling ``{'data': {'status': 'cancelled'}}``
uk: Комісія також може дискваліфікувати переможця викликом ``{'data': {'status': 'cancelled'}}``

source: We can see new `pending` award is generated for the same bidder.
uk: Бачимо, що згенеровано новий award в статусі `pending` для цього ж учасника.

source: Now we can patch `pending` award to `unsuccessful`.
uk: Тепер можна патчити award зі статусу `pending` в `unsuccessful`.

source: In case of transferring award from ``unsuccessful`` to ``cancelled``, tender moves to the beginning of ``active.qualification`` status, all of the awards become ``cancelled`` and new :ref:`award` objects are creating.
uk: У випадку переведення award з ``unsuccessful`` в ``cancelled``, тендер переходить на початок статусу ``active.qualification``, всі об'єкти :ref:`award` стають ``cancelled`` і генеруються нові об'єкти.

source: So we patch `unsuccessful` award to `cancelled`.
uk: Тепер можна патчити award зі статусу `pending` в `unsuccessful`.

source: New `pending` award is generated for each bidder.
uk: Нові award в статусі `pending` генеруються для кожного учасника.

source: Finally we confirm all `pending` awards via the following call:
uk: Нарешті ми підтверджуємо всі award в статусі `pending`:

source: Procuring entity may specify reasons of Bidder disqualification in the ``description`` field.
uk: Замовник має вказати причину дискваліфікації Учасника в полі ``description``.

source: Procuring entity may continue consideration of decision for some :ref:`award` if it is needed. Procuring entity should upload a document for that.
uk: Замовник може продовжити процес кваліфікації :ref:`award`, якщо це необхідно. Замовник має завантажити документи про це.

source: Completion of qualification is transfer procedure into `active.qualification.stand-still` status.
uk: Завершенням кваліфікаї є переведення процедури в статус `active.qualification.stand-still`.

source: Uploading document with unit price per item
uk: Завантаження документу з переліком цін за одиницю товару

source: When tender transfers to status `active.awarded` then :ref:`Agreement` is created and the awarded participants are given 5 business days to upload the itemized price list with unit price per every 'item'
uk: Коли тендерна пропозиція переходить в статус `active.awarded`, створюється :ref:`Agreement`, і переможцям аукціону надається п'ять робочих днів на завантаження переліку цін за одиницю кожного предмету закупівлі.

source: Entering prices per item by the ordering party
uk: Внесення цін за предмет закупівлі стороною замовника

source: The object list :ref:`Agreement` can be obtained via the following call
uk: Список об'єктів :ref:`Agreement` можна отримати з допомогою цього виклику

source: Only one contract is created per each qualified award winner
uk: Лише один контракт створюється на одного переможця аукціону, що пройшов кваліфікацію

source: The object list :ref:`Contract` to enter prices per item can be obtained by the ordering party via the following call
uk: Сторона замовника може отримати список об'єктів :ref:`Contract` для внесення цін за предмет закупівлі з допомогою такого виклику

source: Entering unit prices is allowed only for all 'items' taken together
uk: Внесення цін за одиницю товару можливе лише для всіх предметів закупівлі 'items' разом

source: Also the ordering party is allowed to exclude a winner from the framework agreement by setting the contract to ``{'data': {'status': 'unsuccessful'}}``
uk: Також стороні замовника дозволено виключити переможця з рамкової угоди, перевівши контракт в статус ``{'data': {'status': 'unsuccessful'}}``

source: For a successful signing of a Framework agreement not less than 3 active contracts are needed
uk: Для успішного підписання Рамкової угоди необхідно щонайменше 3 активних контракта

source: A Framework agreement can be signed only when `agreement.contractPeriod.clarificationsUntil` is reached
uk: Рамкову угоду можна підписати лише з настанням моменту `agreement.contractPeriod.clarificationsUntil`

source: Procuring entity may fill the information about ``agreementNumber``.
uk: Замовник може заповнити інформацію про ``agreementNumber``.

source: Uploading agreement documentation
uk: Завантаження документації щодо угоди

source: You can upload agreement documents. Let's upload agreement document:
uk: Тепер можна завантажити документацію, що стосується угоди. Спробуймо завантажити документ, що стосується угоди:

source: `201 Created` response code and `Location` header confirm that this document was added.
uk: Код відповіді `201 Created` і заголовок `Location` підтверджують, що цей документ було додано.

source: Let's see the list of agreement documents:
uk: Перегляньмо список документів стосовно угоди:

source: We can add another agreement document:
uk: Можемо додати ще один документ стосовно угоди:

source: `201 Created` response code and `Location` header confirm that the second document was uploaded.
uk: Код відповіді `201 Created` і заголовок `Location` підтверджують, що другий документ також було додано.

source: By default, document language is Ukrainian. You can can change it and set another language for the document by assigning appropriate language code to the `language` field (available options: ``uk``, ``en``, ``ru``). You can also set document's title (e.g. `title_en`) and description (e.g. `description_en`) fields. See :ref:`Document` data structure for details.
uk: За замовчуванням, мова документації - українська. Це можна змінити і встановити іншу мову для документу, встановивши відповідний мовнй код в полі `language` (доступні варіанти: ``uk``, ``en``, ``ru``). Можна також встановити поля назви документа (наприклад, `title_en`) та його опису (наприклад, `description_en`). Детальніше в структурі даних :ref:`Document`.

source: Let's see the list of all added agreement documents:
uk: Перегляньмо список усіх доданих документів стосовно угоди:

source: Let's view separate contract document:
uk: Подивімося на окремий документ щодо угоди:

source: Set agreement signature date
uk: Встановлення дати підписання угоди

source: There is a possibility to set custom agreement signature date. If the date is not set it will be generated on agreement registration.
uk: Є можливість встановити потрібну дату підписання угоди. Якщо дата не встановлена, то вона буде згенерована під час реєстрації угоди.

source: Agreement registration
uk: Реєстрація угоди

source: Cancelling tender
uk: Скасування тендера

source: Tender creator can cancel tender anytime (except when tender has terminal status e.g. `unsuccessful`, `canceled`, `complete`).
uk: Замовник може скасувати тендерну пропозицію у будь-який момент (окрім випадків, коли тендерна пропозиція має кінцевий статус, наприклад `usuccesfull`, `canceled`, `complete`).

source: The following steps should be applied:
uk: Для цього потрібно виконати такі кроки:

source: Prepare cancellation request
uk: Приготуйте запит на скасування
