Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/cfaua/tutorial.po
Languages: uk

source: Fill it with the protocol describing the cancellation reasons
uk: Наповніть його протоколом про причини скасування

source: Cancel the tender with the reasons prepared.
uk: Скасуйте тендерну пропозицію через подані причини.

source: Only the request that has been activated (3rd step above) has power to cancel tender. I.e. you have to not only prepare cancellation request but to activate it as well.
uk: Тендерну пропозицію можна скасувати лише тим запитом, що пройшов активацію (3 крок вище). Тобто, потрібно не просто створити запит на скасування,а й активувати його.

source: See :ref:`cancellation` data structure for details.
uk: Детальніше в структурі запиту :ref:`cancellation`.

source: Preparing the cancellation request
uk: Формування запиту на скасування

source: You should pass `reason`, `status` defaults to `pending`. `id` is autogenerated and passed in the `Location` header of response.
uk: Потрібно перевести змінні `reason`, `status` в стан `pending`. `id` генерується автоматично і передається у заголовку відповіді `Location`.

source: Filling cancellation with protocol and supplementary documentation
uk: Наповнення запиту на скасування протоколом та супровідною документацією

source: Upload the file contents
uk: Завантажуємо вміст файлу

source: Change the document description and other properties
uk: Змінюємо опис документу та інші властивості

source: Upload new version of the document
uk: Завантажуємо нову версію документа

source: Activating the request and cancelling tender
uk: Активуємо запит і скасовуємо тендерну пропозицію

source: Transfer agreement to `unsuccessful`
uk: Переведення угоди в статус `unsuccessful`

source: Procuring entity can patch `agreement` to `unsuccessful`.
uk: Замовник може змінити статус угоди на `unsuccessful`.

source: This will transfer `tender` to `unsuccessful` status.
uk: Переведення тендера в статус `unsuccessful`.
