Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/frameworks/ifi/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Framework creation
uk: Створення кваліфікації

source: Let’s create a framework:
uk: Створимо кваліфікацію:

source: We have `201 Created` response code, `Location` header and body with extra properties.
uk: Ми отримали код відповіді `201 Created`, заголовок `Location` і тіло з додатковими полями.

source: Framework was created in `draft` status. In this status any field, except technical, can be changed using PATCH method.
uk: Кваліфікацію було створено у статусі `draft`. У цьому статусі будь-яке поле, окрім технічних, може бути змінено.

source: Uploading documentation
uk: Завантаження документації

source: Procuring entity can upload files into the created framework. Uploading should follow the :ref:`upload` rules.
uk: Замовник може завантажити PDF файл у створениу кваліфікацію. Завантаження повинно відбуватись згідно правил :ref:`upload`.

source: `201 Created` response code and `Location` header confirm document creation. We can additionally query the `documents` collection API endpoint to confirm the action:
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ було створено. Додатково можна зробити запит точки входу API колекції документів, щоб підтвердити дію:

source: And again we can confirm that there are two documents uploaded.
uk: І знову можна перевірити, що є два завантажених документа.

source: In case we made an error, we can reupload the document over the older version:
uk: Якщо сталась помилка, ми можемо ще раз завантажити документ поверх старої версії:

source: And we can see that it is overriding the original version:
uk: І ми бачимо, що вона перекриває оригінальну версію:

source: Framework activation
uk: Активація кваліфікації

source: The second step is moving the framework to `active` status.
uk: Наступний крок - змінити статус кваліфікації на `active`.

source: `qualificationPeriod.endDate` should be in between 365 and 1461 days from activation moment.
uk: `qualificationPeriod.endDate` має бути у проміжку не менш ніж 365 днів і не більш ніж 1461 днів з моменту активації.

source: There should be at least 1 document in addition to sign document.
uk: Перед активацією до кваліфікації має бути додано хоча б один документ та підпис.

source: After framework activation frameworks periods was calculated:
uk: Після активації кваліфікації будуть розраховані періоди:

source: `enquiryPeriod` - first 10 full working days after activation.
uk: `enquiryPeriod` - перші 10 повних робочих днів з моменту активації.

source: `period` - period when suppliers can add submissions.
uk: `period` - період, коли постачальники можуть подавати заявки.

source: `qualificationPeriod` - last 30 full calendar days of framework when suppliers cannot add submissions but still can be qualified based on previous submissions.
uk: `qualificationPeriod` - останні 30 повних календарних днів кваліфікації. У цей період постачальники не можуть подавати нові заявки, але ще приймаються рішення щодо попередньо поданих заявок.

source: Let's check what framework registry contains:
uk: Перевіримо, що містить реєстр кваліфікації:

source: We do see the internal `id` of a framework and its `dateModified` datestamp.
uk: Відображається `id` - внутрішній ідентифікатор та мітка часу `dateModified`.

source: Modifying framework
uk: Зміна кваліфікації

source: In `active` status only some fields can be changed: `telephone`, `name`, `email` for `procuringEntity.contactPoint`, `description` and `documents`.
uk: У статусі `active` можна змінювати лише деякі поля: `telephone`, `name`, `email` для `procuringEntity.contactPoint`, `description` and `documents`.

source: Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Додатково оновлена властивість `dateModified`, щоб відображати останню дату модифікації.

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Modifying qualificationPeriod in active framework
uk: Зміна qualificationPeriod в активному відборі

source: Also in `active` status can be changed `endDate` for `qualificationPeriod` but it can dbe done only using another endpoint.
uk: Також у статусі `active` можна замінити `endDate` поле в `qualificationPeriod`, але це можна зробити вже через окремий ендпоінт.

source: There are validations for changing `qualificationPeriod.endDate`:
uk: Існують наступні валідації для зміни терміну дії відбору `qualificationPeriod.endDate`:

source: It is allowed to modify `qualificationPeriod` only by framework owner.
uk: Зміну терміну дії відбору може виконувати лише `framework_owner` (власник кваліфікації).

source: Fields for modifying period:
uk: Поля, які необхідно заповнити для зміни терміну дії відбору:

source: Let's try to change `qualificationPeriod.endDate` with soon date:
uk: Спробуємо змінити `qualificationPeriod.endDate` на ранню дату:

source: Let's try to prolong `qualificationPeriod.endDate` with late date:
uk: Спробуємо змінити `qualificationPeriod.endDate` на пізню дату:

source: Success changing of `qualificationPeriod`:
uk: Успішна зміна терміну дії відбору:

source: If `qualificationPeriod.endDate` was changed all periods will be recalculated.
uk: Якщо було змінено поле `qualificationPeriod.endDate` - всі періоди будуть перераховані.

source: Let's look at framework:
uk: Подивимося тепер на відбір:

source: There is a new object `periodChangeHistory` in framework with previous `qualificationPeriod.endDate` and new one. All period changes will be saved in this object.
uk: Тепер у відборі існує новий об'єкт `periodChangeHistory` з попереднім значенням `qualificationPeriod.endDate` і новим значенням. Всі зміни терміну дії відбору будуть збережені в цьому об'єкті.

source: Registering submission
uk: Реєстрація заявки

source: After activating framework, users can register their submissions in period from `framework.period.startDate` to `framework.period.endDate`:
uk: Після активації кваліфікації, користувачі можуть зареєструвати свої заявки в період з `framework.period.startDate` до `framework.period.endDate`:

source: Uploading Submission documentation
uk: Завантаження документації по заявці

source: Documents can be uploaded/changed only for submission in `draft` status.
uk: Документи можливо завантажити/оновити тільки до заявки у статусі `draft.`

source: Documents operations is same like in framework:
uk: Усі операції над документами такі ж як у кваліфікації:

source: Confidential documents for submissions
uk: Конфіденційні файли у заявці

source: Documents can be public or confident.
uk: Документи можуть бути публічними та конфіденційними.

source: Confidentiality may be applied/changed only for submission in `draft` status. It is required to add `confidentialityRationale` with `confidentiality: buyerOnly`.
uk: Приховання (конфіденційність) може бути застосована/змінена для документів у заявці у статусі `draft`. Обов'язковим є додавання поля обґрунтування `confidentialityRationale` для `confidentiality: buyerOnly`.

source: Let's add documents with `confidentiality` as `buyerOnly` and look what we've got:
uk: Додамо документи з `confidentiality: buyerOnly` і подивимося, що ми маємо:

source: Let's add `confidentialityRationale`:
uk: Додамо поле обґрунтування `confidentialityRational`:

source: The bidder and framework owner see these kind of documents and can download:
uk: Власник заявки та власник відбору бачить такі документи і може завантажиити їх:

source: All others can't read the document:
uk: Всі інші користувачі не можуть переглянути документ:

source: Nobody but the owner of submission and framework can download the confidential document:
uk: Ніхто окрім власника заявки та власника відбору не може викачати документ:

source: Deleting submission
uk: Видалення заявки

source: Submission can be deleted only in `draft` status:
uk: Заявка може бути видалена лише у статусі `draft`:

source: Updating Submission
uk: Оновлення заявки

source: Submission can be changed only in `draft` status:
uk: Заявка може бути оновлена лише у статусі `draft`:

source: Submission activation
uk: Активація заявки

source: Submission can be activated before `period.endDate`
uk: Заявку можна активувати лише до настання `period.endDate`

source: After activating the submission, a qualification object is automatically created and submission `qualificationID` field is filled.
uk: Після активації заявки, автоматично створюється об'єкт рішення по заявці і заповнюється поле `qualificationID` в заявці.

source: Let's check what submission registry contains:
uk: Перевіримо, що містить реєстр заявки:

source: Let's check created qualification object:
uk: Перевіримо об'єкт рішення по заявці:

source: All operations with qualification object can do only `framework_owner`.
uk: Всі операції над об'єктом рішення по заявці може виконувати лише `framework_owner` (власник кваліфікації).

source: Uploading qualification documentation
uk: Завантаження документації до рішення по заявці

source: Documents can be uploaded/changed only for qualification in `pending` status.
uk: Документи можливо завантажити/оновити тільки до рішення у статусі `pending`.

source: Canceled qualification
uk: Відміна рішення по заявці

source: Qualification can be cancelled only in `pending` status.
uk: Рішення можливо відмінити лише у статусі `pending`.

source: Before cancelling qualification it is required to add sign document to qualification. If there is no sign document during cancelling, we will see an error:
uk: Перед відміною рішення необхідно додати файл підпису до кваліфікації. Якщо нема файлу підпису під час відміни, ми побачимо помилку:

source: Sign document should have `documentType: evaluationReports` and `title: *.p7s`. Let's add such document:
uk: Файд підпису повинен мати `documentType: evaluationReports` та `title: *.p7s`. Додамо такий документ:

source: Then it is allowed to cancel qualification:
uk: Тепер можна відмінити рішення по заявці:

source: After cancelling qualification, related submission changed status from `active` to `complete`.
uk: Після відміни рішення, пов'язана завявка змінює статус з `active` на `complete`.

source: Let's check what happen with submissions after cancelling qualification:
uk: Перевіримо що сталося з заявками після відміни рішення:

source: Approve qualification
uk: Підтвердження рішення по заявці

source: Qualification can be approved only in `pending` status.
uk: Рішення можливо погодити лише у статусі `pending`.

source: Before activating qualification it is required to add sign document to qualification. If there is no sign document during activation, we will see an error:
uk: Перед погодженням необхідно додати файл підпису до кваліфікації. Якщо нема файлу підпису під час активації, ми побачимо помилку:

source: Then it is allowed to activate qualification:
uk: Тепер можна підтвердити рішення по заявці:

source: After approving qualification, if it was first active qualification system create agreement with contract otherwise system add contract to agreement.
uk: Після підтвердження рішення по заявці, якщо це було перше затверджене рішення система створює реєстр з контрактом, в іншому випадку система додає контракт до реєстру.

source: Let's check current framework
uk: Перевіримо кваліфікацію:

source: You can see that `agreementID` appeared in current framework, so let's check that agreement:
uk: Ви можете побачити, що в кваліфікації з'явилось поле `agreementID`, тож давайте перевіримо реєстр:

source: As you can see agreement now in `active` status, and already have contract, so we can see that agreement in agreement feed:
uk: Як ви можете побачити реєстр в статусі `active` та має контракт, щож ми можемо побачити цей реєстр в потоці даних:

source: Let's check what qualification registry contains:
uk: Перевіримо, що містить реєстр рішення по заявці:

source: Let's check all qualifications for current framework:
uk: Перевіримо всі рішення по заявці до данної кваліфікації:

source: Framework completing
uk: Завершення кваліфікації

source: Framework is completed automatically at `qualificationPeriod.endDate` moment.
uk: Завершення кваліфікації відбувається автоматично після настання дати `qualificationPeriod.endDate`.

source: PATCH with new `qualificationPeriod.endDate` allow to complete framework earlier than was planned, but not earlier than 30 full calendar days from change moment.
uk: PATCH запит з новим значенням `qualificationPeriod.endDate` дозволяє завершити фрейморк раніше запланованого часу, але не раніше 30 повних календарних днів з моменту зміни `qualificationPeriod.endDate`.
