Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/frameworks/basic-actions/restricted.po
Languages: uk

source: Restricted access
uk: Обмежений доступ

source: Framework can have restricted access with next rules
uk: Фреймворк може мати обмежений доступ з наступними правилами

source: Public API
uk: Публічний API

source: Private API (Procuring Entity)
uk: Приватний API (Замовник)

source: Private API (Supplier)
uk: Приватний API (Учасник)

source: view
uk: перегляд

source: view/edit
uk: перегляд/редагування

source: view (all)
uk: перегляд (всі)

source: view/edit (own)
uk: перегляд/редагування (власні)

source: view/edit (all)
uk: перегляд/редагування (всі)

source: view (own)
uk: перегляд (власні)

source: Let's make an agreement that `Procuring Entity` and `Suppliers` will use different brokers for working with API:
uk: Домовимось, що `Замовник` та `Учасники` будуть використовувати різних брокерів для роботи з API:

source: Procuring Entity uses `Broker`
uk: Замовник використовує `Broker`

source: Supplier 1 uses `Broker 1`
uk: Учасник 1 використовує `Broker 1`

source: Supplier 2 uses `Broker 2`
uk: Учасник 2 використовує `Broker 2`

source: Create Framework with restricted access
uk: Створення фреймворку з обмеженим доступом

source: First create framework with restricted access by `Broker`. To do this, we need to set ``restricted_derivatives`` field to ``true`` in ``config`` section of framework creation request.
uk: Спочатку створимо фреймворк з обмеженим доступом за допомогою `Broker`. Для цього нам потрібно встановити ``restricted_derivatives`` поле в ``true`` в ``config`` розділі запиту на створення фреймворку.

source: This framework by itself is visible to everyone in public API.
uk: Цей фреймворк сам по собі видно всім в публічному API.

source: For `ProcuringEntity` with `defense` kind ``restricted_derivatives`` field will be set to ``true`` automatically.
uk: Для `ProcuringEntity` з kind `defense` поле ``restricted_derivatives`` буде встановлено в ``true`` автоматично.

source: The second step is moving the framework to `active` status:
uk: Другий крок - перехід фреймворку в статус `active`:

source: Enquiries
uk: Уточнення

source: The participant has the opportunity to contact the administrator through the electronic procurement system regarding the review of the requirements for the participant, specified in the announcement of qualification for the electronic catalog within ten working days from the day of its publication.
uk: У учасника є можливість звернутися до адміністратора (ЦЗО) через електронну систему закупівель щодо перегляду вимог до учасника, зазначених в оголошенні про проведення кваліфікації до електронного каталогу, протягом десяти робочих днів з дня його оприлюднення.

source: During enquiry period, interested parties can ask questions:
uk: Під час `enquiryPeriod` зацікавлені сторони можуть задавати питання:

source: Procuring entity can answer them:
uk: Замовник може на них відповісти:

source: It is allowed to answer the question during the whole `enquiryPeriod` and between `enquiryPeriod.endDate` and `enquiryPeriod.clarificationUntil`. In case procuring entity is answering question after `enquiryPeriod.clarificationUntil`, the error will be raised:
uk: Надавати замовникам відповіді на questions дозволено протягом всього `enquiryPeriod`, а також до `enquiryPeriod.clarificationsUntil`. У випадку, якщо замовник надасть відповідь після закінчення `enquiryPeriod.clarificationUntil`, буде помилка:

source: Only procuring entity has permission to answer the questions:
uk: Тільки замовник має право відповідати на питання:

source: To retrieve the questions list:
uk: Можна отримати список запитань:

source: To retrieve the individual answer:
uk: та окрему відповідь:

source: The presence of a question does not block the transition of the qualification announcement to the next status.
uk: Наявність звернення не блокує перехід оголошення про кваліфікацію у наступний статус.

source: The presence or absence of an answer to the question does not block the transition of the qualification announcement to the next status.
uk: Наявність або відсутність відповіді на звернення не блокує перехід оголошення про кваліфікацію у наступний статус.

source: The period during which the participant can apply to the administrator through the electronic procurement system to review the requirements for the participant: the date of publication of the announcement + 10 working days.
uk: Період, протягом якого Учасник може звернутися до адміністратора (ЦЗО) через електронну систему закупівель щодо перегляду вимог до учасника: дата оприлюднення оголошення + 10 робочих днів.

source: It is forbidden to ask or answer question outside the enquiry period:
uk: Не можна створювати або редагувати звернення за межами `enquiryPeriod`:

source: Create and activate Submissions with restricted access
uk: Створення та активація пропозицій з обмеженим доступом

source: After activating framework, users can register their submissions in period from `framework.period.startDate` to `framework.period.endDate`.
uk: Після активації фреймворку користувачі можуть зареєструвати свої пропозиції в період від `framework.period.startDate` до framework.period.endDate`.

source: Let's register submission by `Broker 1`:
uk: Зареєструємо пропозицію за допомогою `Broker 1`:

source: You can see that ``restricted`` field was set to ``true`` in ``config`` section of submission creation response.
uk: Ви можете побачити, що поле ``restricted`` було встановлено в ``true`` в розділі ``config`` відповіді на створення пропозиції.

source: Next activate submission by `Broker 1`:
uk: Далі активуємо пропозицію за допомогою `Broker 1`:

source: Add another Submission by `Broker 2`:
uk: Додамо ще одну пропозицію за допомогою `Broker 2`:

source: And activate it:
uk: І активуємо її:

source: Request submissions with restricted access
uk: Запит пропозицій з обмеженим доступом

source: Let's check submissions by all participants:
uk: Перевіримо пропозиції всіх учасників:

source: Broker (Procuring Entity)
uk: Broker (Замовник)

source: Let's check submission feed for `Broker` that is `Procuring Entity` and has access to all submissions of framework:
uk: Перевіримо фід пропозицій для `Broker`, який є `Замовником` та має доступ до всіх пропозицій фреймворку:

source: Now make request by `Broker` for submission that was created by `Broker 1`:
uk: Тепер зробимо запит за допомогою `Broker` для пропозиції, створеної `Broker 1`:

source: Then make request by `Broker` for submission that was created by `Broker 2`:
uk: Тепер зробимо запит за допомогою `Broker` для пропозиції, створеної `Broker 2`:

source: Broker 1 (Supplier 1)
uk: Broker 1 (Учасник 1)

source: Let's check submission feed for `Broker 1` that is `Supplier 1` and has access only to own submissions:
uk: Перевіримо фід пропозицій для `Broker 1`, який є `Учасником 1` та має доступ тільки до власних пропозицій:

source: We can see that second submission is partially visible in feed and marked with ``restricted`` field set to ``true``.
uk: Ми бачимо, що друга пропозиція частково видна в фіді і позначена полем ``restricted``, встановленим в ``true``.

source: Now make request by `Broker 1` for submission that was created by `Broker 1`:
uk: Тепер зробимо запит за допомогою `Broker 1` для пропозиції, створеної `Broker 1`:

source: Then make request by `Broker 1` for submission that was created by `Broker 2`:
uk: Тепер зробимо запит за допомогою `Broker 1` для пропозиції, створеної `Broker 2`:

source: We can see error message that submission is restricted for `Broker 1`.
uk: Ми бачимо повідомлення про помилку, що пропозиція обмежена для `Broker 1`.

source: Broker 2 (Supplier 2)
uk: Broker 2 (Учасник 2)

source: Let's check submission feed for `Broker 2` that is `Supplier 2` and has access only to own submissions:
uk: Перевіримо фід пропозицій для `Broker 2`, який є `Учасником 2` та має доступ тільки до власних пропозицій:

source: Now make request by `Broker 2` for submission that was created by `Broker 1`:
uk: Тепер зробимо запит за допомогою `Broker 2` для пропозиції, створеної `Broker 1`:

source: Then make request by `Broker 2` for submission that was created by `Broker 2`:
uk: Тепер зробимо запит за допомогою `Broker 2` для пропозиції, створеної `Broker 2`:

source: Anonymous
uk: Анонімно

source: Let's check submission feed with anonymous request (or any broker that is not `Broker` or `Broker 1`):
uk: Перевіримо фід пропозицій з анонімним запитом (або будь-яким брокером, який не є `Broker` або `Broker 1`):

source: Now make request for submission that was created by `Broker 1`:
uk: Тепер зробимо запит для пропозиції, створеної `Broker 1`:

source: Then make request for submission that was created by `Broker 2`:
uk: Тепер зробимо запит для пропозиції, створеної `Broker 2`:

source: Request Qualifications with restricted access
uk: Запит кваліфікацій з обмеженим доступом

source: Let's check qualifications by all participants:
uk: Перевіримо кваліфікації всіх учасників:

source: Let's check qualification feed for `Broker` that is `Procuring Entity` and has access to all qualifications of framework:
uk: Перевіримо фід кваліфікацій для `Broker`, який є `Замовником` та має доступ до всіх кваліфікацій фреймворку:

source: Now make request by `Broker` for qualification of submission that was created by `Broker 1`:
uk: Тепер зробимо запит за допомогою `Broker` для кваліфікації пропозиції, створеної `Broker 1`:

source: Then make request by `Broker` for qualification of submission that was created by `Broker 2`:
uk: Тепер зробимо запит за допомогою `Broker` для кваліфікації пропозиції, створеної `Broker 2`:

source: Let's check qualification feed for `Broker 1` that is `Supplier 1` and has access only to qualifications of it own submissions:
uk: Перевіримо фід кваліфікацій для `Broker 1`, який є `Учасником 1` та має доступ тільки до власних кваліфікацій:

source: We can see that second qualification is partially visible in feed and marked with ``restricted`` field set to ``true``.
uk: Ми бачимо, що друга кваліфікація частково видна в фіді і позначена полем ``restricted``, встановленим в ``true``.

source: Now make request by `Broker 1` for qualification of submission that was created by `Broker 1`:
uk: Тепер зробимо запит за допомогою `Broker 1` для кваліфікації пропозиції, створеної `Broker 1`:

source: Then make request by `Broker 1` for qualification of submission that was created by `Broker 2`:
uk: Потім зробимо запит за допомогою `Broker 1` для кваліфікації пропозиції, створеної `Broker 2`:

source: We can see error message that qualification is restricted for `Broker 1`.
uk: Ми бачимо повідомлення про помилку, що кваліфікація обмежена для `Broker 1`.

source: Let's check qualification feed for `Broker 2` that is `Supplier 2` and has access only to qualifications of it own submissions:
uk: Перевіримо фід кваліфікацій для `Broker 2`, який є `Учасником 2` та має доступ тільки до власних кваліфікацій:

source: Now make request by `Broker 2` for qualification of submission that was created by `Broker 1`:
uk: Тепер зробимо запит за допомогою `Broker 2` для кваліфікації пропозиції, створеної `Broker 1`:

source: Then make request by `Broker 2` for qualification of submission that was created by `Broker 2`:
uk: Потім зробимо запит за допомогою `Broker 2` для кваліфікації пропозиції, створеної `Broker 2`:

source: Let's check qualification feed with anonymous request (or any broker that is not `Broker` or `Broker 1`):
uk: Перевіримо фід кваліфікацій з анонімним запитом (або будь-яким брокером, який не є `Broker` або `Broker 1`):

source: Now make request for qualification of submission that was created by `Broker 1`:
uk: Тепер зробимо запит для кваліфікації пропозиції, створеної `Broker 1`:

source: Then make request for qualification of submission that was created by `Broker 2`:
uk: Потім зробимо запит для кваліфікації пропозиції, створеної `Broker 2`:

source: Activate Qualifications with restricted access
uk: Активуція кваліфікації з обмеженим доступом

source: Let's activate all qualifications by `Broker`:
uk: Активуємо всі кваліфікації за допомогою `Broker`:

source: Let's check current framework
uk: Перевіримо поточний фреймворк

source: You can see that `agreementID` appeared in current framework, so let's check that agreement.
uk: Ви можете побачити, що `agreementID` з'явився в поточному фреймворку, тому перевіримо цю угоду.

source: Request Agreement with restricted access
uk: Запит угоди з обмеженим доступом

source: Let's check agreement by all participants:
uk: Перевіримо угоду всіма учасниками:

source: Let's check agreement feed for `Broker` that is `Procuring Entity` and has access to agreement of framework:
uk: Перевіримо фід угод для `Broker`, який є `Замовником` та має доступ до угоди фреймворку:

source: Now make request by `Broker` for agreement:
uk: Тепер зробимо запит за допомогою `Broker` для угоди:

source: Let's check agreement feed for `Broker 1`:
uk: Перевіримо фід угод для `Broker 1`:

source: Now make request by `Broker 1` for agreement:
uk: Тепер зробимо запит за допомогою `Broker 1` для угоди:

source: Let's check agreement feed for `Broker 2`:
uk: Перевіримо фід угод для `Broker 2`:

source: Now make request by `Broker 2` for agreement:
uk: Тепер зробимо запит за допомогою `Broker 2` для угоди:

source: Let's check agreement feed with anonymous request (or any broker that is not `Broker` or `Broker 1`):
uk: Перевіримо фід угод з анонімним запитом (або будь-яким брокером, який не є `Broker` або `Broker 1`):

source: Now make request for agreement:
uk: Тепер зробимо запит для угоди:
