Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/relocation/agreements.po
Languages: uk

source: Example for Agreement
uk: Приклад для угоди

source: Agreement ownership change
uk: Зміна власника угоди

source: Let's view transfer example for agreement transfer.
uk: Переглянемо приклад зміни власника для угоди.

source: Getting agreement's credentials
uk: Отримання доступу до угоди

source: At first let's get agreement credentials:
uk: Спочатку отримаємо доступ до угоди:

source: `broker` is current agreement's ``owner``.
uk: Майданчик `broker` є поточним власником ``owner`` угоди.

source: Note that response's `access` section contains a ``transfer`` key which is used to change tender ownership.
uk: Зверніть увагу, що секція відповіді `access` містить ключ ``transfer``, який використовується для зміни власника угоди.

source: After agreement's credentials obtaining broker has to provide its customer with ``transfer`` key.
uk: Після отрімання доступу до угоди майданчик повинен довести ключ ``transfer`` до відома клієнта.

source: Transfer creation
uk: Ініціація зміни власника

source: First of all, you must know ID of the agreement that you want to transfer.
uk: Перш за все, необхідно знати ID угоди, власника якого ви хочете змінити.

source: Broker that is going to become new agreement owner should create a `Transfer`.
uk: Майданчик, що стане новим власником угоди, повинен створити об'єкт `Transfer`.

source: `Transfer` object contains new access ``token`` and new ``transfer`` token for the object that will be transferred to new broker.
uk: Об'єкт `Transfer` містить новий ключ доступу ``token`` та новий ключ ``transfer`` для об'єкта, власник якого буде змінений.

source: Changing agreement's owner
uk: Зміна власника угоди

source: An ability to change agreement's ownership depends on agreement's status:
uk: Можливість зміни власника угоди залежить від статусу угоди:

source: Allowed
uk: Дозволено

source: Not Allowed
uk: Не дозволено

source: In order to change agreement's ownership new broker should send POST request to appropriate `/agreements/id/` with `data` section containing ``id`` of `Transfer` and ``transfer`` token received from customer:
uk: Щоб змінити власника угоди новий майданчик повинен надіслати POST запит на відповідний `/agreements/id/` з секцією `data`, що міститиме ідентифікатор ``id`` для `Transfer` та ключ ``transfer`` отриманий від клієнта:

source: Updated ``owner`` value indicates that ownership is successfully changed.
uk: Оновлене значення властивості ``owner`` вказує, що власник був успішно змінений.

source: Note that new broker has to provide its customer with new ``transfer`` key (generated in `Transfer` object).
uk: Зверніть увагу, що новий майданчик повинен довести до відома клієнта новий ключ ``transfer`` (згенерований в об'єкті `Transfer`).

source: After `Transfer` is applied it stores agreement path in ``usedFor`` property.
uk: Можна перевірити чи після застосування об'єкта `Transfer` шлях до угоди зберігається у властивості ``usedFor``.

source: Let's try to change the agreement using ``token`` received on `Transfer` creation:
uk: Спробуємо змінити угоду за допомогою ключа ``token``, отриманого при створенні об'єкта `Transfer`.

source: Pay attention that only broker with appropriate accreditation level can become new owner. Otherwise broker will be forbidden from this action.
uk: Зверніть увагу, що тільки майданчик з відповідним рівнем акредитації може стати новим власником. В іншому випадку майданчику така дія буде заборонена.

source: Also ownership change is allowed only if current owner has a special accreditation level that allows ownership change:
uk: Зміна власника дозволена тільки якщо поточний власник тендера має спеціальний рівень акредетації, що дозволяє зміну:
