Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/relocation/plans.po
Languages: uk

source: Example for Plan
uk: Приклад для плану закупівлі

source: Plan ownership change
uk: Зміна власника плану закупівлі

source: Let's view transfer example for plan.
uk: Переглянемо приклад зміни власника для плану.

source: Tender creation
uk: Створення плану закупівлі

source: At first let's create a plan:
uk: Спочатку створимо план закупівлі:

source: `broker` is current plan's ``owner``.
uk: Майданчик `broker` є поточним власником ``owner`` плану закупівлі.

source: Note that response's `access` section contains a ``transfer`` key which is used to change plan ownership.
uk: Зверніть увагу, що секція відповіді `access` містить ключ ``transfer``, який використовується для зміни власника плану закупівлі.

source: After plan's registration in CDB broker has to provide its customer with ``transfer`` key.
uk: Після реєстрація плану закупівлі в ЦБД майданчик повинен довести ключ ``transfer`` до відома клієнта.

source: Transfer creation
uk: Ініціація зміни власника

source: Broker that is going to become new plan owner should create a `Transfer`.
uk: Майданчик, що стане новим власником плану закупівлі, повинен створити об'єкт `Transfer`.

source: `Transfer` object contains new access ``token`` and new ``transfer`` token for the object that will be transferred to new broker.
uk: Об'єкт `Transfer` містить новий ключ доступу ``token`` та новий ключ ``transfer`` для об'єкта, власник якого буде змінений.

source: `Transfer` can be retrieved by `id`:
uk: Об'єкт `Transfer` можна переглянути за допомогою ідентифікатора `id`:

source: Changing plan's owner
uk: Зміна власника плану закупівлі

source: An ability to change plan's ownership depends on plan's status:
uk: Можливість зміни власника плану закупівлі залежить від статусу плану закупівлі:

source: Allowed
uk: Дозволено

source: Not Allowed
uk: Не дозволено

source: To change plan's ownership new broker should send POST request to appropriate `/plans/id/` with `data` section containing ``id`` of `Transfer` and ``transfer`` token received from customer:
uk: Щоб змінити власника плану закупівлі новий майданчик повинен надіслати POST запит на відповідний `/plans/id/` з секцією `data`, що міститиме ідентифікатор ``id`` для `Transfer` та ключ ``transfer`` отриманий від клієнта:

source: Updated ``owner`` value indicates that ownership is successfully changed.
uk: Оновлене значення властивості ``owner`` вказує, що власник був успішно змінений.

source: Note that new broker has to provide its customer with new ``transfer`` key (generated in `Transfer` object).
uk: Зверніть увагу, що новий майданчик повинен довести до відома клієнта новий ключ ``transfer`` (згенерований в об'єкті `Transfer`).

source: After `Transfer` is applied it stores plan path in ``usedFor`` property:
uk: Після того, як об'єкт `Transfer` було застосовано, для нього генерується властивість ``usedFor`` (вказується шлях до об'єкта, власника якого було змінено):

source: 'Used' `Transfer` can't be applied to any other object.
uk: 'Використаний' об'єкт `Transfer` вже не можна застосувати до іншого об'єкта.

source: Let's try to change the plan using ``token`` received on `Transfer` creation:
uk: Спробуємо змінити план закупівлі за допомогою ключа ``token``, отриманого при створенні об'єкта `Transfer`.

source: Pay attention that only broker with appropriate accreditation level can become new owner. Otherwise broker will be forbidden from this action.
uk: Зверніть увагу, що тільки майданчик з відповідним рівнем акредитації може стати новим власником. В іншому випадку майданчику така дія буде заборонена.

source: Also ownership change is allowed only if current owner has a special accreditation level that allows ownership change:
uk: Зміна власника дозволена тільки якщо поточний власник тендера має спеціальний рівень акредетації, що дозволяє зміну:
