Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/cluster.po
Languages: uk

source: API in cluster mode
uk: Робота з API в режимі кластеру

source: There is a cluster of several servers that synchronize data between each other. Client should always work with the same server to ensure consistency between separate requests to the CDB. That is why cookie is required while sending POST/PUT/PATCH/DELETE requests. Cookies provide server stickiness. You can get such cookie via GET request and then use it for POST/PUT/PATCH/DELETE.
uk: Дані синхронізуються на кластері з декількох серверів. Для узгодження між окремими запитами до ЦБД важливо, щоб клієнт працював завжди з одним сервером. Тому обов’язково використовувати реп’яшок (сookie) при подачі POST/PUT/PATCH/DELETE запитів. Реп’яшки (сookies) забезпечують прив’язку до сервера. Такий реп’яшок можна отримати через GET запит, а тоді використовувати його в POST/PUT/PATCH/DELETE.

source: If during operations the server requested by cookie went down or is unavailable, client will receive :ref:`status code 412 <errors>` of request and new cookie to use. Request should be repeated with new cookie.
uk: Якщо під час операцій сервер запитаний реп’яшком недоступний або впав, клієнт отримає :ref:`412 код стану <errors>` запиту і новий реп’яшок. Запит потрібно повторити з використанням нового реп’яшка.

source: Since we moved to MongoDB cluster with primary & secondaries, SERVER_ID cookie is no longer required.
uk: Оскільки ми перейшли на кластер MongoDB з primary & secondary нодами, файл cookie SERVER_ID більше не потрібен.

source: Please read the new instructions below
uk: Прочитайте нові інструкції нижче

source: Causal consistency sessions
uk: Сессії з “сausal consistency”

source: MongoDB clients with causal consistency sessions can achieve the following guarantees:
uk: В MongoDB клієнт застосунки, що використовують causal consistency, отримують наступні гарантії:

source: Since our clients work with database through API, they will need to store their session state. So that API is able to apply their parameters and provide the guaranties to every user.
uk: Оскільки наші клієнти працюють з базою даних через API, їм потрібно буде зберігати стан свого сеансу. Таким чином API може застосовувати параметри сессії та надавати гарантії кожному користувачеві.

source: Fig. 1. Database connection configuration overview diagram
uk: Рис. 1. Оглядова схема конфігурації підключення до бази даних

source: Fig. 2. Consistent database session mechanism sequence diagram
uk: Рис. 2. Діаграма послідовності механізма консистентного сеансу з базою даних

source: Here is an example
uk: Приклад

source: Every request returns a session cookie, that is continuously updated
uk: Кожен запит повертає куку з даними сесії, які постійно оновлюються

source: Then the following request should use that cookies
uk: Тож наступний запит має використовувати цю куку
