Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/constants.po
Languages: uk

source: Constants
uk: Константы

source: **BUDGET_PERIOD_FROM** - Added `period` to planning `Budget` model and use instead of `year` field
uk: **BUDGET_PERIOD_FROM** - Додано період до моделі `Budget` в планінгіх та стало використовуватись замість поля `year`

source: **NOT_REQUIRED_ADDITIONAL_CLASSIFICATION_FROM** - Made not required `additionalClassifications`
uk: **NOT_REQUIRED_ADDITIONAL_CLASSIFICATION_FROM** - Поле `additionalClassifications` перестало бути обов'язковим

source: **CPV_336_INN_FROM** - `additionalClassifications` have to have only one classification
uk: **CPV_336_INN_FROM** - Поле `additionalClassifications` має мати лише один класифікатор

source: **ORGANIZATION_SCALE_FROM** - `scale` became required
uk: **ORGANIZATION_SCALE_FROM** - Поле `scale` стало обов'язковим

source: **VAT_FROM** - Readonly attributes for `valueAddedTaxIncluded`
uk: **VAT_FROM** - Поле `valueAddedTaxIncluded` стало доступним лише для зчитування

source: **MPC_REQUIRED_FROM** - `mainProcurementCategory` became required
uk: **MPC_REQUIRED_FROM** - Поле `mainProcurementCategory` стало обв'язковим

source: **MILESTONES_VALIDATION_FROM** - Added validations for `milestone`
uk: **MILESTONES_VALIDATION_FROM** - Додана валідація до поля `milestone`

source: **PLAN_BUYERS_REQUIRED_FROM** - `buyers` became required
uk: **PLAN_BUYERS_REQUIRED_FROM** - Поле `buyers` стало обов'язковим

source: **BUDGET_BREAKDOWN_REQUIRED_FROM** - Field `breakdown` became required for tenders ("belowThreshold", "reporting", "esco")
uk: **BUDGET_BREAKDOWN_REQUIRED_FROM** - поле `breakdown` стало обов'язковим для тендерів ("belowThreshold", "reporting", "esco")

source: **WORKING_DATE_ALLOW_MIDNIGHT_FROM** - Allowed working in midnight
uk: **WORKING_DATE_ALLOW_MIDNIGHT_FROM** - Додана можливість працювати о півночі

source: **NORMALIZED_CLARIFICATIONS_PERIOD_FROM** - normalized certifications period
uk: **NORMALIZED_CLARIFICATIONS_PERIOD_FROM** - Нормалізовано сертифікаційний період

source: **QUICK_CAUSE_REQUIRED_FROM** - `cause` became required
uk: **QUICK_CAUSE_REQUIRED_FROM** - Поле `cause` стало обов'язковим

source: **RELEASE_2020_04_19** - New cancellation flow with complaints was implemented
uk: **RELEASE_2020_04_19** - Новий спосіб відміни за допомогою оскарження

source: **VALIDATE_ADDRESS_FROM** - Validation for Address `countryName` and `region`
uk: **VALIDATE_ADDRESS_FROM** - Додата валідація для полів `countryName` та `region`

source: **COMPLAINT_IDENTIFIER_REQUIRED_FROM** - `ComplaintIdentifier` became required
uk: **COMPLAINT_IDENTIFIER_REQUIRED_FROM** - Поле `ComplaintIdentifier` стало обов'язковим

source: **PLAN_ADDRESS_KIND_REQUIRED_FROM** - `kind` in `PlanAddress` became required
uk: **PLAN_ADDRESS_KIND_REQUIRED_FROM** - Поле `kind` стало обов'язковим

source: **NEW_NEGOTIATION_CAUSES_FROM** - Implemented new cause choices for Negotiation procedure
uk: **NEW_NEGOTIATION_CAUSES_FROM** - Впроваджено нові варіанти прчин для процедури узгодження

source: **NORMALIZED_TENDER_PERIOD_FROM** - normalized tender period
uk: **NORMALIZED_TENDER_PERIOD_FROM** - Нормалізовано період тендера

source: **MINIMAL_STEP_VALIDATION_FROM** - Added validation for `minimalStep`
uk: **MINIMAL_STEP_VALIDATION_FROM** - Додано валідацію для поля `minimalStep`

source: **RELEASE_ECRITERIA_ARTICLE_17** - Criteria was implemented
uk: **RELEASE_ECRITERIA_ARTICLE_17** - Впровадження критеріїв

source: **CRITERION_REQUIREMENT_STATUSES_FROM** - Implemented statuses to criterion requirement
uk: **CRITERION_REQUIREMENT_STATUSES_FROM** - Впроваджено статуси для `requirement` для критеріїв

source: **RELEASE_SIMPLE_DEFENSE_FROM** - New defense procedure
uk: **RELEASE_SIMPLE_DEFENSE_FROM** - Нова процедура для потреб оборони

source: **NEW_DEFENSE_COMPLAINTS_FROM** - New defence complaints supports from date
uk: **NEW_DEFENSE_COMPLAINTS_FROM** - Нове оскарження для потреб оборони з дати

source: **NEW_DEFENSE_COMPLAINTS_TO** - New defence complaints supports to date
uk: **NEW_DEFENSE_COMPLAINTS_TO** - Нове оскарження для потреб оборони до дати

source: **NO_DEFENSE_AWARD_CLAIMS_FROM** - Complaint type is should be only "complaint"
uk: **NO_DEFENSE_AWARD_CLAIMS_FROM** - Тип оскарження має бути лише "complaint"
