Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/development/contract_change.po
Languages: uk

source: EContract Change
uk: Зміни у елктронний котнратк

source: This section describes the new workflow for making changes to active contracts.
uk: Цей розділ описує новий принцип внесення змін до активного договору.

source: Contract
uk: Договір

source: Imagine you already have active contract with all needed information:
uk: Давайте уявим, що ми вже маємо активний договір з усією потрібною інформацією:

source: Creating change
uk: Подання зміни

source: Both buyer and supplier can make changes to the active contract.
uk: Зміни до активного контракту можуть подавати як замовник так і постачальник.

source: When creating a change, you need to fill in three mandatory fields (in the old behavior there were only two: `rationale`, `rationaleTypes`):
uk: При створені зміни потрібно вказати три обовʼязкових поля(в старій поведінці лише два: `rationale`, `rationaleTypes`):

source: string, cause of changes
uk: строка, причина змін

source: list, types of change
uk: список, типи змін

source: object, field that could be changed in contract
uk: обʼєкт, поля які потрібно змінити в котракті

source: `modifications` is a new structure that represents fields that the user wants to update in the contract, these fields are of the same type as the corresponding fields in the contract:
uk: `modifications` це нова структура, яка відображає які поля користувач хоче змінити в договорі, ці поля такого ж самого типу, що і аналогічні поля в контракті:

source: string, required
uk: строка

source: string
uk: строка

source: List of :ref:`EContractOrganization` objects
uk: Список :ref:`EContractOrganization` обʼєктів

source: List of :ref:`Item` objects
uk: Список :ref:`Item` обʼєктів

source: :ref:`ContractValue` object
uk: :ref:`ContractValue` обʼєкт

source: After explaining new structure, let's create change:
uk: Після розʼяснення нової структури, давайте створимо зміну:

source: Activating change
uk: Активація зміни

source: In previous flow after creation contract change you need to set `dateSigned` to activate contract, in new flow for activating change supplier and buyer should add signature document with extension `.p7s` and documentType `contractChangeSignature` to change object.
uk: По минулій логіці, для активації контракту потрібно було вказати лише `dateSigned`, за новими для активації змін замовнику та постачальнику потрібно додати документи підпису з розширенням `.p7s` і з типом документу `contractChangeSignature` до обʼєкту зміни.

source: Buyer add document to change:
uk: Замовник завантажує документ:

source: Supplier add document:
uk: Постачальник завантажує документ:

source: After adding signature documents we have possibility to activate change:
uk: Після завантаження документів підпису зʼявляється можливість активації зміни:

source: After activation, a new `previousValues` field appears, which contains information about the previous values of changed fields in the contract.
uk: Після активації в зміні зʼявиться нове поле `previousValues`, яке містить інформацію про минулі значення змінених полів в договорі.

source: Also after activation, changes from the `modifications` field are applied to the contract:
uk: Такого після активації зміни, значення вказаних полів в `modifications` застосовуються до контракут:

source: Conclusion
uk: Висновок

source: Change can create both a buyer and a supplier.
uk: Зміну можуть подати як замовник так і постачальник.

source: Two fields will be added to `Change`: `modifications` - changes that will be applied after activation and `previousValues`: auto-generated field for storing history.
uk: Будуть додані два поля до обʼєкту `Change`: `modifications` - зміни які будуть застосовані до контракту там `previousValues` - автогенеруєме поле для зберігання історії змін.

source: For activating `Change` buyer and supplier must sign this change by adding signature documents to the change.
uk: Для активації обʼєкту `Change` замовник і постачальник повинні підписати зміни шляхом подання документів підпису до зміни.

source: After activating `Change` all modifications will be applied to the contract.
uk: Після активації обʼєкту `Change` всі поля вказані в `modifications` будуть застосовані до договору.
