Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/development/pq_transfer_logic_from_bot.po
Languages: uk

source: Transfer logic from PQ bot to CBD
uk: Переніс логіки PQ бота до ЦБД

source: This section describes the logic of refusal of the priceQuotationBot and transferring validations from the bot to the CBD during tender activation.
uk: В цьому розділі описана логіка відмови від PQ бота і переносу валідацій з боту в ЦБД під час активації тендеру.

source: Creating tender
uk: Створення тендеру

source: Tender creation remains unchanged for PQ. A tender is created in the same way as before in the status `draft`:
uk: Створення тендеру залишається незмінним для PQ. Створюється тендер так само як і раніше в статусі `draft`:

source: Modifying tender
uk: Редагування тендеру

source: Procuring Entity can modify tender before activating. In previous flow with PQ bot there was the same stage before publishing (before changing status to `draft.publishing`).
uk: Замовник може редагувати закупівлю перед активацією. В попередньому флоу з використанням PQ бота був такий самий етап перед публікацією (до зміни статусу на `draft.publishing`).

source: Activating tender
uk: Активація тендеру

source: In previous flow after creation Procuring Entity published procedure by changing status to `draft.publishing` where **priceQuotationBot** robot ran validation of the procedure and supplemented procedure with additional data taken from ProZorro e-Catalogues database including `shortListedFirms`.
uk: В попередньому флоу після створення Замовник публікував процедуру, змінивши статус на `draft.publishing`, де робот **priceQuotationBot** запускав перевірку процедури та доповнював процедуру додатковими даними, отриманими з бази даних електронних каталогів ProZorro, включаючи `shortListedFirms`.

source: After successful validation priceQuotationBot transmitted procedure to status: `active.tendering` or `draft.unsuccessful` in case if procedure did not pass validation due to invalid options.
uk: Після успішної валідації priceQuotationBot переводив процедуру в статус: `active.tendering` чи `draft.unsuccessful` у разі, якщо процедура не проходила перевірку через недійсні параметри.

source: Now we transfer all robot's validation logic to CBD and check it while Procuring Entity is changing status to `active.tendering` by patching tender.
uk: Тепер ми переносимо всю логіку валідації до ЦБД і перевіряємо це на моменті, коли замовник змінює статус процедури на `active.tendering` через PATCH тендеру.

source: PQ robot validations:
uk: Валідації бота PQ:

source: Existence of item profile in catalogue
uk: Наявність профілю товару в каталозі

source: Existence of related agreement
uk: Наявність відповідного договору

source: Equality of profile agreement and related agreement in tender
uk: Перевірка, що угода в профілі та пов’язана угода в тендері однакові

source: Agreement should not be in terminated status
uk: Угода не повинна бути розірвана (статус terminated)

source: Agreement has qualified suppliers
uk: Угода має кваліфікованих постачальників (suppliers)

source: Possible errors
uk: Можливі помилки

source: If Procuring Entity will try to activate PQ procedure with non-existed profile in catalogue, we will see error:
uk: Якщо Замовник спробує активувати процедуру PQ з неіснуючим профілем у каталозі, ми побачимо помилку:

source: If Procuring Entity will try to activate PQ procedure with non-existed agreement, the next error will be generated:
uk: Якщо Замовник спробує активувати процедуру PQ з неіснуючим договором, буде згенеровано наступну помилку:

source: In case profile agreement and related agreement in tender aren't equal, the next error will be generated:
uk: Якщо угода (agreement) в профілі та угода в тендері не однакові, буде згенеровано наступну помилку:

source: If agreement is in terminated status:
uk: Якщо угода розірвана:

source: If there is problem with connection to ProZorro e-Catalogues, we will see error:
uk: Якщо є проблема з підключенням до електронних каталогів ProZorro, ми побачимо помилку:

source: Successful scenario
uk: Успішний сценарій

source: If PQ procedure matches all requirements, it will be switched to `active.tendering`:
uk: Якщо процедура PQ відповідає всім вимогам, вона буде переведена в статус `active.tendering`:

source: There will not be `shortlistedFirms` field in procedure anymore. During bid creation/activation there will be validation that `bid.tenderers` is a member of agreement.
uk: В процедурі більше не буде поля `shortlistedFirms`. Під час подання/активації біда буде працювати валідація, що `bid.tenderers` має бути вказаний в договорі як кваліфікований постачальник.

source: Conclusion
uk: Висновки

source: PQ procedure will not have statuses `draft.publishing`, `draft.unsuccessful` anymore.
uk: Процедура PQ більше не матиме статусів `draft.publishing`, `draft.unsuccessful`.

source: If PQ procedure doesn't match all requirements, it won't be switched to `active.tendering` until all requirements is met.
uk: Якщо процедура PQ не відповідає всім вимогам, її не буде переведено в `active.tendering`, доки не буде виконано всі вимоги.

source: Logic of creation and modification of PQ procedure won't be changed.
uk: Логіка створення та редагування процедури PQ не буде змінена.

source: Next steps after `active.tendering` status stays the same.
uk: Подальші дії після статусу `active.tendering` залишаються незмінними.
