Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/belowthreshold/inspector.po
Languages: uk

source: Tender Inspector Tutorial
uk: Туторіал Закупівля з контролером

source: Creating tender with inspector
uk: Створення закупівлі з контролером

source: To create tender with inspector you should set field `inspector` on creation (or you can in set it later by patching tender in `draft` or `active.enquiries` statuses)
uk: Для створення закупівлі з контролером потрібно передати поле `inspector` при створені або можете встановити пізніше пропатчивши закупівлю в статусі `draft` або `active.enquiries`

source: Inspector field can be set only together with `funders` .
uk: Поле `inspector` дозволено передавати лише разом з `funders` (в закупівлях з донором):

source: that's what will happen if you try to create tender with inspector without funders:
uk: Ось, що станеться якщо ви спробуєте створити закупівлю з контролером без `funders`

source: We got error 422, now let's create tender with `inspector` together with `funders`:
uk: Ми отримали помилку 422, тепер давайте спробуємо створити закупівлю разом з полями `inspector` та `funders`:

source: Patch inspector
uk: Зміна контролера

source: Field inspector can be patched only in statuses `draft` or `active.enquiries`:
uk: Поле `inspector` може бути змінене лише в статусах `draft` та `active.enquiries`:

source: Create review request
uk: Створення запиту на перевірку

source: Review request can create tender owner for tender with inspector and only in `active.enquiries`, `active.qualification` (if procedure with multiple lots)/ `active.awarded` (if procedure with one or without lots).
uk: Запит на перевірку може створити замовник лише в закупівлі з контролером і лише в статусах `active.enquiries`, `active.qualification` (якщо закупівля мультилотова)/ `active.awarded` (якщо закупівля безлотова або з одним лотом).

source: Depends on status from the moment of creation to the moment of providing the result prohibited:
uk: В залежності від статусу від моменту створення і до моменту відповіді на запит забороняється:

source: `active.enquiries` - PATCH tender(except `tenderPeriod`)
uk: `active.enquiries` - змінювати закупівлю(окрім `tenderPeriod`)

source: `active.qualification`/`active.awarded` - PATCH awards, activate contracts
uk: `active.qualification`/`active.awarded`` - змінювати аварди, активувати контракти

source: Let's try to patch tender description:
uk: Cпробуємо змінити опис закупівлі:

source: Now let's patch tenderPeriod:
uk: Тепер спробуєм змінити період подання пропозиції:

source: New review request can't be created if already exists unanswered review request:
uk: Новий запит на перевірку не може бути створений поки існує інший запит без відповіді

source: Create review request on qualification stage
uk: Створення запиту на перевірку на етапі кваліфікації

source: If procedure has lots, review request should be created with lotID:
uk: Якщо закупівля лотова, то при створенні запиту на перевірку потрібно вказати `lotID`:

source: Review request on qualification stage(`active.qualification`/`active.awarded`) can be created only if exists active award.
uk: Запит на перевірку на етапі кваліфікації може бути створений лише при наявності переможця.

source: Inspector providing review result
uk: Відповідь контролера

source: Provide result on review request can only user with `inspector` role using PATCH method:
uk: Надавати відповідь на запит перевірки може лише користувач з роллю `inspector` в системі використовуючи PATCH метод на запит:

source: Inspector can't provide review result on the same review request twice:
uk: Контролер не може надати відповідь на один і той самий запит двічі:

source: The procedure cannot go further through the statuses until the controller gives a positive response to review request.
uk: Закупівля не може рухатись далі по статусам поки не буде надане погодження на запит перевірки.

source: So buyer should make changes, create new review request and after that inspector can provide new result:
uk: Тож замовнику потрібно внести зміни, створити новий запит перевірки і після цього контролер може надати повторне рішення:
