Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/cfaua/requests.po
Languages: uk

source: REST API specification
uk: REST API специфікації

source: Tender:
uk: Тендер:

source: Get tenders collection
uk: Отримайте список тендерів

source: Get tender by id
uk: Отримайте тендер по його ідентифікатору (id)

source: Tender edit
uk: Відредагувати тендер

source: Tender documents:
uk: Документи тендера:

source: Tender Document Read
uk: Читайте документи тендера

source: Tender Documents List
uk: Список документів тендера

source: Tender Document Update
uk: Оновлення документів тендера

source: Tender Documents Upload
uk: Завантаження документів тендера

source: Tender questions
uk: Питання до тендера

source: Retrieving the question
uk: Отримання питання

source: List of questions
uk: Список питань

source: Post a question
uk: Опублікувати питання

source: Post an Answer
uk: Опублікувати відповідь

source: Tender qualifications
uk: Кваліфікації тендера

source: List of qualifications
uk: Список кваліфікацій

source: Retrieving the qualification
uk: Отримання кваліфікацій

source: Post a qualification resolution
uk: Опублікувати рішення по кваліфікації

source: Tender qualifications complaints
uk: Скарги на кваліфікації тендера

source: List of complaint for award
uk: Список скарг на переможців

source: Retrieving the complaint for award
uk: Отримання скарги на переможця

source: Post a complaint
uk: Опублікувати скаргу

source: Tender qualifications documents
uk: Документи по кваліфікаціях тендера

source: Tender qualification document update
uk: Оновлення документів по кваліфікаціях тендера

source: Tender qualification document upload
uk: Завантаження документів по кваліфікаціях тендера

source: Tender qualification document read
uk: Читайте документи по кваліфікаціях тендера

source: Tender qualification documents list
uk: Список документів по кваліфікаціях тендера

source: Tender qualification complaint documents
uk: Документи до скарг по кваліфікаціяз тендера

source: Tender award complaint document read
uk: Читайте документи до скарг на переможців тендера

source: Tender award complaint documents list
uk: Список документів до скарг на переможців тендера

source: Tender award complaint document update
uk: Оновлення документів до скарг на переможців тендера

source: Tender award complaint document upload
uk: Завантаження документів до скарг на переможців тендера

source: Tender lots
uk: Лоти тендера

source: Lots listing
uk: Список лотів

source: Retrieving the lot
uk: Отримання лота

source: Update of lot
uk: Оновлення лота

source: Add a lot
uk: Додавання лота

source: Lot deleting
uk: Видалення лота

source: Tender cancellations
uk: Скасування тендера

source: List of cancellations
uk: Список об'єктів скасування тендера

source: Retrieving cancellation
uk: Отримання скасування

source: Post a cancellation resolution
uk: Опублікувати рішення про скасування

source: Post a cancellation
uk: Опублікувати скасування

source: Tender cancellation documents
uk: Документи до скасування тендера

source: Tender cancellation document read
uk: Читайте документи до скасування тендера

source: Tender cancellation documents list
uk: Список документів до скасування тендера

source: Tender cancellation document upload
uk: Завантаження документів до скасування тендера

source: Tender cancellation document update
uk: Оновлення документів до скасування тендера

source: Tender complaints
uk: Скарги на тендер

source: List of complaints
uk: Список скарг

source: Retrieving the complaint
uk: Отримання скарги

source: Post a complaint resolution
uk: Опублікуавти рішення по скарзі

source: Tender bids
uk: Ставки тендера

source: Retrieving the proposal
uk: Отримання пропозицій

source: Bids Listing
uk: Список пропозицій

source: Registration of new bid proposal
uk: Реєстрація нової пропозиції

source: Update of proposal
uk: Оновлення пропозиції

source: Cancelling the proposal
uk: Скасування пропозиції

source: Tender bid documents
uk: Документи до пропозиції

source: Tender bid document read
uk: Читайте документи до пропозиції

source: Tender bid documents list
uk: Список документів до пропозиції

source: Tender bid document upload
uk: Завантаження документів до пропозиції

source: Tender bid document update
uk: Оновлення документів до пропозиції

source: Tender bid eligibility documents
uk: Документи по критеріях відбору пропозицій

source: Tender bid financial documents
uk: Фінансові документи до пропозиції

source: Tender bid qualification documents
uk: Кваліфікаційні документи до пропозиції

source: Tender awards
uk: Переможці тендера

source: Retrieving the award
uk: Отримання переможця

source: Tender Awards List
uk: Список переможців

source: Update of award
uk: Оновлення переможця

source: Accept or reject bidder application
uk: Прийняти або відхилити додаток пропозиції

source: Tender award documents
uk: Документи до переможця тендера

source: Tender award document read
uk: Читайте документи до переможця тендера

source: Tender award documents list
uk: Список документів до переможця тендера

source: Tender award document upload
uk: Завантаження документів до переможця тендера

source: Tender award document update
uk: Оновлення документів до переможця тендера

source: Tender award complaints
uk: Скарга на переможця тендера

source: List complaints for award
uk: Список скарг на переможця

source: Post a complaint for award
uk: Опублікуавти скаргу на переможця

source: Patch a complaint for award
uk: Оновіть скаргу на переможця

source: Tender award complaint documents
uk: Документи до скарги на переможця тендера

source: Tender auction
uk: Аукціон

source: Get auction info
uk: Отримати інформацію про аукціон

source: Report auction results
uk: Опублікувати результати аукціону

source: Report auction results for lot
uk: Опублікувати результати аукціону по лоту

source: Set urls for access to auction
uk: Налаштувати URL для доступу до аукціону

source: Set url for access to auction for lot
uk: Налаштувати URL для доступу до аукціону по лоту

source: Tender agreement
uk: Угода

source: List of agreements for award
uk: Список угод до переможця

source: Post an agreement for award
uk: Опублікувати угоду до переможця

source: Update of agreement
uk: Оновити угоду

source: Tender agreement contract
uk: Контракт до угоди

source: Retrieving the contract for agreement
uk: Отримання контракту до угоди

source: List of contracts for agreement
uk: Список контрактів до угоди

source: Update agreement contract
uk: Оновити контракт до угоди

source: Tender agreement documents
uk: Документи до угоди

source: Tender agreement document read
uk: Читайте документи до угоди

source: Tender agreement documents list
uk: Список документів до угоди

source: Tender agreement document upload
uk: Завантажте документи до угоди

source: Tender agreement document update
uk: Оновіть документи до угоди
