Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/frameworks/config/has_items.po
Languages: uk

source: Field `hasItems` is the boolean field that defines if the framework should have items.
uk: Поле `hasItems` - це булеве поле, яке визначає, чи повинен відбір мати номенклатуру.

source: Possible values for `hasItems` field depends on `frameworkType` field:
uk: Можливі значення для поля `hasItems` залежать від поля `frameworkType`:

source: hasItems is `false`
uk: hasItems має значення `false`

source: `hasItems:false` means that items is not allowed for framework.
uk: `hasItems:false` означає, що номенклатура не дозволена для відбору.

source: Let's create a framework with `hasItems` set to `false` with items:
uk: Створімо відбір зі значенням `hasItems:false` з номенклатурою:

source: And then activate it:
uk: А потім активуємо її:

source: We can see error that indicates that items are not allowed for framework with `hasItems` set to `false`.
uk: Бачимо помилку, яка вказує, що номенклатура не дозволена для відбору зі значенням `hasItems:false`.

source: Now let's create a framework with `hasItems` set to `false` without items:
uk: Тепер створімо відбір зі значенням `hasItems:false` без номенклатури:

source: We can see that framework created successfully without items.
uk: Бачимо, що відбір успішно створений без номенклатури:

source: hasItems is `true`
uk: hasItems має значення `true`

source: `hasItems:true` means that items are required for framework.
uk: `hasItems:true` означає, що номенклатура обов'язкова для відбору.

source: Let's create a framework with `hasItems` set to `true` without items:
uk: Створімо відбір зі значенням `hasItems:true` без номенклатури:

source: We can see error that indicates that items are required for framework with `hasItems` set to `true`.
uk: Бачимо помилку, яка вказує, що номенклатура обов'язкова для відбору зі значенням `hasItems:true`.

source: Now let's create a framework with `hasItems` set to `true` with items:
uk: Тепер створімо відбір зі значенням `hasItems:true` з номенклатурою:

source: We can see that framework created successfully with items.
uk: Бачимо, що відбір успішно створений з номенклатурою:

source: Later, when agreement is created, items will be transferred to agreement:
uk: Пізніше, коли буде створено угоду, номенклатуру буде перенесено до угоди:
