Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/limited/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Tender creation
uk: Створення закупівлі

source: You can create three procedures:
uk: Можна створити три процедури:

source: ``reporting`` - reporting with no stand-still period
uk: ``reporting`` - процедура звітування про укладений договір (без періоду очікування скарг)

source: ``negotiation`` - negotiation procedure with 10 day stand-still before contract registration
uk: ``negotiation`` - переговорна процедура з десятиденним періодом очікування скарг перед реєстрацією угоди

source: ``negotiation.quick`` - quick negotiation procedure with 5 day stand-still before contract registration
uk: ``negotiation.quick`` - переговорна процедура за нагальною потребою з п’ятиденним періодом очікування скарг перед реєстрацією угоди

source: Creating tender for reporting procedure
uk: Створення закупівлі для процедури звітування про укладений договір

source: To create tender for **reporting** procedure you should set ``reporting`` value for ``procurementMethodType``.
uk: Щоб створити закупівлю за процедурою **звітування про укладений договір**, потрібно встановити значення ``reporting`` для ``procurementMethodType``.

source: Let’s create a tender:
uk: Створимо закупівлю:

source: We have `201 Created` response code, `Location` header and body with extra `id`, `tenderID`, and `dateModified` properties.
uk: Ми отримали код відповіді `201 Created`, заголовок `Location` і тіло з додатковим ідентифікатором `id`, `tenderID` та властивість `dateModified` - дату, що показує час, коли закупівля востаннє модифікувалась.

source: Let's check what tender registry contains:
uk: Перевіримо, що містить реєстр закупівель:

source: We do see the internal `id` of a tender (that can be used to construct full URL by prepending `http://api-sandbox.openprocurement.org/api/0/tenders/`) and its `dateModified` datestamp.
uk: Відображається `id` - внутрішній ідентифікатор (який можна використовувати, щоб побудувати повну URL-адресу, додаючи `http://api-sandbox.openprocurement.org/api/0/tenders/` на початку) та мітка часу `dateModified`.

source: Creating tender for negotiation procedure
uk: Створення закупівлі для переговорної процедури

source: To create tender for **negotiation** procedure you should set ``negotiation`` value for ``procurementMethodType``.
uk: Щоб створити закупівлю за **переговорною** процедурою, потрібно встановити значення ``negotiation`` для ``procurementMethodType``.

source: Creating tender for negotiation.quick procedure
uk: Створення закупівлі для переговорної процедури за нагальною потребою

source: To create tender for **negotiation.quick** procedure you should set ``negotiation.quick`` value for ``procurementMethodType``.
uk: Щоб створити закупівлю для **переговорної процедури за нагальною потребою**, потрібно встановити значення ``negotiation.quick`` для ``procurementMethodType``.

source: Modifying tender
uk: Модифікація закупівлі

source: Let's update tender by supplementing it with all other essential properties:
uk: Оновимо закупівлю шляхом надання їй усіх інших важливих властивостей:

source: We see the added properies have merged with existing tender data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними закупівлі. Додатково оновлена властивість dateModified, щоб відображати останню дату модифікації.

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Uploading documentation
uk: Завантаження документації

source: Procuring entity can upload documents and files into the created tender. Uploading should follow the :ref:`upload` rules.
uk: Замовник може завантажити документи у створену закупівлю. Завантаження повинно відбуватись згідно правил :ref:`upload`.

source: `201 Created` response code and `Location` header confirm document creation.
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ було створено.

source: In case we made an error, we can reupload the document over the older version:
uk: Якщо сталась помилка, ми можемо ще раз завантажити документ поверх старої версії:

source: Awarding
uk: Визначення переможця

source: Adding supplier information
uk: Додаємо інформацію про постачальника

source: Addition of supplier information is the same for all procedures.
uk: Спосіб додавання інформації про постачальника однаковий для всіх процедур.

source: Procuring entity registers supplier information for **reporting** procedure:
uk: Замовник реєструє інформацію про постачальника для процедури **звітування про укладений договір**:

source: Procuring entity registers supplier information for **negotiation** procedure:
uk: Замовник реєструє інформацію про постачальника для **переговорної** процедури:

source: You can notice that there is ``complaintPeriod`` record with ``startDate`` value generated.
uk: Ви можете побачити, що згенеровано запис ``complaintPeriod`` із полем ``startDate``.

source: Procuring entity registers supplier information for **negotiation.quick** procedure:
uk: Замовник реєструє інформацію про постачальника для переговорної процедури за нагальною потребою:

source: Award for **negotiation.quick** procedure also has ``complaintPeriod`` record with ``startDate`` value.
uk: Визначення переможця для **переговорної процедури за нагальною потребою** також має запис ``complaintPeriod`` із полем ``startDate``.

source: Uploading award documentation
uk: Завантаження документів щодо визначення переможця

source: You can upload award documents only before awarding decision is confirmed. Let's add award document:
uk: Завантажувати документи щодо визначення переможця можна лише до того, як рішення про визначення переможця буде підтверджено. Спробуємо додати такий документ:

source: `201 Created` response code and `Location` header confirm that document has been added.
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ додано.

source: Let's see the list of award documents:
uk: Переглянемо документи пов’язані із визначенням переможця:

source: We can add another award document:
uk: Тепер спробуємо додати ще один документ щодо визначення переможця:

source: `201 Created` response code and `Location` header confirm second document has been added.
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що ще один документ було додано.

source: Let's see the list of all uploaded award documents:
uk: Тепер переглянемо знову усі документи пов’язані із визначенням переможця:

source: Award confirmation
uk: Підтвердження переможця процедури

source: Procuring entity can confirm awarding decision:
uk: Замовник повинен підтвердити своє рішення про визначення переможця:

source: Award confirmation for **negotiation** procedure:
uk: Підтвердження визначення переможця для **переговорної** процедури:

source: The difference between ``startDate`` and ``endDate`` in ``complaintPeriod`` record for **negotiation** is 10 days.
uk: Різниця між початковою (``startDate``) та кінцевою (``endDate``) датою запису ``complaintPeriod`` для **переговорної** процедури становить 10 днів.

source: Award confirmation for **negotiation.quick** procedure:
uk: Підтвердження визначення переможця для **переговорної процедури за нагальною потребою** процедури:

source: The difference between ``startDate`` and ``endDate`` in ``complaintPeriod`` record for **negotiation.quick** is 5 days.
uk: Різниця між початковою ( ``startDate``) та кінцевою (``endDate``) датою запису ``complaintPeriod`` для **переговорної процедури за нагальною потребою** становить 5 днів.

source: Setting contract value
uk: Встановлення вартості угоди

source: By default contract value is set based on the award, but there is a possibility to set custom contract value.
uk: За замовчуванням вартість угоди встановлюється на основі рішення про визначення переможця, але є можливість змінити це значення.

source: If you want to **lower contract value**, you can insert new one into the `amount` field.
uk: Якщо ви хочете **знизити вартість угоди**, ви можете встановити нове значення для поля `amount`.

source: `200 OK` response was returned. The value was modified successfully.
uk: Було повернуто код відповіді `200 OK`. Значення змінено успішно.

source: Setting contract signature date
uk: Встановлення дати підписання угоди

source: There is a possibility to set custom contract signature date. You can insert appropriate date into the `dateSigned` field.
uk: Є можливість встановити дату підписання угоди. Для цього вставте відповідну дату в поле `dateSigned`.

source: If this date is not set, it will be auto-generated on the date of contract registration.
uk: Якщо ви не встановите дату підписання, то вона буде згенерована автоматично під час реєстрації угоди.

source: Setting contract validity period
uk: Встановлення терміну дії угоди

source: Setting contract validity period is optional, but if it is needed, you can set appropriate `startDate` and `endDate`.
uk: Встановлення терміну дії угоди необов’язкове, але, якщо є необхідність, ви можете встановити відповідну дату початку `startDate` та кінця `endDate` терміну дії.

source: Uploading contract documentation
uk: Завантаження документів щодо укладання угоди

source: Contract documents can be uploaded only up until conclusion of the agreement. Let's add contract document:
uk: Документи пов’язані з угодою можна завантажувати лише до укладання угоди. Спробуємо додати такий документ:

source: Let's see the list of contract documents:
uk: Переглянемо список завантажених документів:

source: We can add another contract document:
uk: Тепер спробуємо додати ще один документ щодо укладанням угоди:

source: Let's see the list of all uploaded contract documents:
uk: Тепер переглянемо знову усі документи пов’язані із укладанням угоди:

source: Contract registration
uk: Реєстрація угоди

source: **Reporting** tender contract can be registered immediately after award confirmation:
uk: Угода про закупівлю за процедурою **звітування про укладений договір** може бути зареєстрована одразу після підтвердження визначення переможця:

source: **Negotiation** tender contract can be registered only after the stand-still (10 day period after the award confirmation):
uk: Угода про закупівлю за **переговорною** процедурою може бути зареєстрована одразу після `періоду очікування скарг` (десятиденний період після підтвердження визначення переможця):

source: **Negotiation.quick** tender contract can be registered after the stand-still (5 day period after the award confirmation):
uk: Угода про закупівлю для **переговорної процедури за нагальною потребою** може бути зареєстрована одразу після `періоду очікування скарг` (п’ятиденний період після підтвердження визначення переможця):

source: Cancelling tender
uk: Скасування закупівлі

source: Procuring entity can cancel tender anytime. The following steps should be applied:
uk: Замовник може скасувати закупівлю у будь-який момент. Для цього потрібно виконати наступні кроки:

source: Prepare cancellation request
uk: Приготуйте запит на скасування

source: Fill it with the protocol describing the cancellation reasons
uk: Заповніть його протоколом про причини скасування

source: Cancel the tender with the reasons prepared.
uk: Скасуйте закупівлю через подані причини

source: Only the request that has been activated (3rd step above) has power to cancel tender. I.e. you have to not only prepare cancellation request but to activate it as well.
uk: Запит на скасування, який не пройшов активації (третій крок), не матиме сили, тобто, для скасування закупівлі є обов’язковим не тільки створити запит, але і активувати його.

source: See :ref:`cancellation` data structure for details.
uk: Див. структуру запиту :ref:`cancellation` для більш детальної інформації.

source: Preparing the cancellation request
uk: Формування запиту на скасування

source: You should pass `reason`, `status` defaults to `pending`.
uk: Потрібно передати змінні `reason`, `status` у стані `pending`.

source: `id` is autogenerated and passed in the `Location` header of response.
uk: `id` генерується автоматично і повертається у додатковому заголовку відповіді `Location`:

source: There are two possible types of cancellation reason - tender was `cancelled` or `unsuccessful`. By default ``reasonType`` value is `cancelled`.
uk: При скасуванні, замовник має визначити один з двох типів ``reasonType``: торги відмінені - `cancelled`, або торги не відбулися - `unsuccessful`. За замовчуванням, значення ``reasonType`` рівне `cancelled`.

source: You can change ``reasonType`` value to `unsuccessful`.
uk: Ви можете виправити тип на `unsuccessful` (торги не відбулися).

source: Filling cancellation with protocol and supplementary documentation
uk: Наповнення протоколом та іншою супровідною документацією

source: Upload the file contents
uk: Завантажте зміст файлу

source: Change the document description and other properties
uk: Якщо потрібно, змініть опис документа та інші властивості

source: Upload new version of the document
uk: Завантажте нову версію документа

source: Activating the request and cancelling tender
uk: Активація запиту та скасування закупівлі
