Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/planning/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Creating plan procurement
uk: Створення плану закупівлі

source: We strongly recommend creating plans in `draft` status.
uk: Наполегливо рекомендуємо створювати плани у статусі `draft`.

source: Let’s create a plan:
uk: Створимо план:

source: We have `201 Created` response code, `Location` header and body with extra `id`, `planID`, and `dateModified` properties.
uk: Ми отримали код відповіді `201 Created`, заголовок `Location` і тіло з додатковим ідентифікатором `id`, `planID` та властивість `dateModified` - дату, що показує час, коли план закупівлі востаннє модифікувався.

source: The second step is moving the plan to `scheduled` status so that it becomes actually published:
uk: Другий крок - переміщення плану в статус `scheduled`, щоб опубліковати план:

source: Let's check what plan registry contains:
uk: Перевіримо, що містить реєстр планів закупівель:

source: We do see the internal `id` of a plan (that can be used to construct full URL by prepending `http://api-sandbox.openprocurement.org/api/0/plans/`) and its `dateModified` datestamp.
uk: Відображається `id` - внутрішній ідентифікатор (який можна використовувати, щоб побудувати повну URL-адресу, додаючи `http://api-sandbox.openprocurement.org/api/0/plans/` на початку) та мітка часу `dateModified`.

source: Modifying plan
uk: Модифікація плану закупівлі

source: Let's update plan by supplementing it with all other essential properties:
uk: Оновимо план шляхом надання їй усіх інших важливих властивостей:

source: We see the added properties have merged with existing plan data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними плану. Додатково оновлена властивість dateModified, щоб відображати останню дату модифікації.

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Tender creation from a procurement plan
uk: Створення закупівлі з плану

source: A tender can be created from your procurement plan. This tender will be linked with the plan using :ref:`tender's plans <tender>` and :ref:`plan's tender_id <tender_id>` fields.
uk: Закупівля може бути створена з відповідного їй плану закупівлі. Закупівля буде пов’язана з планом за допомогою полів :ref:`plans тендеру <tender>` і :ref:`tender_id плану <tender_id>`.

source: System failures during tender-from-plan creation can produce tenders that are not linked with their plans by :ref:`tender_id`.
uk: Системні збої під час створення закупівлі з плану можуть призвести до закупівель, які не пов’язані з їхніми планами по :ref:`tender_id`.

source: Make sure you do use :ref:`2pc` and do not proceed with these error state tender objects (create new ones).
uk: Переконайтеся, що ви використовуєте :ref:`2pc` і не проводте ці помилкові закупівлі (створюйте нові натомість).

source: There are validation rules that are supposed to decline the chance of making a mistake
uk: Для зменшення шансів зробити помилку та зв’язати закупівлю з неправильним планом, встановлені правила валідації

source: There are three of them:
uk: Усього їх три:

source: procurementMethodType
uk: procurementMethodType - відповідність типу процедури плана і тендера

source: procuringEntity.identifier - matching id and scheme with the same fields in tender data
uk: procuringEntity.identifier - відповідність полів id і scheme для плана і тендера

source: classification.id - matching with tender item classification codes using first 4 digits (``336`` is exception)
uk: classification.id - відповідність перших 4-х цифр кодів класифікатора плана і тендера (336 виняток - відповідність перших 3-х цифр)

source: Plan should contain budget breakdown, otherwise it will be an error during tender creation:
uk: План має містити джерела фінансування, інакше буде отрімано помилку під час створення тендеру:

source: Let's add budget breakdown and project to plan:
uk: Додамо джерело фінансування та проект до плану:

source: A successful example looks like this:
uk: Успішний приклад виглядає так:

source: Let's check that the plan status was switched to `complete`:
uk: Перевіримо, чи стан плану було перемкнено на `complete`:

source: After tender was created from plan it's no longer allowed to change plan:
uk: Після створення закупівлі з плану змінити план більше неможливо:

source: Plan completing without tendering
uk: Завершення плану без торгів

source: There is a way to complete a plan without tender creation:
uk: Існує спосіб завершити план без створення тендеру:

source: This only works if `procurementMethodType` is one of the following:
uk: Це працює лише в тому випадку, якщо `procurementMethodType` є одним із наступних:

source: empty string
uk: порожній рядок

source: Plan cancellation
uk: Скасування плану

source: A plan can be cancelled using :ref:`plancancellation`:
uk: План можна скасувати за допомогою :ref:`plancancellation`:

source: Making the cancellation object ``active`` cancels the plan:
uk: Зміна статуса об’єкта скасування на ``active`` скасовує план:

source: Plan rationale update
uk: Оновлення обгурнтування плану закупівлі

source: The ``rationale`` field can be updated at any plan status:
uk: Поле ``rationale`` оновлюється у будь-якому статусі плану закупівлі:

source: Plan fields history
uk: Історія змін полів плану закупівлі

source: There is an endpoint that can show changes history of the certain fields.
uk: Існує окремий метод API, який дозволяє передивлятися історію полів плану закупівлі.

source: At the moment only ``rationale`` is supported:
uk: На даний момент підтримується тільки поле ``rationale`` :

source: Plan of Ukraine
uk: План України

source: If the source of financing is indicated, the Customer may indicate the item of the Plan of Ukraine in `budget.project`.
uk: Якщо зазначено джерело фінансування, Замовник може зазначати пункт Плану України в полі `budget.project`.

source: If item is from dictionary `plan_of_ukraine <https://prozorroukr.github.io/standards/classifiers/plan_of_ukraine.json>`_ than there are additional validations for `name` and `name_en` fields:
uk: Якщо `project.id` вказано з довідника `plan_of_ukraine <https://prozorroukr.github.io/standards/classifiers/plan_of_ukraine.json>`_, то ми побачимо додаткові валідації на поля `name` та `name_en`:

source: Successful adding project from plan of Ukraine:
uk: Успішне додавання джерела фінансування разом з проектом з Плану України:

source: For `state`, `local` and `crimea` budgets, the Customer should indicate the code of Ukraine facility's classifiers in `budget.breakdown.classification` and `budget.breakdown.address.addressDetails`.
uk: Для державних, місцевих бюджетів та бюджетів Автономної Республіки Крим, Замовинк має вказати код з класифікаторів Ukraine facility в полі `budget.breakdown.classification` та `budget.breakdown.address.addressDetails`.

source: For `state` budgets KPK dictionaries are used. They are divided by year, e.g. `KPK-2025 <https://github.com/ProzorroUKR/standards/blob/master/classifiers/kpk_2025.json>`_.
uk: Для державних бюджетів використовується класифікатор КПК. Він поділений на декілька довідників в залежності від року, наприклад `КПК-2025 <https://github.com/ProzorroUKR/standards/blob/master/classifiers/kpk_2025.json>`_.

source: For `local` and `crimea` budgets `KATOTTG <https://github.com/ProzorroUKR/standards/blob/master/classifiers/katottg.json>`_ and `TPKVKMB <https://github.com/ProzorroUKR/standards/blob/master/classifiers/tkpkmb.json>`_ dictionaries are used.
uk: Для місцевих бюджетів та бюджетів Автономної Республіки Крим використовуються класифікатори `КАТОТТГ <https://github.com/ProzorroUKR/standards/blob/master/classifiers/katottg.json>`_ та `ТПКВКМБ <https://github.com/ProzorroUKR/standards/blob/master/classifiers/tkpkmb.json>`_

source: There are additional validations for these kinds of budget's breakdown:
uk: Існують додаткові валідації для планів з цими джерелами фінансування:

source: Successful adding `classification` for `state` budget breakdown:
uk: Додамо `classification` для державного бюджету:

source: Let's look what we have for `local` budget breakdown:
uk: Подивимося, що буде, якщо ми змінимо бюджет на місцевий:

source: Let's add `classification` for `local` budget breakdown and see what happened:
uk: Додамо `classification` для місцевого бюджету і зробимо запит ще раз:

source: Let's add address, KATOTTG is required for `local` budget:
uk: Додамо адресу, після цього ЦБД буде вимагати КАТОТТГ для місцевого бюджету:

source: Successful adding `classification` and `address` for `local` budget breakdown:
uk: Тепер додамо `classification` разом з `address` для місцевого бюджету:
