Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/open/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Configuration
uk: Конфігурація

source: The set of possible configuration values:
uk: Набір можливих значень конфігурації:

source: You can look for more details in :ref:`config` section.
uk: Ви можете ознайомитись з деталями в секції :ref:`config`.

source: Allowed `procuringEntity.kind` values
uk: Дозволені значення `procuringEntity.kind`

source: Creating tender
uk: Створення закупівлі

source: Let's provide the data attribute in the submitted body :
uk: Введемо data атрибут у поданому тілі:

source: Success! Now we can see that new object was created. Response code is `201` and `Location` response header reports the location of the created object. The body of response reveals the information about the created tender: its internal `id` (that matches the `Location` segment), its official `tenderID` and `dateModified` datestamp stating the moment in time when tender was last modified. Note that tender is created with `draft` status.
uk: Успіх! Тепер ми бачимо, що новий об’єкт було створено. Код відповіді `201` та заголовок відповіді `Location` вказує місцерозташування створеного об’єкта. Тіло відповіді показує інформацію про створену закупівлю, її внутрішнє `id` (яке співпадає з сегментом `Location`), її офіційне `tenderID` та `dateModified` дату, що показує час, коли закупівля востаннє модифікувалась. Зверніть увагу, що закупівля створюється зі статусом `draft`.

source: The peculiarity of the Open procedure is that ``procurementMethodType`` was changed from ``belowThreshold`` to ``aboveThreshold``. Also there is no opportunity to set up ``enquiryPeriod``, it will be assigned automatically.
uk: Особливість відкритих торгів в тому, що ``procurementMethodType`` було змінено з ``belowThreshold`` на ``aboveThreshold``. Також тут неможливо встановити ``enquiryPeriod``, бо він буде призначений автоматично.

source: Let's access the URL of the created object (the `Location` header of the response):
uk: Використаємо URL створеного об’єкта (заголовок відповіді `Location`):

source: We can see the same response we got after creating tender.
uk: Ми бачимо ту ж відповідь, що і після створення закупівлі.

source: Let's see what listing of tenders reveals us:
uk: Подивимось, що показує список закупівель:

source: We don't see internal `id` of tender, because tender appears in the listing from `active.tendering` status.
uk: Ми поки не бачимо внутрішнього `id` закупівлі, тому що у списку відображаються закупівлі лише після статусу `active.tendering`

source: Tender can contain several different lots. We can add lot using the following way:
uk: Закупівля може складатись із декількох лотів. Можна створити лот таким чином:

source: Also you will need to update data about item's related lots:
uk: Потрібно оновити дані пов’язані із залежністю на лот:

source: Tender activating
uk: Активація закупівлі

source: At first we needed to add EXCLUSION criteria to our tender(:ref:`About criteria you can read here<criteria_operation>`).
uk: Спочатку нам потрібно додати вийняткові критерії до нашої закупівлі(:ref:`Про критерії ви можете дізнатися тут<criteria_operation>`)

source: Before activating tender it is required to add sign document to tender. If there is no sign document during activation, we will see an error:
uk: Перед активацією тендера необхідно обов'язково додати файл підпису. Якщо такого документу нема, під час активації буде помилка:

source: Sign document should have `documentType: notice` and `title: *.p7s`. Let's add such document:
uk: Файл підпису повинен мати `documentType: notice` та `title: *.p7s`. Додамо такий документ:

source: After adding needed criteria and sign document we can activate our tender, so let's do that:
uk: Після додавання необхідних критеріїв та файлу підпису ми можемо активувати закупівлю:

source: Now We do see the internal `id` of a tender (that can be used to construct full URL by prepending `http://api-sandbox.openprocurement.org/api/0/tenders/`) and its `dateModified` datestamp.
uk: Ми бачимо внутрішнє `id` закупівлі (що може бути використано для побудови повної URL-адреси, якщо додати `http://api-sandbox.openprocurement.org/api/0/tenders/`) та її `dateModified` дату.

source: Modifying tender
uk: Редагування закупівлі

source: Let's update tender by supplementing it with all other essential properties:
uk: Оновимо закупівлю шляхом надання їй усіх інших важливих властивостей:

source: We see the added properies have merged with existing tender data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними закупівлі. Додатково оновлена властивість `dateModified`, щоб відображати останню дату модифікації.

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Procuring entity can not change tender if there are less than 7 days before tenderPeriod ends. Changes will not be accepted by API.
uk: Замовник не може редагувати закупівлю, якщо залишилось менше 7 днів до завершення періоду подання пропозицій. API таких змін не прийме.

source: That is why tenderPeriod has to be extended by 7 days.
uk: Ось чому потрібно продовжити період подання пропозицій на 7 днів.

source: Procuring entity can set bid guarantee:
uk: Замовник може встановити забезпечення тендерної пропозиції:

source: Uploading documentation
uk: Завантаження документів

source: Procuring entity can upload PDF files into the created tender. Uploading should follow the :ref:`upload` rules.
uk: Замовник може завантажити PDF файл у створену закупівлю. Завантаження повинно відбуватись згідно правил :ref:`upload`.

source: `201 Created` response code and `Location` header confirm document creation. We can additionally query the `documents` collection API endpoint to confirm the action:
uk: Код відповіді `201 Created` та заголовок `Location` підтверджують, що документ було створено. Додатково можна зробити запит точки входу API колекції `документів`, щоб підтвердити дію:

source: The single array element describes the uploaded document. We can upload more documents:
uk: Один елемент масиву описує завантажений документ. Ми можемо завантажити більше документів:

source: And again we can confirm that there are two documents uploaded.
uk: І знову можна перевірити, що є два завантажених документа.

source: In case we made an error, we can reupload the document over the older version:
uk: Якщо сталась помилка, ми можемо ще раз завантажити документ поверх старої версії:

source: And we can see that it is overriding the original version:
uk: І ми бачимо, що вона перекриває оригінальну версію:

source: Enquiries
uk: Звернення

source: When tender has ``active.tendering`` status and ``Tender.enqueryPeriod.endDate`` hasn't come yet, interested parties can ask questions:
uk: Якщо закупівля має статус ``active.tendering`` та дата завершення періоду подання пропозицій ``Tender.enqueryPeriod.endDate`` ще не прийшла , то зацікавлені учасники можуть подавати звернення чи просити уточнень умов закупівлі:

source: Procuring entity can answer them:
uk: Замовник може відповісти на них:

source: One can retrieve either questions list:
uk: Можна отримати список запитань:

source: or individual answer:
uk: або окрему відповідь:

source: Enquiries can be made only during ``Tender.enqueryPeriod``
uk: Звернення можна задавати лише протягом періоду уточнень ``Tender.enqueryPeriod``

source: Registering bid
uk: Реєстрація пропозиції

source: Tender status ``active.tendering`` allows registration of bids.
uk: Статус закупівлі ``active.tendering`` дозволяє подання пропозицій.

source: Bidder can register a bid for lot №1:
uk: Учасник може зареєструвати пропозицію для лота №1:

source: And append responses for criteria requirements:
uk: Та додамо відповіді на вимоги критеріїв:

source: Then bidder should approve bid with pending status. If `tenderers.identifier.scheme = 'UA-EDR'` it is required to add sign document to bid. If there is no sign document during activation, we will see an error:
uk: Після цього учасник має підтвердити пропозицію, перевівши у ``pending`` статус. Якщо учасник резидент (`tenderers.identifier.scheme = 'UA-EDR'`), то перед підтвердженням пропозиції він має накласти електронний підпис. Якщо файлу підписа не знайдено під час підтвердження, буде наступна помилка:

source: Sign document should have `documentType: proposal` and `title: *.p7s`. Let's add such document:
uk: Файл підпису має тип документу `documentType: proposal` та розширення `title: *.p7s`. Додамо файл підпису:

source: Let's try to activate bid one more time:
uk: Спробуємо підтвердити пропозицію:

source: It is possible to check the uploaded documents:
uk: Можна перевірити завантажені документи:

source: If we patched some fields in pending bid, then bid becomes `invalid` and should be signed one more time:
uk: При кожному редагуванні вже поданої пропозиції, пропозиція буде переходити в статус `invalid` і її треба буде заново підписати:

source: If we try to activate bidder the new sign will be needed:
uk: Якщо ми спробуємо підтвердити пропозиціію, буде вимагатися новий підпиис:

source: Bidder can register bids for all lots:
uk: Учасник може зареєструвати пропозиції для всіх лотів:

source: Then bidder should upload technical and private documents of proposal.
uk: Учасник повинен завантажити технічні та приватні документи пропозиції.

source: We can update tender during ``active.tendering`` period. Bids will be invalid after updating tender. For example, let's reduce the lot price to 400.
uk: Закупівлю можна оновлювати протягом періоду ``active.tendering``. Всі пропозиції вважатимуться недійсними після оновлення закупівлі. Наприклад, зменшимо ціну лота до 400.

source: Here is the bidder's proposal after tender was updated.
uk: Це пропозиція учасника після оновлення закупівлі.

source: Firstly bidder has to renew bid, even if he was placing a bid just for a lot №1.
uk: Спочатку учасник повинен поновити свою пропозицію, навіть якщо подавав її лише для лота №1.

source: Then bidder has to renew bid only for a lot №1.
uk: Потім учасник повинен поновити пропозицію для лота №1.

source: Auction
uk: Аукціон

source: After auction is scheduled anybody can visit it to watch. The auction can be reached at `Tender.auctionUrl`:
uk: Після того, як аукціон заплановано, будь-хто може його відвідати для перегляду. Аукціон можна подивитись за допомогою `Tender.auctionUrl`:

source: Bidders can find out their participation URLs via their bids:
uk: Учасники можуть дізнатись свої URL-адреси для участі через свої пропозиції:

source: See the `Bid.participationUrl` in the response. Similar, but different, URL can be retrieved for other participants:
uk: Дивіться на `Bid.participationUrl` у відповіді. Схожу, але іншу, URL-адресу можна отримати для інших учасників:

source: Abnormally low price
uk: Аномально низька ціна

source: An award can contain a milestone of type ``apl``
uk: Об’єкт award може містити milestone типу ``apl``

source: Procuring entity cannot change the status of the award before ``milestone.dueDate``
uk: Замовник не може змінити статус award до настання “milestone.dueDate”

source: During this time the bidder can upload ``evidence`` documents to his bid
uk: Протягом цього часу учасник торгів може завантажувати документи ``evidence`` до своєї заявки

source: Confirming qualification
uk: Підтвердження кваліфікації

source: Qualification comission can set award to `active` or `unsuccessful` status.
uk: Кваліфікаційна комісія може винести рішення по переможцю або відхилити award - перевести авард в `active` або `unsuccessful` статус.

source: There are validations before registering qualification decision:
uk: Валідація значення полів відповідно до рішення під час винесення рішення:

source: `eligible: True` and `qualified: True` - for setting award from `pending` to `active`
uk: `eligible: True` та `qualified: True` - при переході award з `pending` в `active`

source: `eligible: False` and `qualified: True` OR `eligible: True` and `qualified: False` OR `eligible: False` and `qualified: False` - for setting award from `pending` to `unsuccessful`
uk: `eligible: False` та `qualified: True` АБО `eligible: True` та `qualified: False` АБО `eligible: False` та `qualified: False` - при переході award з `pending` в `unsuccessful`

source: Let's try to set `unsuccessful` status for `qualified` and `eligible` award and we will see an error:
uk: Спробуємо відхилити авард для `qualified` та `eligible` учасника:

source: Let's try to set `active` status for `non-qualified` or `non-eligible` award and we will see an error:
uk: Спробуємо винести рішення по переможцю по аварду для `non-qualified` або `non-eligible` учасника:

source: Before making decision it is required to add sign document to award. If there is no sign document during activation, we will see an error:
uk: Перед прийняттям рішення по переможцю необхідно обов'язково додати файл підпису до аварду. Якщо такого документу нема, під час активації буде помилка:

source: The same logic for `unsuccessful` status:
uk: Така сама логіка при відхилені аварду:

source: Qualification commission registers its decision via the following call:
uk: Кваліфікаційна комісія реєструє своє рішення:

source: Setting Contract
uk: Налаштування угоди

source: In EContracting the contract is created directly in contracting system.
uk: В режимі Е-Контрактінгу угода створюється безпосередньо в системі угод.

source: Some of data will be mirrored to tender until contract will be activated for backward compatibility.
uk: Деякі дані для забезпечення сумісності будуть дублюватись в закупівлі до тих пір, поки угода не буде активована.

source: Read more about working with EContracting in contracting system in :ref:`contracting_tutorial` section.
uk: Більше дізнатись про роботу з Е-Контрактінгом в системі угод можна в розділі :ref:`contracting_tutorial`.

source: Cancelling tender
uk: Скасування закупівлі

source: Tender creator can cancel tender anytime (except when tender in status `active.auction` or in terminal status e.g. `unsuccessful`, `canceled`, `complete`).
uk: Замовник може скасувати закупівлю у будь-який момент (крім закупівель у статусі `active.auction` чи у кінцевому стані, наприклад, `usuccesfull`, `canceled`, `complete`).

source: The following steps should be applied:
uk: Для цього потрібно виконати наступні кроки:

source: Prepare cancellation request.
uk: Приготуйте запит на скасування.

source: Fill it with the protocol describing the cancellation reasons.
uk: Наповніть його протоколом про причини скасування.

source: Passing complaint period(4 days)
uk: Проходження періоду оскарження(триває 4 дня)

source: Cancel the tender with the prepared reasons.
uk: Скасуйте закупівлю через подані причини.

source: Only the request that has been activated (4th step above) has power to cancel tender. I.e. you have to not only prepare cancellation request but to activate it as well.
uk: Запит на скасування, який не пройшов активації (4-й крок), не матиме сили, тобто, для скасування закупівлі буде обов’язковим не тільки створити заявку, але і активувати її.

source: For cancelled cancellation you need to update cancellation status to `unsuccessful` from `draft` or `pending`.
uk: Для відміни скасування закупівлі, вам потрібно оновоить статус скасування до `unsuccessful` з `draft` чи `pending`.

source: See :ref:`cancellation` data structure for details.
uk: Дивіться структуру запиту :ref:`cancellation` для більш детальної інформації.

source: Preparing the cancellation request
uk: Формування запиту на скасування

source: You should pass `reason` and `reasonType`, `status` defaults to `draft`.
uk: Ви повинні передати змінні `reason` та `reasonType`, `status` у стані `draft`.

source: There are four possible types of cancellation reason - tender was `noDemand`, `unFixable`, `forceMajeure` and `expensesCut`.
uk: При скасуванні, замовник має визначити один з чотирьох типів reasonType: `noDemand`, `unFixable`, `forceMajeure` aбо `expensesCut`.

source: `id` is autogenerated and passed in the `Location` header of response.
uk: `id` генерується автоматично і повертається у додатковому заголовку відповіді `Location`.

source: You can change ``reasonType`` value to any of the above.
uk: Ви можете виправити тип на будь-який що вказаний вище.

source: Filling cancellation with protocol and supplementary documentation
uk: Наповнення протоколом та іншою супровідною документацією

source: This step is required. Without documents you can't update tender status.
uk: Цей крок обов'язковий. Без документів ви не можете оновити статус скарги.

source: Upload the file contents
uk: Завантажити вміст файлу

source: Change the document description and other properties
uk: Зміна опису документа та інших властивостей

source: Upload new version of the document
uk: Завантажити нову версію документа

source: Passing Complaint Period
uk: Проходження періоду оскарження

source: For activate complaint period, you need to update cancellation from `draft` to `pending`.
uk: Для того щоб перейти до періоду оскарження потрібно змінити стаутс скасування з `draft` на `pending`.

source: When cancellation in `pending` status the tender owner is prohibited from all actions on the tender.
uk: Коли скасування закупівлі в статусі `pending` замовнику зобороняються всі дії по закупівлі.

source: Activating the request and cancelling tender
uk: Активація запиту та скасування закупівлі

source: if the complaint period(duration 4 days) is over and there were no complaints or all complaints are canceled, then cancellation will automatically update status to `active`.
uk: якщо період оскарження(триває 4 дня) скінчився та не було ніяких скарг на скасування закупівлі або скарги були скасовані, то скасування автоматично зміює статус на `active`.
