Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/pricequotation/overview.po
Languages: uk

source: Overview
uk: Огляд

source: The Open Procurement `Price Quotation` procedure is plugin to `Open Procurement API` software.
uk: The Open Procurement `Price Quotation` процедура - це плагін до `Open Procurement API`.

source: REST-ful interface to plugin is in line with core software design principles.
uk: REST-ful інтерфейс для плагіна відповідає основним принципам дизайну програмного забезпечення.

source: Main responsibilities
uk: Основні задачі

source: Price Quotation procedure is dedicated to Open Tender procedure for Ukrainian below threshold procurements. The code for that type of procedure is `priceQuotation`.
uk: Процедура Запиту цінових пропозицій що описана в цій документації, стосується допорогових закупівель від 50 тис. грн. до 200 тис. грн. Код процедури такого типу: ``priceQuotation``

source: Business logic
uk: Бізнес логіка

source: Publication of the Price Quotation
uk: Публікація Запиту цінових пропозицій

source: Business process begins when the Procuring Entity creates a Price Quotation procedure using parameters from the e-Catalogues Profile database.
uk: Бізнес процес починається при створенні процедури Запиту цінових пропозицій Замовником, використовуючи параметри з бази даних електронних каталогів.

source: After Procuring Entity supplements the procedure with quantity of items and delivery details and publishes the tender by sending a request for Price Quotation to ProZorro Business Process Engine the process starts.
uk: Після цього Замовник доповнює процедуру кількістю товарів та реквізитами доставки та опобліковує процедуру закупівлю, шляхом надсилання запиту до Business Process Engine Прозорро.

source: At this moment Business Process Engine receives and validates the Price Quotation request. Given the validation is passed the system automatically informs shortlisted (qualified to specific eCatalogue Profile) suppliers about the request.
uk: В цей момент Business Process Engine отримує та проводить перевірку Запиту цінових пропозицій. Після успішного проходження перевірки система автоматично повідомляє усіх shortlisted `(кваліфікованих до конкретного профілю у каталогах)` постачальників про запит.

source: Tendering
uk: Тендерний процес

source: Receiving a Price Quotation request, supplier decides if they are able to offer the requested product. In case of rejection supplier declines participation in procedure. Until the end of tender period (minimal two working days) suppliers would be able to submit a bid, while BPE will collect and register quotations.
uk: Отримуючи Запит цінової пропозиції, постачальник приймає рішення про готовність запропонувати запитуваний товар. У випадку відмови від запиту постачальник відмовляється приймати участь у закупівлі. До кінця тендерного періоду `(мінімально два робочих дні)` постачальник має надати свою пропозиції, які буде приймати та реєструвати Business Process Engine Прозорро.

source: Awarding, Qualification
uk: Процес визначення переможця

source: After the deadline system will publish received bids, awarding suppleir with most economically advantageous bid allowing to confirm award within two business days. In case if award was not confirmed system will automatically award next supplier providing same confirmation period. In case of no suppliers left system will transfer procedure to status `unsuccessful`.
uk: Після закінчення тендерного періоду система опоблікує отримані пропозиції, нагороджуючи постачальника з найбільш економічно вигідною пропозицією, надаючи два робочих дні на підтвердження нагороди. У випадку якщо нагорода не була підтверджена, система автоматично нагороджує наступного постачальника, надаючи рівноцінний час на підтвердження. У випадку відсутності наступних пропозицій постачальників система переведе процедуру у стан `unsuccesful`.

source: Contracting
uk: Укладання контракту

source: Selecting a winner will lead both Procuring Entity and supplier to the contracting process, where the contract is signed, published and taken to execution.
uk: Підтвердження нагороди приведе Замовника і Постачальника до процесу укладення контракту, в якому контракт підписується, опубліковується та береться у виконання.
