Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/tendering/pricequotation/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: The set of possible configuration values:
uk: Набір можливих значень конфігурації:

source: You can look for more details in :ref:`config` section.
uk: Ви можете ознайомитись з деталями в секції :ref:`config`.

source: Creating tender
uk: Створення закупівлі

source: Let's provide the data attribute in the submitted body :
uk: Введемо data атрибут у поданому тілі:

source: Success! Now we can see that new object was created. Response code is `201` and `Location` response header reports the location of the created object. The body of response reveals the information about the created tender: its internal `id` (that matches the `Location` segment), its official `tenderID` and `dateModified` datestamp stating the moment in time when tender was last modified. Note that tender is created with `draft` status.
uk: Успіх! Тепер ми бачимо, що новий об’єкт було створено. Код відповіді `201` та заголовок відповіді `Location` вказує місцерозташування створеного об’єкта. Тіло відповіді показує інформацію про створену закупівлю, її внутрішнє `id` (яке співпадає з сегментом `Location`), її офіційне `tenderID` та `dateModified` дату, що показує час, коли закупівля востаннє модифікувалась. Зверніть увагу, що закупівля створюється зі статусом `draft`.

source: User receives `access`: `token` with which operations as a `Procuring Entity` role are accessible.
uk: Користувач отримує `access`: `token` з яким доступні операції ролі Замовника.

source: Price Quotation procedure has ``procurementMethodType``: ``priceQuotation`` and ``procurementMethod``: ``selective``.
uk: Процедура Запиту цінових пропозицій має ``procurementMethodType``: ``priceQuotation`` та ``procurementMethod``: ``selective``.

source: Let's access the URL of the created object (the `Location` header of the response):
uk: Використаємо URL створеного об’єкта (заголовок відповіді `Location`):

source: We can see the same response we got after creating tender.
uk: Ми бачимо ту ж відповідь, що і після створення закупівлі.

source: Modifying tender
uk: Модифікація закупівлі

source: Procuring Entity can modify tender before publishing. Let's update tender by supplementing it with all other essential properties:
uk: Замовник може відредагувати закупівлю перед публікацією. Давайте оновимо закупівлю, доповнюючи її усіма іншими необхідними властивостями:

source: We see the added properties have merged with existing tender data. Additionally, the `dateModified` property was updated to reflect the last modification datestamp.
uk: Ми бачимо, що додаткові властивості об’єднані з існуючими даними закупівлі. Додатково оновлена властивість `dateModified`, щоб відображати останню дату модифікації.

source: Checking the listing again reflects the new modification date:
uk: Ще одна перевірка списку відображає нову дату модифікації:

source: Publishing tender (deprecated)
uk: Публікація закупівлі (стара логіка через PQ бот)

source: After creation Procuring Entity publishes procedure by changing status to `draft.publishing` where **priceQuotationBot** robot runs validation of the procedure and supplement procedure with additional data taken from ProZorro e-Catalogues database including `shortListedFirms`.
uk: Після створення Замовник публікує процедуру, змінивши статус на `draft.publishing`, де робот **priceQuotationBot** запускає перевірку процедури та доповнює процедуру додатковими даними, отриманими з бази даних електронних каталогів ProZorro, включаючи `shortListedFirms`.

source: After successful validation priceQuotationBot transmit procedure to status: `active.tendering`
uk: Після успішної валідації priceQuotationBot переводить процедуру в статус: `active.tendering`

source: In case if procedure do not pass validation due to invalid options, it will be switched to status: `draft.unsuccessful` by the **priceQuotationBot**.
uk: У разі, якщо процедура не пройде перевірку через недійсні параметри, вона буде переведена в статус: `draft.unsuccessful` за допомогою **priceQuotationBot**.

source: Activating tender
uk: Активація закупівлі

source: After creation Procuring Entity can activate tender by changing status to `active.tendering`.
uk: Після створення Замовник може активувати закупівлю, змінивши статус на `active.tendering`.

source: Before activating tender it is required to add sign document to tender. If there is no sign document during activation, we will see an error:
uk: Перед активацією тендера необхідно обов'язково додати файл підпису. Якщо такого документу нема, під час активації буде помилка:

source: Sign document should have `documentType: notice` and `title: *.p7s`. Let's add such document:
uk: Файл підпису повинен мати `documentType: notice` та `title: *.p7s`. Додамо такий документ:

source: During activation CBD runs some validations:
uk: Під час активації на ЦБД спрацьовують наступні перевірки:

source: Existence of item profile in catalogue
uk: Наявність профілю товару в каталозі

source: Profile should be active or general
uk: Профіль повинен мати статус `active` або `general`

source: Existence of related agreement
uk: Наявність відповідного договору

source: Equality of profile agreement and related agreement in tender
uk: Перевірка, що угода в профілі та пов’язана угода в тендері однакові

source: Agreement should not be in terminated status
uk: Угода не повинна бути розірвана (статус terminated)

source: If Procuring Entity will try to activate PQ procedure with non-existed profile in catalogue, we will see error:
uk: Якщо Замовник спробує активувати процедуру PQ з неіснуючим профілем у каталозі, ми побачимо помилку:

source: If profile isn't in active status, we will see error:
uk: Якщо профіль не активний, ми побачимо помилку:

source: In case profile agreement and related agreement in tender aren't equal, the next error will be generated:
uk: Якщо угода (agreement) в профілі та угода в тендері не однакові, буде згенеровано наступну помилку:

source: If agreement is in terminated status:
uk: Якщо угода розірвана:

source: If PQ procedure matches all requirements, it will be switched to `active.tendering`:
uk: Якщо процедура PQ відповідає всім вимогам, вона буде переведена в статус `active.tendering`:

source: Bid submission
uk: Подача пропозицій

source: Registering bid
uk: Реєстрація пропозиції

source: Tender status ``active.tendering`` allows registration of bids.
uk: Статус закупівлі ``active.tendering`` дозволяє подання пропозицій.

source: If bid `tenderer` is not a member of agreement, than we will see an error during registration of bid:
uk: Якщо `tenderer` в пропозиції не є кваліфікованим учасником в угоді, то ми побачимо помилку під час подання пропозиції:

source: Bidder can register a bid with ``draft`` status:
uk: Учасник може зареєструвати пропозицію зі статусом ``draft`` (чернетка):

source: User receives `access`: `token` with which operations as a `Supplier` role are accessible.
uk: Користувач отримує `access`: `token` з яким доступні операції ролі Постачальника.

source: and approve to pending status:
uk: і підтвердити її, перевівши у ``pending`` статус:

source: Modifying bid
uk: Модифікація пропозиції

source: Bid can be updated until the end of tender period.
uk: Пропозиція може бути оновленою до закінчення тендерного періоду.

source: Deleting bid
uk: Видалення пропозиції

source: Bid can be deleted until the end of tender period.
uk: Поки не завершився період подання пропозицій постачальник має можливість видаляти свою пропозицію.

source: Let's add new bid to tender:
uk: Додамо нову пропозицію до тендеру:

source: Now we can delete this bid:
uk: У постачальника є змога видалити її, якщо була допущена помилка:

source: If bidder try to restore you bi, we will see the next error:
uk: Якщо постачальник спробує знову відновити свою пропозицію, то отримає наступну помилку:

source: Proposal Uploading
uk: Завантаження пропозиції

source: Then bidder should upload proposal document(s):
uk: Потім учасник повинен завантажити документ(и) пропозиції:

source: It is possible to check the uploaded documents:
uk: Можна перевірити завантажені документи:

source: Active tendering period end
uk: Закінчення періоду подання пропозицій

source: After tender period ended, CBD checks one more time status of contract for suppliers in agreement. If contract status is still `active` - bid is getting `active` status too, in other cases - bid gets `invalid` status.
uk: По закінченню періоду подання пропозицій (active.tendering) система знову перевіряє статус учасника у agreement. Якщо досі `аctive` - bid отримує `status:active`, якщо інший статус - пропозиція падає у статус `invalid`.

source: Let's imagine that second contract supplier in agreement was disqualified during `active.tendering` period.
uk: Припустимо, що другий постачальник в угоді був дискваліфікований під час періоду `active.tendering`.

source: Let's see our bids statuses after `active.tendering` period ends. Last bid was disqualified:
uk: Подивимося на статуси наших пропозицій після закінчення періоду `active.tendering`. Остання пропозиція, в якій постачальник був дискваліфікований в угоді, тепер має статус `invalid`:

source: Awarding process
uk: Процес визначення переможця

source: After the tender period end date, system automatically creates `award` in `pending` status for the bid with the most economically advantageous price.
uk: Після закінчення тендерного періоду, система автоматично створює ``award`` у статусі ``pending`` для пропозиції з найбільш економічно вигідною ціною.

source: Procuring Entity can accept `award` by transferring it to status: `active`.
uk: Замовник може прийняти `award` змінивши його статус на `active`.

source: Let's check the listing of `awards`:
uk: Поглянемо на список `awards`:

source: Procuring Entity can cancel `award` after acceptance by changing `award` status to `cancelled`:
uk: Замовник може відхилити `award` після прийняття змінивши його статус на `cancelled`:

source: After canceling `award` system creates `second` `award` for the same bid in status: `pending`:
uk: Після відхилення `award` система створює `другий award` для цієї пропозиції у статусі `pending`:

source: If the offer of the Participant with the lowest price meets the requirements, Procuring Entity uploads a document that recognizes the offer as the Winner `(awards:status:active)`. If it does not meet the requirements, Procuring Entity downloads a protocol confirming its decision to reject the Participant and rejects such an offer `(awards:status:unsuccessful)`. The system leads to the evaluation of the next one with most economically advantageous price `(awards:status:pending)`.
uk: Якщо пропозиція Учасника з найменшою ціною відповідає вимогам, Замовник завантажує документ, що підтверджує його рішення і визнає пропозицію Переможцем `(awards:status:active)`. Якщо не відповідає, Замовник завантажує протокол, що підтверджує його рішення про відхилення Учасника та відхиляє таку пропозицію `(awards:status:unsuccessful)`. Система приводить до оцінки наступного за ціною Учасника `(awards:status:pending)`.

source: Let's decline `award` by transferring it to status: `unsuccessful`.
uk: Відхилимо `award` змінивши його статус на `unsuccessful`.

source: In that case `Award` will be granted to the next bid with most economically advantageous price.
uk: В цьому випадку `Award` буде наданий до наступної пропозиції з найбільш економічно вигідною ціною.

source: Procuring Entity can accept second bidder `award` by transferring it to status: `active`.
uk: Замовник може прийняти `award` другого учасника змінивши його статус на `active`.

source: In the case of `award` being transferred to `unsuccessful` status for the last bid procedure will inherit termination status: **`unsuccessful`**.
uk: У випадку переходу `award` останньої пропозиції у статус `unsuccessful` процедура набуде кінцевий статус: **`unsuccessful`**.

source: Setting Contract
uk: Налаштування угоди

source: There are to modes of contracting depending on system configuration:
uk: Є два режими контрактування в залежності від конфігурації системи:

source: Regular contracting
uk: Контрактінг

source: In regular contacting the contract will be created in tender system first.
uk: В режимі звичайного контрактінгу угода буде створена спочатку в системі закупівель.

source: Read more about working with regular contracting in tendering system in :ref:`old_contracting_tutorial_registration` section.
uk: Більше дізнатись про роботу з контрактінгом в системі закупівель можна в розділі :ref:`old_contracting_tutorial_registration`.

source: When the tender is completed (after contracts activation), contract (that has been created in the tender system) is transferred to the contract system **automatically**.
uk: Коли закупівля завершена (після активації угод), угода (яка була створена в системі закупівель) **автоматично** переноситься до системи угод.

source: Read more about working with regular contracting in contracting system in :ref:`old_contracting_tutorial` section.
uk: Більше дізнатись про роботу з контрактінгом в системі угод можна в розділі :ref:`old_contracting_tutorial`.

source: EContracting
uk: Е-Контрактінг

source: In EContracting the contract is created directly in contracting system.
uk: В режимі Е-Контрактінгу угода створюється безпосередньо в системі угод.

source: Some of data will be mirrored to tender until contract will be activated for backward compatibility.
uk: Деякі дані для забезпечення сумісності будуть дублюватись в закупівлі до тих пір, поки угода не буде активована.

source: Read more about working with EContracting in contracting system in :ref:`econtracting_tutorial` section.
uk: Більше дізнатись про роботу з Е-Контрактінгом в системі угод можна в розділі :ref:`econtracting_tutorial`.

source: Cancelling tender
uk: Відміна закупівлі

source: Tender creator can cancel tender anytime (except when tender in terminal status e.g. `draft.unsuccessful`, `unsuccessful`, `cancelled`, `complete`).
uk: Замовник може скасувати закупівлю у будь-який момент (крім закупівель у кінцевому стані, наприклад, `unsuccessful`, `cancelled`, `complete`).

source: The following steps should be applied:
uk: Для цього потрібно виконати наступні кроки:

source: Prepare cancellation request.
uk: Приготуйте запит на скасування.

source: Fill it with the protocol describing the cancellation reasons.
uk: Наповніть його протоколом про причини скасування.

source: Cancel the tender with the prepared reasons.
uk: Скасуйте закупівлю через подані причини.

source: Only the request that has been activated (3rd step above) has power to cancel tender. I.e. you have to not only prepare cancellation request but to activate it as well.
uk: Запит на скасування, який не пройшов активації (3-й крок), не матиме сили, тобто, для скасування закупівлі буде обов’язковим не тільки створити заявку, але і активувати її.

source: For cancelled cancellation you need to update cancellation status to `unsuccessful` from `draft` or `pending`.
uk: Для відміни скасування закупівлі, вам потрібно оновити статус скасування до `unsuccessful` з `draft` чи `pending`

source: See :ref:`cancellation` data structure for details.
uk: Дивіться структуру запиту :ref:`cancellation` для більш детальної інформації.

source: Preparing the cancellation request
uk: Формування запиту на скасування

source: You should pass `reason` and `reasonType`, `status` defaults to `draft`.
uk: Ви повинні передати змінні `reason` та `reasonType`, `status` у стані `draft`.

source: There are four possible types of cancellation reason - tender was `noDemand`, `unFixable`, `forceMajeure` and `expensesCut`.
uk: При скасуванні, замовник має визначити один з чотирьох типів reasonType: `noDemand`, `unFixable`, `forceMajeure` aбо `expensesCut`.

source: `id` is autogenerated and passed in the `Location` header of response.
uk: `id` генерується автоматично і повертається у додатковому заголовку відповіді `Location`:

source: You can change ``reasonType`` value to any of the above.
uk: Ви можете виправити тип на будь-який що вказаний вище.

source: Filling cancellation with protocol and supplementary documentation
uk: Наповнення протоколом та іншою супровідною документацією

source: This step is required. Without documents you can't update tender status.
uk: Цей крок обов'язковий. Без документів ви не можете оновити статус закупівлі.

source: Upload the file contents
uk: Завантажити вміст файлу

source: Change the document description and other properties
uk: Зміна опису документа та інших властивостей

source: Upload new version of the document
uk: Завантажити нову версію документа

source: Activating the request and cancelling tender
uk: Активація запиту на відміну закупівлі
