Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/tendering/open/overview.po
Languages: uk

source: Overview
uk: Огляд

source: REST-ful interface to plugin is in line with core software design principles.
uk: REST-ful інтерфейс для плагіна відповідає основним принципам дизайну програмного забезпечення.

source: Main responsibilities
uk: Основні задачі

source: Open Procurement Open procedure is dedicated to Open Tender procedure for Ukrainian above threshold procurements. The code for that type of procedure is `aboveThreshold`.
uk: Open процедура, що описана в цій документації, стосується процедури українських відкритих торгів для понадпорогових закупівель. Код процедури такого типу - `aboveThreshold`.

source: Business logic
uk: Бізнес логіка

source: The approach to Open procedure is different from core Open Procurement API procedure (that is used for below threshold procurements) mainly in :ref:`stage that precedes <open_tendering>` auction. Differences are in the following aspects:
uk: Підхід до відкритих торгів відрізняється від основної процедури Open Procurement API (яка використовується для допорогових закупівель) в основному :ref:`етапом закупівлі, що проходить перед <open_tendering>` аукціоном. Детально різницю описано в пунктах нижче:

source: Tender can be edited through the whole tenderPeriod (while in active.tendering state), but any edit that is close to tenderPeriod.endDate would require extending that period.
uk: Закупівлю можна редагувати протягом усього періоду подання пропозицій - tenderPeriod (коли тендер знаходиться в стані active.tendering). Але коли редагування відбувається занадто близько до завершення періоду подання пропозицій - tenderPeriod.endDate, потрібно продовжити цей період.

source: There is no dedicated active.enguiries state.
uk: Немає стану active.enguiries.

source: Questions can be asked within enquiryPeriod that is based upon tenderPeriod.
uk: Запитання можна задавати в період уточнень - enquiryPeriod, що відбувається в період подання пропозицій - tenderPeriod.

source: Answers are provided during the whole tenderPeriod.
uk: Відповіді можна давати протягом усього періоду подання пропозицій - tenderPeriod.

source: Bids can be placed during the whole tenderPeriod.
uk: Пропозиції можна подавати протягом усього періоду подання пропозицій - tenderPeriod.

source: Placed bids are invalidated after any tender condition editing and have to be re-confirmed.
uk: Подані пропозиції стають недійсними після будь-якої зміни закупівлі замовником, тому їх потрібно підтвердити знову.

source: Next steps
uk: Наступні кроки

source: You might find it helpful to look at the :ref:`open_tutorial`.
uk: Можливо вам буде цікаво прочитати :ref:`open_tutorial`.
