Repository: ProzorroUKR/openprocurement.api
Catalog: docs/locale/*/LC_MESSAGES/contracting/econtract/tutorial.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Creating contract
uk: Створення договору

source: Let's say that we have conducted tender with award. When the award is activated, a contract is **automatically** created in the tender with a limited set of fields(`id`, `awardID`, `status`, `date`, `value`) and in the contracting module with a full set of fields(:ref:`Econtract`) in ``pending`` status.
uk: Нехай у нас відбулась закупівля і є переможець. Після вибору перможця **автоматично** створюється контракт в закупівлі з обмеженим набором полів(`id`, `awardID`, `status`, `date`, `value`) та в системі договорів з повним набором полів(:ref:`Econtract`) у статусі ``pending``.

source: A contract is created with additional fields:
uk: Договір створюється з додатковими полями:

source: `contractTemplateName` - copied from tender if exists (more about it in :ref:`contract-template-name`)
uk: `contractTemplateName` - копіюється з закупівлі, якщо вона встановлена (більше про це в :ref:`contract-template-name`)

source: `period` - `startDate` equals `dateCreated` + 5 calendar days, `endDate` is the end of the year of `startDate`
uk: `period` - `startDate` дорівнює `dateCreated` контракту + 5 календарних днів, `endDate` дорівнює кінець року, що вказаний у `startDate`

source: A PQ contract is created with additional fields:
uk: Договір PQ створюється з додатковими полями:

source: `attributes` - formed from requirements and responses in tender
uk: `attributes` - формується з вимог та відповідей на вимоги у закупівлі

source: Also, PDF document is created based on the template (`contractTemplateName`) and automatically attached to the contract with documentType `contractNotice`.
uk: Також, PDF документ створюється на основі шаблону (`contractTemplateName`) та автоматично прикріплюється до договору з documentType `contractNotice`.

source: This document will be required for signing for both supplier and buyer later to activate the contract.
uk: Цей документ буде потрібен для підписання як постачальником, так і замовником пізніше, щоб активувати договір.

source: Getting contract
uk: Отримання договору

source: Contract in the tender system
uk: Договір в системі закупівель

source: *Contract id is the same in both tender and contract system.*
uk: *Ідентифікатор `id` договору однаковий в системах закупівель та договорів.*

source: Let's access the URL of the created object:
uk: Спробуємо отримати створений об’єкт по URL:

source: Getting access
uk: Отримання доступу

source: For getting access for buyer or supplier endpoint `contracts/{contract_id}/access` is used after contract was created.
uk: Для отримання доступу для замовника або постачальника використовується ендпоінт `contracts/{contract_id}/access` після ствворення контракту.

source: Algorith of getting access:
uk: Алгоритм отримання доступу:

source: POST `/access` with identifier of client - returns token for client
uk: POST `/access` з індентифікатором клієнта - повертає токен для клієнта

source: Main action is POST `/access` - a query with a client identifier determines whether it is a buyer or supplier. If the identifier does not match any of the entities, an error is issued:
uk: Треба зробити POST `/access` - запит з індентифікатором клієнта, по якому визначається чи це buyer чи supplier. Якщо ідентифікатор не відповідає жодній із сутностей, то видається помилка:

source: If identifier is found, then we validate whether authenticated user is an owner for this role:
uk: Якщо індентифікатор знайшло, після цього відбувається валідація чи підходить майданчик, з якого робиться запит для цієї ролі:

source: If identifier is found and owner matches, then the token is set according to the entity for supplier or buyer:
uk: Якщо індентифікатор знайшло і `owner` підходить, то сетапиться токен відповідно до сутності для постачальника або замовника:

source: If buyer get access, we will see in response new `transfer` token too.
uk: Якщо замовник запитує доступ, то у відповіді також буде згенерований новий `transfer` токен.

source: After token generation, it is allowed to regenerate token, make new POST request with this identifier:
uk: Після генерації токену все ще дозволено перегенерувати токен, тому можна робити нові POST запити з цим ідентифікатором:

source: **NOTE:** Then user can modify contract as buyer only using the last generated token.
uk: **NOTE:** Тепер користувачу дозволено редагувати контракт як замовник тільки використовуючи останній згенерований токен.

source: After token was regenerated, previous token can not be used for updating contract:
uk: Після того, як токен був перегенерований, попередній токен при редагуванні контракту вже не можна буде використати:

source: The same algorithm will be for supplier access.
uk: Такий самий алгоритм і для отримання доступу постачальником.

source: Let's require access for supplier:
uk: Запросимо доступ для постачальника:

source: **WARNING:** It is allowed to get access only during contract is `pending`.
uk: **WARNING:** Отримання доступів дозволено тільки під час `pending` контракту.

source: Activating contract
uk: Реєстрація договору

source: If contract was created using new flow with set `contract_owner` in tender for `suppliers` and `buyers` than for activating electronic contract, signer information and all participants signature are required.
uk: Якщо контракт був створений за правилами електронного контрактингу за новим флоу зі встановленними майданчиками для постачальника та замовника ще під час закупівлі, то для активації такого контракту обов'язковими є заповнення інформації підписантів та додавання підписів всіх учасників.

source: To activate contract it is required to add contract signature document type from each participant (supplier and buyer).
uk: Для того, щоб активувати контракт, потрібно замовнику та постачальнику додати в якості документів електронні підписи.

source: Requirements for signing:
uk: Вимоги до підпису:

source: Contract document with documentType `contractNotice` should be signed
uk: Має бути підписаний документ договору з `documentType` `contractNotice`

source: Signature file should be attached to the contract with documentType `contractSignature`
uk: Файл підпису має бути прикріплений до договору з `documentType` `contractSignature`

source: Signature must have following parameters:
uk: Підпис повинен мати наступні параметри:

source: Format: CAdES-X Long
uk: Формат підпису: CAdES-X Long

source: Algorithm: DSTU 4145
uk: Алгоритм підпису: ДСТУ 4145

source: Type: Separate data and signature files (detached)
uk: Тип підпису: Підпис та дані в окремих файлах (detached)

source: Here is a diagram of the signing process:
uk: Діаграма процесу підписання:

source: If both sides signed the current version of contract, than contract becomes `active`.
uk: Після того, як будуть накладені два підписи на поточну весрію контракту, контракт стає `active`.

source: Supplier adds signature document using his token (`supplier_token`) which he got during access query:
uk: Постачальник додає документ підпису використовуючи свій токен (`supplier_token`), який він отримав при запиті доступу:

source: Buyer adds signature document using his token (`buyer_token`) which he got during access query:
uk: Замовник додає документ підпису використовуючи свій токен (`buyer_token`), який він отримав при запиті доступу:

source: If all required signatures are completed, the contract will automatically transition to the `active` status:
uk: Коли обидва підписа є у системі, то система підтверджує, що контракт підписано і активує його:

source: New versions of contract
uk: Нові версії договору

source: If one of sides doesn't agree to sign current version of contract, there is an opportunity to create a new version of contract.
uk: Якщо одна зі сторін договору не погоджується підписувати поточну версію контракту, існує можливість створити нову версію контракту, змінивши деякі поля.

source: Flow:
uk: Етапи:

source: create a cancellation of current version of contract
uk: скасування попереднього контракту

source: POST new version o contract with updates
uk: створення нової версії зі змінами (POST)

source: sign new version and wait till another side agrees to sign (or create new version by his side)
uk: підписання нової версії і очікування поки друга сторона погодиться підписати дану версію (або створення нової версії контракту вже іншою стороною)

source: Cancellations
uk: Скасування

source: It is allowed to cancel current version of contract and create new one during contract is `pending`.
uk: Інсує можливість скасування поточної версії контракту та створення нової тільки поки контракт знаходиться в статусі `pending`.

source: To cancel current version of contract, participant of contract should create a cancellation with reason `requiresChanges`:
uk: Для того, щоб скасувати контракт, учасник договору має додати об'єкт `cancellation` обов'язково вказавши причину скасування `requiresChanges`:

source: Let's look at contract:
uk: Подивимося на договір:

source: It is forbidden to add more than one cancellation:
uk: Заборонено додавати більше ніж один `cancellation`:

source: After cancellation created, there is forbidden to sign contract:
uk: Після того, як додано `cancellation`, підписувати цю версію контракту вже заборонено:

source: Create new contract version
uk: Створення нової версії договору

source: Then the same participant should create a new version of contract using his token.
uk: Після скасування той самий учасник має створити нову версію контракту, використовуючи свій токен.

source: If buyer tries to create a new version, he will see an error, as supplier cancelled previous contract:
uk: Якщо постачальник спробує створити нову версію, то він побачить помилку, так як скасував попередню версію замовник:

source: Allowed fields for updating:
uk: Сторона, яка створює нову версію може змінити наступні поля:

source: signerInfo (for supplier or buyer depends on who cancelled contract)
uk: signerInfo (інформацію про підписанта своєї сторони)

source: If participant tried to update another field, he will see an error:
uk: Якщо учасник намагається змінити якесь інше поле, то він побачить помилку:

source: Let's update fields `period` and `signerInfo.name` using token for supplier:
uk: Змінемо наступні поля `period` та `signerInfo.name`, використовуючи токен замовника:

source: Success! Let's look at previous version of contract, it became `cancelled` and cancellation now is `active`:
uk: Успіх! Подивимося на попередню версію контракту, в нього статус тепер `cancelled` і `cancellation` тепер має статус `active`:

source: Let's look at all contracts in tender:
uk: Подивимося на всі контракти в закупівлі:

source: After that new round of signatures begins.
uk: Після цього починається новий етап підписання.

source: Supplier and buyer can sign this new version of contract if they agreed with changes or create new version if disagreed.
uk: Замовник та постачальник можуть підписати нову версію договору, якщо їх влаштовують зміни або створити нову версію, якщо треба ще щось змінити.

source: Cancellations of Econtract
uk: Скасування електронного договору

source: It is allowed to cancel contract while it is on `pending` status.
uk: Договір можна скасувати, поки він в статусі `pending`.

source: There are two `reasonTypes` for creating cancellation of contract:
uk: При створенні скасування договору можна обрати одну з двох причини скасування:

source: Reason `requiresChanges` means that one of the sides doesn't agree to sign current version of contract, and they want to create a new version of contract. Described in :ref:`contract_versions`.
uk: Причина скасування `requiresChanges` використовується, якщо одна зі сторін договору не погоджується підписувати поточну версію контракту і є необхідність створити нову версію контракту, змінивши деякі поля. Детально описано в :ref:`contract_versions`.

source: Reason `signingRefusal` means that the winner of tender is refused to sign aa contract, that's why his award should be cancelled by buyer.
uk: Причина скасування `signingRefusal` використовується, якщо переможець процедури закупівлі відмовився від підписання договору про закупівлю відповідно до вимог тендерної документації або укладення договору про закупівлю. В цьому випадку авард переможця має бути скасований.

source: Participant of contract can create a cancellation with reason `signingRefusal`:
uk: Підписант (замовник/постачальник) може створити `cancellation` з причиною `reasonType = signingRefusal`:

source: After that buyer should cancel the winner via award:
uk: Після цього замовник скасовує переможця - `award` змінює статус на `cancelled`:

source: Let's look at contract one more time and we will see that contract became `cancelled`, cancellation became `active`:
uk: Подивимося на контракт ще раз і побачимо, що в нього статус тепер `cancelled` і `cancellation` тепер має статус `active`:

source: Let's look at tender, the winner is cancelled an awarding is continuing:
uk: Подивимося на закупівлю, переможець скасований і підтвердження кваліфікації продовужється (статус закупівлі знову `active.qualification`):

source: Changes for active contract
uk: Додаткові угоди (зміни) в EContract

source: Changes to the terms of the contracts can be made by the signatories through the submission and signing of an additional agreement. The system uses the terminology "changes".
uk: Зміни в умови контрактів можуть бути внесені підписантами через подання і підписання додаткових угод. В системі використовується термінологія «змін» / «changes».

source: The initiator of the change can be both the buyer and the supplier.
uk: Ініціатором внесення змін може бути обидва замовник і постачальник.

source: The initiator fills in three mandatory fields:
uk: Ініціатор заповнює три обов’язкових поля:

source: string, reason of changes
uk: string, причина змін

source: list, reason type of changes
uk: list, типи причин

source: object, new values in fields
uk: object, нові значення в електронних полях

source: `modifications` is a structure that reflects the changes in the contract field that will be made:
uk: `modifications` це структура, що відображає зміни в електроних поля, які буде внесено:

source: The start and end date for the contract.
uk: Дата початку та кінця договору.

source: Changes can be made only to signed contracts:
uk: Зміни можна вносити тільки в підписані контракти:

source: Creating changes
uk: Створення додаткових угод

source: Request to create a change:
uk: Запит створення пропозиції змін:

source: There are validations for some fields during changes.
uk: Для деяких полів договору існують валідації (такі самі як і були при PATCH для активного договору),

source: For example, if the buyer decided to change currency in contract value:
uk: Наприклад, якщо замовник вирішив змінити валюту в `value` договору:

source: For example, if the supplier decided to change period endDate in contract to incorrect date:
uk: Наприклад, якщо постачальник вирішив змінити період договору на неправильну дату:

source: Change activation
uk: Підписання змін

source: To activate change it is required to add contract signature document type from each participant (supplier and buyer).
uk: Для того, щоб активувати зміни, потрібно замовнику та постачальнику додати в якості документів електронні підписи.

source: If both sides signed the current version of change, than change becomes `active` and modifications will be taken into account during next changes.
uk: Після того, як будуть накладені два підписи на зміни, зміни стають `active`.

source: Supplier adds signature document using his token (`supplier_token`):
uk: Постачальник додає документ підпису використовуючи свій токен (`supplier_token`):

source: Buyer adds signature document using his token (`buyer_token`):
uk: Замовник додає документ підпису використовуючи свій токен (`buyer_token`):

source: If all required signatures are completed, the change will automatically transition to the `active` status:
uk: Коли обидва підписа є у системі, то система підтверджує, що зміни підписано і активує їх:

source: It is allowed to cancel change of contract if it is not actual anymore.
uk: Сторони можуть скасовувати дод. угоди, якщо вони неактуальні, надавши коментар.

source: Create one more change:
uk: Створимо ще одну додаткову угоду:

source: To cancel change, participant of contract should create a cancellation with reason:
uk: Для того, щоб скасувати угоду, учасник договору має додати об'єкт `cancellation` обов'язково вказавши причину скасування:

source: Let's look at change:
uk: Подивимося на додаткову угоду:

source: After cancellation created, there is forbidden to sign change:
uk: Після того, як додано `cancellation`, підписувати цю додаткову угоду вже заборонено:

source: Signing additional changes does not change the electronic fields of the contract itself. That is, if, for example, the value of the contract was changed by an additional change, then changes will contain the current value, and the contract will contain the value current at the time of signing the contract:
uk: Підписання додаткових угод не змінює електронні поля самого контракту. Тобто якщо, наприклад, вартість контракту було змінено додатковою угодою, то в changes буде актуальне значення, а в контракті - актуальне на момент підписання контракту.

source: Items length change
uk: Оновлення специфікації Договору

source: There is an opportunity to change length of items during contract is `active` using `changes`.
uk: Існує можливість змінювати і додавати новий масив items в активному статусі контракту через `changes`.

source: It is allowed to add new items, but the main fields should be the same as in one of previous item in contact.
uk: Дозволяється додавати новий item, але при цьому основні поля мають відповідати попереднім значенням в масиві `items`.

source: Fields that can not be changed:
uk: Поля, які не можна змінювати:

source: Let's try to add new item with new `classification` and we will see an error:
uk: Спробуємо додати новий `item` з новим полем `classification` і побачимо помилку:

source: For example, we can split first item into two new items.
uk: Наприклад, розділимо перший `item` на дві номенклатури з такими самими основними полями.

source: But there is still a validation for unit prices of all items:
uk: Але при цьому все ще існує валідація на суму цін за одиницю для всіх `items`:

source: Let's update quantity in first item and add new item with correct `unit.value`:
uk: Відредагуємо `quantity` в першому `item` і додамо новий `item` з коректною ціною `unit.value`:
