Repository: ProzorroUKR/openprocurement.api
Catalog: docs/source/locale/*/LC_MESSAGES/agreements/tutorial_frameworks.po
Languages: uk

source: Tutorial
uk: Туторіал

source: Exploring basic rules
uk: Базові правила

source: Let's try exploring the `/agreements` endpoint:
uk: Подивимось як працює точка входу `/agreements`:

source: Just invoking it reveals an empty set.
uk: При виклику видає пустий набір.

source: Agreement is transferred from the tender system by an automated process.
uk: Угода автоматично переноситься з модуля тендера.

source: Creating agreement
uk: Створення реєстру

source: Let's say that we have conducted framework, submission and qualification and it has ``active`` status. When the framework is active and you change qualification status to active, system **automatically** created agreement(from framework) with contract(from qualification).
uk: Припустимо, що є кваліфікація, заявка та рішення по заявці в статусах ``active``. Коли заявка в стаусі `active` і ви оновлюєте рішення по заявці до `active` статусу система **автоматично** створює реєстр(з кваліфікації) з контрактом(з рішення по заявці).

source: Getting agreement
uk: Отримання реєстру

source: Let's see our created framework:
uk: Перевіримо нашу кваліфікацію:

source: In our framework you can see the `agreementID` field where stores id of related agreement. When we know id of our agreement we can get it:
uk: В нашій кваліфікації ви можете знайти поле `agreementID` в якому зберегіється ідентифікатор пов'язоного реєстру. Тепер ми можемо отримати на реєстр:

source: Modifying agreement
uk: Зміна реєстру

source: All operation with agreement can make `framework_owner`. Only one thing that can make `framework_owner` is create contract milestones.
uk: Всі операцї над реєстром може виконувати лише `framework_owner`. Лише одна річ, яку може робити `framework_owner` це додавати майлстони до контракту.

source: Contract - object that stores information about participant
uk: Контракт - об'єкт що зберігає інформацію про учасника.

source: Milestone - that's contract history.
uk: Майлстон - це історія контраку.

source: Contract ban
uk: Бан контракту

source: For ban contract, you just need to add milestone to contract with status `ban`:
uk: Для того щоб забанити контракт, потрібно лише створити майлстон зі статусом `ban`:

source: Contract disqualification
uk: Дискваліфікація контракту

source: Let's see our created mailestone. In our mailestone you can see the ``id``.
uk: Давайте подивимось на створений майлстон. В ньому міститься ``id``

source: When we know ``id`` of our mailestone we can patch contract for disqualification, you just need to patch milestone 'type' : 'activation' to status ``met``:
uk: Для дискваліфікації використовуючи майлстон ``id`` можно пропатчити майлстон з 'type' : 'activation' переводом статус в ``met``:
